{"act_id": "BNS-2023", "section_number": "1", "heading_en": "Short title, commencement and application.", "text_en": "(1) This Act may be called the Bharatiya Nyaya\nSanhita, 2023.\n(2)  It  shall  come  into  force  on  such  date1  as  the  Central  Government  may,  by  notification  in  the\nOfficial Gazette, appoint, and different dates may be appointed for different provisions of this Sanhita.\n(3) Every person shall be liable to punishment under this Sanhita and not otherwise for every act or\nomission contrary to the provisions thereof, of which he shall be guilty within India.\n(4)  Any  person  liable,  by  any  law  for  the  time  being  in  force  in  India,  to  be  tried  for  an  offence\ncommitted  beyond  India  shall  be  dealt  with  according  to  the  provisions  of  this  Sanhita  for  any  act\ncommitted beyond India in the same manner as if such act had been committed within India.\n(5) The provisions of this Sanhita shall also apply to any offence committed by—\n(a) any citizen of India in any place without and beyond India;\n(b) any person on any ship or aircraft registered in India wherever it may be;\n(c) any person in any place without and beyond India committing offence targeting a computer\nresource located in India.\nExplanation.—In this section, the word “offence” includes every act committed outside India which,\nif committed in India, would be punishable under this Sanhita.\nA, who is a citizen of India, commits a murder in any place without and beyond India.\nHe can be tried and convicted of murder in any place in India in which he may be found.\nIllustration.\n(6) Nothing in this Sanhita shall affect the provisions of any Act for punishing mutiny and desertion\nof officers, soldiers, sailors or airmen in the service of the Government of India or the provisions of any\nspecial or local law.", "text_hi": "1. (1)  \n\n(2) \n\n(3) \n\n, 2023 \n\n, \n\n, \n\n-\n\n,\n\n-\n\n,\n\n,\n\n \n   \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n   \n \n \n \n   \n \n \n\f10 \n\n [\n\n2  \n\n, \n\n, \n\n, \n\n, \n\n; \n\n, \n\n(4) \n\n(5) \n\n(\n\n(\n\n) \n\n) \n\n(\n\n) \n\n,  \n\n,  \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(6) \n\n,\n\n, \n\n, \n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "2", "heading_en": "Definitions.", "text_en": "In this Sanhita, unless the context otherwise requires,––\n(1) “act” denotes as well a series of acts as a single act;\n(2) “animal” means any living creature, other than a human being;\n(3) “child” means any person below the age of eighteen years;\n(4) “counterfeit”.––A  person  is  said to  “counterfeit” who  causes one thing to resemble  another\nthing, intending by means of that resemblance to practise deception, or knowing it to be likely that\ndeception will thereby be practised.\nExplanation 1.—It is not essential to counterfeiting that the imitation should be exact.", "text_hi": "2. \n\n ; \n\n,\n\n  , \n\n; \n\n; \n\n, \n\n, \n\n, \n\n; \n\n, \n\n, \n\n \n \n \n \n   \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n   \n\f ] \n\n 11 \n\n, \n\n, \n\n-\n\n;  \n\n-\n\n, \n\n    , \n\n, \n\n; \n\n; \n\n,\n\n, \n\n, \n\n, \n\n, \n\n, \n\n; \n\n, \n\n, \n\n; \n\n, \n\n, \n\n, \n\n,\n\n  ; \n\n, \n\n,\n\n, \n\n, \n\n, \n\n, \n\n, \n\n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n   \n   \n   \n\f12 \n\n [\n\n2  \n\n; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n; \n\n, \n\n, \n\n; \n\n, \n\n-\n\n, \n\n,\n\n;  \n\n, \n\n, \n\n; \n\n, \n\n; \n\n, \n\n, \n\n, \n\n ; \n\n, \n\n, \n\n(16) \n\n(i) \n\n(ii) \n\n, \n\n, \n\n, \n\n, \n\n, \n\n; \n\n; \n\n ; \n\n, \n\n(17\n\n(18\n\n(19\n\n(\n\n) \n\n,\n\n-\n\n; \n\n-\n\n, \n\n, \n\n, \n\n ; \n\n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n   \n\f ] \n\n 13 \n\n; \n\n; \n\n(\n\n) \n\n(22) \n\n; \n\n(\n\n) \n\n(\n\n) \n\n, \n\n(\n\n52, \n\n6 ,\n\n,\n\n, \n\n, \n\n, \n\n, \n\n,\n\n, \n\n, \n\n, \n\n, \n\n; \n\n, \n\n, \n\n, \n\n,\n\n,\n\n, \n\n, \n\n60,\n\n, \n\n,\n\n,\n\n; \n\n, \n\n; \n\n,\n\n ; \n\n, \n\n; \n\n, \n\n, \n\n,\n\n(\n\n(\n\n(\n\n(25) \n\n(26) \n\n(27) \n\n(28)\n\n, \n\n  , \n\n; \n\n; \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n\f14 \n\n [\n\n2  \n\n(\n\n, \n\n(\n\n(\n\n(\n\n(\n\n(\n\n, \n\n ; \n\n(\n\n(\n\n ; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n  ; \n\n, \n\n, \n\n, \n\n, \n\n ; \n\n, \n\n ; \n\n ; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n-\n\n-\n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n ; \n\n, \n\n, \n\n, \n\n  ; \n\n-\n\n, \n\n, \n\n ; \n\n \n \n \n \n \n\f ] \n\n 15 \n\n ; \n\n,  1897 \n\n, \n\n(\n\n, \n\n(i) \n\n(ii) \n\n; \n\n,  2013\n\n, \n\n, \n\n ; \n\n, \n\n, \n\n; \n\n,\n\n(29) \n\n(30) \n\n(31) \n\n; \n\n, \n\n, \n\n, \n\n; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n; \n\n, \n\n(32) \n\n(33) \n\n; \n\n, \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n\f16 \n\n [\n\n2  \n\n, \n\n, \n\n, \n\n; \n\n; \n\n; \n\n, \n\n,\n\n, \n\n, \n\n; \n\n; \n\n;\n\n, \n\n,\n\n, \n\n, \n\n; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(\n\n(\n\n(\n\n(\n\n(\n\n, \n\n) \n\n, \n\n) \n\n, \n\n(39) \n\n,\n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "3", "heading_en": "General explanations.—(1) Throughout this Sanhita every definition of an offence, every penal", "text_en": "provision, and every Illustration of every such definition or penal provision, shall be understood subject\nto the exceptions contained in the Chapter entitled “General Exceptions”, though those exceptions are not\nrepeated in such definition, penal provision, or Illustration.\nIllustrations.\n(a)  The  sections  in  this  Sanhita,  which  contain  definitions  of  offences,  do  not  express  that  a  child\nunder seven years of age cannot commit such offences; but the definitions are to be understood subject to\nthe  general  exception  which  provides  that  nothing  shall  be  an  offence  which  is  done  by  a  child  under\nseven years of age.\n(b)  A,  a  police  officer,  without  warrant,  apprehends  Z,  who  has  committed  murder.  Here  A  is  not\nguilty of the offence of wrongful confinement; for he was bound by law to apprehend Z, and therefore the\ncase  falls  within  the  general  exception  which  provides  that  “nothing  is  an  offence  which  is  done  by  a\nperson who is bound by law to do it”.\n(2)  Every  expression  which  is  explained  in  any  Part  of  this  Sanhita,  is  used  in  every  Part  of  this\nSanhita in conformity with the explanation.\n(3)  When  property  is  in  the  possession  of  a  person’s  spouse,  clerk  or  servant,  on  account  of  that\nperson, it is in that person’s possession within the meaning of this Sanhita.\nExplanation.—A person employed temporarily or on a particular occasion in the capacity of a clerk\nor servant, is a clerk or servant within the meaning of this sub-section.\n(4) In every Part of this Sanhita, except where a contrary intention appears from the context, words\nwhich refer to acts done extend also to illegal omissions.\n(5)  When  a  criminal  act  is  done  by  several  persons  in  furtherance  of  the  common  intention  of  all,\neach of such persons is liable for that act in the same manner as if it were done by him alone.\n(6) Whenever an act, which is criminal only by reason of its being done with a criminal knowledge or\nintention, is done by several persons, each of such persons who joins in the act with such knowledge or\nintention is liable for the act in the same manner as if the act were done by him alone with that knowledge\nor intention.\n(7) Wherever  the  causing of  a  certain  effect,  or  an attempt  to cause  that effect,  by  an  act  or  by  an\nomission, is an offence, it is to be understood that the causing of that effect partly by an act and partly by\nan omission is the same offence.\nIllustration.\nA intentionally causes Z’s death, partly by illegally omitting to give Z food, and partly by beating Z.\nA has committed murder.\n(8) When an offence is committed by means of several acts, whoever intentionally cooperates in the\ncommission of that offence by doing any one of those acts, either singly or jointly with any other person,\ncommits that offence.\nIllustrations.\n(a) A and B agree to murder Z by severally and at different times giving him small doses of poison.\nA  and  B  administer  the  poison  according  to  the  agreement  with  intent  to  murder  Z.  Z  dies  from  the\neffects the several doses of poison so administered to him. Here A and B intentionally cooperate in the\ncommission of murder and as each of them does an act by which the death is caused, they are both guilty\nof the offence though their acts are separate.\n(b) A and B are joint jailors, and as such have the charge of Z, a prisoner, alternatively for six hours\nat a time. A and B, intending to cause Z’s death, knowingly cooperate in causing that effect by illegally\nomitting, each during the time of his attendance, to furnish Z with food supplied to them for that purpose.\nZ dies of hunger. Both A and B are guilty of the murder of Z.\n(c)  A,  a  jailor,  has  the  charge  of  Z,  a  prisoner.  A,  intending  to  cause  Z’s  death,  illegally  omits  to\nsupply  Z  with  food;  in  consequence  of  which  Z  is  much  reduced  in  strength,  but  the  starvation  is  not\nsufficient to cause his death. A is dismissed from his office, and B succeeds him. B, without collusion or\ncooperation with A, illegally omits to supply Z with food, knowing that he is likely thereby to cause Z’s\ndeath. Z dies of hunger. B is guilty of murder, but, as A did not cooperate with B. A is guilty only of an\nattempt to commit murder.\n(9) Where several persons are engaged or concerned in the commission of a criminal act, they may be\nguilty of different offences by means of that act.\nIllustration.\nA  attacks  Z  under  such  circumstances  of  grave  provocation  that  his  killing  of  Z  would  be  only\nculpable homicide not amounting to murder. B, having ill-will towards Z and intending to kill him, and\nnot having been subject to the provocation, assists A in killing Z. Here, though A and B are both engaged\nin causing Z’s death, B is guilty of murder, and A is guilty only of culpable homicide.", "text_hi": "3. (1) \n\n, \n\n, \n\n(\n\n(\n\n, \n\n,\n\n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n   \n\f ] \n\n 17 \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(2) \n\n, \n\n(3) \n\n(4) \n\n(5) \n\n(6) \n\n, \n\n, \n\n(7) \n\n(8) \n\n(\n\n-\n\n, \n\n, \n\n, \n\n, \n\n-\n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\f18 \n\n [\n\n2  \n\n, \n\n-\n\n-\n\n, \n\n, \n\n(\n\n(\n\n(9) \n\n,\n\n, \n\n, \n\n, \n\n-\n\n, \n\n, \n\n, \n\n, \n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "4", "heading_en": "Punishments. —The punishments to which offenders are liable under the provisions of this", "text_en": "Sanhita are—\n(a) Death;\n(b) Imprisonment for life;\n(c) Imprisonment, which is of two descriptions, namely:—\n(1) Rigorous, that is, with hard labour;\n(2) Simple;\n(d) Forfeiture of property;\n(e) Fine;\n(f) Community Service.", "text_hi": "4. \n\n, \n\n(\n\n(\n\n(\n\n(\n\n(\n\n(", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "5", "heading_en": "Commutation of sentence.—The appropriate Government may, without the consent of the", "text_en": "offender,  commute  any  punishment  under  this  Sanhita  to  any  other  punishment  in  accordance\nwith section 474 of the Bharatiya Nagarik Suraksha Sanhita, 2023.\nExplanation.—For the purposes of this section the expression “appropriate Government” means, —\n(a) in cases where the sentence is a sentence of death or is for an offence against any law relating\nto a matter to which the executive power of the Union extends, the Central Government; and\n(b)  in  cases  where  the  sentence  (whether  of  death  or  not)  is  for  an  offence  against  any  law\nrelating to a matter to which the executive power of the State extends, the Government of the State\nwithin which the offender is sentenced.", "text_hi": "5. \n\n, \n\n ; \n\n; \n\n, \n\n, \n\n(1) \n\n, \n\n(2) \n\n ; \n\n ; \n\n; \n\n, \n\n ; \n\n, 2023 \n\n, \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n   \n \n \n   \n \n\f ] \n\n 19 \n\n,  \n\n, \n\n; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(\n\n(\n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "6", "heading_en": "Fractions of terms of punishment.—In calculating fractions of terms of punishment,", "text_en": "imprisonment for life shall be reckoned as equivalent to imprisonment for twenty years unless otherwise\nprovided.", "text_hi": "6.", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "7", "heading_en": "Sentence may be (in certain cases of imprisonment) wholly or partly rigorous or simple.—In", "text_en": "every case in which an offender is punishable with imprisonment which may be of either description, it\nshall  be  competent  to  the  Court  which  sentences  such  offender  to  direct  in  the  sentence  that  such\nimprisonment shall be wholly rigorous, or that such imprisonment shall be wholly simple, or that any part\nof such imprisonment shall be rigorous and the rest simple.", "text_hi": "7. \n\n, \n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "8", "heading_en": "Amount of fine, liability in default of payment of fine, etc.—(1) Where no sum is expressed to", "text_en": "which a fine may extend, the amount of fine to which the offender is liable is unlimited, but shall not be\nexcessive.\n(2) In every case of an offence—\n(a) punishable with imprisonment as well as fine, in which the offender is sentenced to a fine,\nwhether with or without imprisonment;\n(b) punishable with imprisonment or fine, or with fine only, in which the offender is sentenced to\na fine,\nit shall be competent to the Court which sentences such offender to direct by the sentence that, in default\nof payment of the fine, the offender shall suffer imprisonment for a certain term, in which imprisonment\nshall be in excess of any other imprisonment to which he may have been sentenced or to which he may be\nliable under a commutation of a sentence.\n(3) The term for which the Court directs the offender to be imprisoned in default of payment of a fine\nshall not exceed one-fourth of the term of imprisonment which is the maximum fixed for the offence, if\nthe offence be punishable with imprisonment as well as fine.\n(4)  The  imprisonment  which  the  Court  imposes  in  default  of  payment  of  a  fine  or  in  default  of\ncommunity service may be of any description to which the offender might have been sentenced for the\noffence.\n(5) If the offence is punishable with fine or community service, the imprisonment which the Court\nimposes in default of payment of the fine or in default of community service shall be simple, and the term\nfor which the Court directs the offender to be imprisoned, in default of payment of fine or in default of\ncommunity service, shall not exceed,—\n(a) two months when the amount of the fine does not exceed five thousand rupees;\n(b) four months when the amount of the fine does not exceed ten thousand rupees; and\n(c) one year in any other case.\n(6) (a) The imprisonment which is imposed in default of payment of a fine shall terminate whenever\nthat fine is either paid or levied by process of law;\n(b)  If,  before  the  expiration  of  the  term  of  imprisonment  fixed  in  default  of  payment,  such  a\nproportion of the fine be paid or levied that the term of imprisonment suffered in default of payment is\nnot less than proportional to the part of the fine still unpaid, the imprisonment shall terminate.\nIllustration.\nA  is  sentenced  to  a  fine  of  one  thousand  rupees  and  to  four  months’  imprisonment  in  default  of\npayment. Here, if seven hundred and fifty rupees of the fine be paid or levied before the expiration of one\nmonth of the imprisonment, A will be discharged as soon as the first month has expired. If seven hundred\nand fifty rupees be paid or levied at the time of the expiration of the first month, or at any later time while\nA  continues  in imprisonment,  A  will  be  immediately  discharged.  If  five  hundred  rupees  of  the fine  be\npaid or levied before the expiration of two months of the imprisonment, A will be discharged as soon as\nthe two months are completed. If five hundred rupees be paid or levied at the time of the expiration of\nthose  two  months,  or  at  any  later  time  while  A  continues  in  imprisonment,  A  will  be  immediately\ndischarged.\n(7) The fine, or any part thereof which remains unpaid, may be levied at any time within six years\nafter the passing of the sentence, and if, under the sentence, the offender be liable to imprisonment for a\nlonger period than six years, then at any time previous to the expiration of that period; and the death of\nthe offender does not discharge from the liability any property which would, after his death, be legally\nliable for his debts.", "text_hi": "8. (1)  \n\n(2) \n\n,  \n\n, \n\n(\n\n(\n\n, \n\n,  \n\n, \n\n ; \n\n, \n\n, \n\n(3) \n\n, \n\n(4) \n\n, \n\n, \n\n, \n\n, \n\n, \n\n,\n\n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\f20 \n\n [\n\n2  \n\n, \n\n, \n\n(5) \n\n, \n\n, \n\n, \n\n,\n\n, \n\n;  \n\n; \n\n,\n\n(\n\n(\n\n(6)(\n\n, \n\n(\n\n; \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(7) \n\n, \n\n ; \n\n, \n\n \n \n \n \n \n \n \n \n \n \n \n \n   \n\f ] \n\n 21", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "9", "heading_en": "Limit of punishment of offence made up of several offences.—(1) Where anything which is an", "text_en": "offence is made up of parts, any of which parts is itself an offence, the offender shall not be punished\nwith the punishment of more than one of such his offences, unless it be so expressly provided.\n(2) Where—\n(a) anything is an offence falling within two or more separate definitions of any law in force for\nthe time being by which offences are defined or punished; or\n(b)  several  acts,  of  which  one  or  more  than  one  would  by  itself  or  themselves  constitute  an\noffence, constitute, when combined, a different offence,\nthe offender shall not be punished with a more severe punishment than the Court which tries him could\naward for any one of such offences.\nIllustrations.\n(a)  A  gives  Z  fifty  strokes  with  a  stick.  Here  A  may  have  committed  the  offence  of  voluntarily\ncausing hurt to Z by the whole beating, and also by each of the blows which make up the whole beating.\nIf A were liable to punishment for every blow, he might be imprisoned for fifty years, one for each blow.\nBut he is liable only to one punishment for the whole beating.\n(b) But, if, while A is beating Z, Y interferes, and A intentionally strikes Y, here, as the blow given to\nY  is  no  part  of  the  act  whereby  A  voluntarily  causes  hurt  to  Z,  A  is  liable  to  one  punishment  for\nvoluntarily causing hurt to Z, and to another for the blow given to Y.", "text_hi": "9. (1) \n\n(2)\n\n(\n\n(\n\n, \n\n, \n\n, \n\n, \n\n, \n\n, \n\n;   \n\n, \n\n, \n\n, \n\n, \n\n, \n\n(\n\n, \n\n, \n\n, \n\n(", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
{"act_id": "BNS-2023", "section_number": "10", "heading_en": "Punishment of person guilty of one of several offences, judgment stating that it is doubtful", "text_en": "of  which.—In  all  cases  in  which  judgment  is  given  that  a  person  is  guilty  of  one  of  several  offences\nspecified in the judgment, but that it is doubtful of which of these offences he is guilty, the offender shall\nbe punished for the offence for which the lowest punishment is provided if the same punishment is not\nprovided for all.", "text_hi": "10. \n\n, \n\n, \n\n, \n\n, \n\n,\n\n, \n\n, \n\n, \n\n, \n\n, \n\n,", "source_hi": "D:\\development\\workspace\\Constitution_app\\data\\processed\\pdf\\bns_2023_hi.txt"}
