{"act_id": "BNSS", "section_number": "1", "heading_en": "Short title, extent and commencement.—(1) This Act may be called the Bharatiya Nagarik", "text_en": "Suraksha Sanhita, 2023.\n(2) The provisions of this Sanhita, other than those relating to Chapters IX, XI and XII thereof, shall\nnot apply—\n(a) to the State of Nagaland;\n(b) to the tribal areas,\nbut the concerned State Government may, by notification, apply such provisions or any of them\nto  the  whole  or  part  of  the  State  of  Nagaland  or  such  tribal  areas,  as  the  case  may  be,  with  such\nsupplemental, incidental or consequential modifications, as may be specified in the notification.\nExplanation.—In  this  section,  “tribal  areas”  means  the  territories  which  immediately  before\nthe 21st day of January, 1972, were included in the tribal areas of Assam, as referred to in paragraph 20 of\nthe  Sixth  Schedule  to  the    Constitution,  other  than  those  within  the  local  limits  of  the  municipality  of\nShillong.\n(3) It shall come into force on such date1 as the Central Government may, by notification in the Official\nGazette, appoint.", "text_hi": "1. (1) , \n \n(2)  9,  11  12 \n , \n()  ; \n() , \n, , , \n, , \n, , ps, ,   ,\n156   [2 \n \n, \n, 1972 ,  20 \n \n(3) , , \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "2", "heading_en": "Definitions.—(1) In this Sanhita, unless the context otherwise requires,—", "text_en": "(a) “audio-video electronic” means shall include use of any communication device for the\npurposes of video conferencing, recording of processes of identification, search and seizure or\nevidence, transmission of electronic communication and for such other purposes and by such other\nmeans as the State Government may, by rules provide;\n(b) “bail” means release of a person accused of or suspected of commission of an offence from the\ncustody of law upon certain conditions imposed by an officer or Court on execution by such person of\na bond or a bail bond;\n(c) “bailable offence” means an offence which is shown as bailable in the First Schedule, or which\nis made bailable by any other law for the time being in force; and “non-bailable offence” means any\nother offence;\n(d) “bail bond” means an undertaking for release with surety;\n(e) “bond” means a personal bond or an undertaking for release without surety;\n(f) “charge” includes any head of charge when the charge contains more heads than one;", "text_hi": "2.   ,         , \n() -\n \n, \n,\n;   \n \n \n \n \n \n \n;  \n()           \n              \n          \n  ; \n() \n;  \n() \n;  \n()  ,        ,   \n    ; \n()           \n     ,      \n              \n ; \n(           \n               \n   ,      ,   ,   \n     \n   ,       \n      ,       \n             \n,    ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "3", "heading_en": "Construction of references.—(1) Unless the context otherwise requires, any reference in any law,", "text_en": "to a Magistrate without any qualifying words, Magistrate of the first class or a Magistrate of the second\nclass shall, in relation to any area, be construed as a reference to a Judicial Magistrate of the first class or\nJudicial Magistrate of the second class, as the case may be, exercising jurisdiction in such area.\n(2) Where, under any law, other than this Sanhita, the functions exercisable by a Magistrate relate to\nmatters,—\n(a) which involve the appreciation or shifting of evidence or the formulation of any decision which\nexposes any person to any punishment or penalty or detention in custody pending investigation, inquiry\nor trial or would have the effect of sending him for trial before any Court, they shall, subject to the\nprovisions of this Sanhita, be exercisable by a Judicial Magistrate; or\n(b) which are administrative or executive in nature, such as, the granting of a licence, the suspension\nor cancellation of a licence, sanctioning a prosecution or withdrawing from a prosecution, they shall,\nsubject to the provisions of clause (a) be exercisable by an Executive Magistrate.", "text_hi": "3. (1) , ,\n, , , \n,\n, ,\n  \n() ,        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "4", "heading_en": "Trial of offences under Bharatiya Nyaya Sanhita, 2023 and other laws.—(1) All offences under", "text_en": "the  Bharatiya  Nyaya  Sanhita,  2023  shall  be  investigated,  inquired  into,  tried,  and  otherwise  dealt  with\naccording to the provisions hereinafter contained.\n(2) All offences under any other law shall be investigated, inquired into, tried, and otherwise dealt with\naccording to the same provisions, but subject to any enactment for the time being in force regulating the\nmanner or place of investigating, inquiring into, trying or otherwise dealing with such offences.", "text_hi": "4)              \n                 \n                \n        \n(5)       90         \n   \n   (1)              \n              \n             \n(2)         , , \n              \n               \n            \n  \n \n  \n  \n \n   (1)            , \n             \n,              \n  ,              \n             \n              \n               \n              \n              \n              \n            \n   : \n             \n     \n   \n  \n \n \n1988  59  (2)              \n                \n     , 1988         \n,             \n    ,      \n(3)  ,     (1)      \n        ,       ,  \n  ,               \n           ,\n258   [2 \n              \n           \n  \n   \n  \n \n                \n ,  \n, \n        (\n  : \n(i)   ; \n(ii)           ; \n(iii)     (3)        \n,             , \n               \n  (7)         ; \n(iv)          ,   \n ; \n(v)       ,     \n (6)            : \niii\n,\n,  \n              \n     \n     \n           \n      : \n     \n  \n  \n   \n  \n  \n  \n             ,  227 \n              \n     ,       \n       : \n(i)    ,        , \n 223   225       ; \n(ii)  180   183      ,  \n,    ;  \n(iii)        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "5", "heading_en": "Saving.—Nothing contained in this Sanhita shall, in the absence of a specific provision to the", "text_en": "contrary, affect any special or local law for the time being in force, or any special jurisdiction or power\nconferred, or any special form of procedure prescribed, by any other law for the time being in force.", "text_hi": "5.       ,     , \n       ,       \n           \n      \n  2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "6", "heading_en": "Classes of Criminal Courts.— Besides the High Courts and the Courts constituted under any law,", "text_en": "other than this Sanhita, there shall be, in every State, the following classes of Criminal Courts, namely:—\n(i) Courts of Session;\n(ii) Judicial Magistrates of the first class;\n(iii) Judicial Magistrates of the second class; and\n(iv) Executive Magistrates.", "text_hi": "6.            \n  ,         , \n :  \n(i)   ; \n(ii)     ; \n(iii)     ;  \n(iv)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "7", "heading_en": "Territorial divisions.—(1) Every State shall be a sessions division or shall consist of sessions", "text_en": "divisions; and every sessions divisions shall, for the purposes of this Sanhita, be a district or consist of\ndistricts.\n(2) The State Government may, after consultation with the High Court, alter the limits or the number\nof such divisions and districts.\n(3)  The  State  Government  may,  after  consultation  with  the  High  Court,  divide  any  district  into\nsub-divisions and may alter the limits or the number of such sub-divisions.\n(4) The sessions divisions, districts and sub-divisions existing in a State at the commencement of this\nSanhita, shall be deemed to have been formed under this section.", "text_hi": "7. (1)         \n             \n   \n(2)  ,      ,      \n        \n(3)  ,      ,\n160   [2 \n             \n   \n(4)   ,         ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "8", "heading_en": "Court of Session.—(1) The State Government shall establish a Court of Session for every sessions", "text_en": "division.\n(2) Every Court of Session shall be presided over by a Judge, to be appointed by the High Court.\n(3) The High Court may also appoint Additional Sessions Judges to exercise jurisdiction in a Court of\nSession.\n(4) The Sessions Judge of one sessions division may be appointed by the High Court to be also an\nAdditional Sessions Judge of another division, and in such case, he may sit for the disposal of cases at such\nplace or places in the other division as the High Court may direct.\n(5) Where the office of the Sessions Judge is vacant, the High Court may make arrangements for the\ndisposal of any urgent application which is, or may be, made or pending before such Court of Session by\nan Additional Sessions Judge or if there be no Additional Sessions Judge, by a Chief Judicial Magistrate,\nin the sessions division; and every such Judge or Magistrate shall have jurisdiction to deal with any such\napplication.\n(6) The Court of Session shall ordinarily hold its sitting at such place or places as the High Court may,\nby notification, specify; but, if, in any particular case, the Court of Session is of opinion that it will tend to\nthe general convenience of the parties and witnesses to hold its sittings at any other place in the sessions\ndivision, it may, with the consent of the prosecution and the accused, sit at that place for the disposal of the\ncase or the examination of any witness or witnesses therein.\n(7) The Sessions Judge may, from time to time,  make orders consistent with this  Sanhita, as to the\ndistribution of business among such Additional Sessions Judges.\n(8) The Sessions Judge may also make provision for the disposal of any urgent application, in the event\nof his absence or inability to act, by an Additional Sessions Judge or if there be no Additional Sessions\nJudge, by the Chief Judicial Magistrate, and such Judge or Magistrate shall be deemed to have jurisdiction\nto deal with any such application.\nExplanation.—For the purposes of this Sanhita, “appointment” does not include the first appointment,\nposting or promotion of a person by the Government to any Service, or post in connection with the affairs\nof the Union or of a State, where under any law, such appointment, posting or promotion is required to be\nmade by the Government.", "text_hi": "8. (1)  ,          \n  \n(2)        ,    \n     \n(3)  ,         \n           \n(4)              \n           ,    \n            ,   \n     \n(5)              \n-  ,           \n,            \n              \n               \n   \n(6)             \n      ;      , \n                 \n       ,       \n               \n         \n(7)   -       \n           \n(8)  ,         , \n -             \n   ,           \n   ;             \n        \n          \n                \n ,   ,       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "9", "heading_en": "Courts of Judicial Magistrates.—(1) In every district there shall be established as many Courts of", "text_en": "Judicial Magistrates of the first class and of the second class, and at such places, as the State Government\nmay, after consultation with the High Court, by notification, specify:\nProvided that the State Government may, after consultation with the High Court, establish, for any local\narea, one or more Special Courts of Judicial Magistrates of the first class or of the second class to try any\nparticular case or particular class of cases, and where any such Special Court is established, no other Court\nof Magistrate in the local area shall have jurisdiction to try any case or class of cases for the trial of which\nsuch Special Court of Judicial Magistrate has been established.\n(2) The presiding officers of such Courts shall be appointed by the High Court.\n(3) The High Court may, whenever it appears to it to be expedient or necessary, confer the powers of a\nJudicial Magistrate of the first class or of the second class on any member of the Judicial Service of the\nState, functioning as a Judge in a Civil Court.", "text_hi": "9 \n   ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "10", "heading_en": "Chief Judicial Magistrate and Additional Chief Judicial Magistrate, etc.—(1) In every district,", "text_en": "the High Court shall appoint a Judicial Magistrate of the first class to be the Chief Judicial Magistrate.\n(2) The High Court may appoint any Judicial Magistrate of the first class to be an Additional Chief\nJudicial  magistrate, and such Magistrate shall have all or any of the powers of a Chief Judicial Magistrate\nunder this Sanhita or under any other law for the time being in force as the High Court may direct.\n(3) The High Court may designate any Judicial Magistrate of the first class in any sub-division as the\nSub-divisional  Judicial  Magistrate  and  relieve  him  of  the  responsibilities  specified  in  this  section  as\noccasion requires.\n(4)  Subject  to  the  general  control  of  the  Chief  Judicial  Magistrate,  every  Sub-divisional  Judicial\nMagistrate shall also have and exercise, such powers of supervision and control over the work of the Judicial\nMagistrates (other than Additional Chief Judicial Magistrates) in the sub-division as the High Court may,\nby general or special order, specify in this behalf.", "text_hi": "10. (1)  ,          \n       \n(2)            \n              \n             \n,        \n(3)  ,        \n             \n          \n(4)            \n        (   \n  )             \n   ,           \n     \n  \n  \n \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "11", "heading_en": "Special Judicial Magistrates.—(1) The High Court may, if requested by the Central or State", "text_en": "Government so to do, confer upon any person who holds or has held any post under the Government, all or\nany of the powers conferred or conferrable by or under this Sanhita on a Judicial Magistrate  of the first\nclass or of the second class, in respect to particular cases or to particular classes of cases, in any local area:\nProvided that no such power shall be conferred on a person unless he possesses such qualification or\nexperience in relation to legal affairs as the High Court may, by rules, specify.\n(2) Such Magistrates shall be called Special Judicial Magistrates and shall be appointed for such term,\nnot exceeding one year at a time, as the High Court may, by general or special order, direct.", "text_hi": "11. (1)             \n              \n        ,    ,    \n             \n              \n    : \n             \n              ,\n162   [2 \n      \n(2)             \n           ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "12", "heading_en": "Local Jurisdiction of Judicial Magistrates.—(1) Subject to the control of the High Court, the", "text_en": "Chief    udicial  Magistrate  may,  from  time  to  time,  define  the local  limits  of  the  areas  within  which  the\nMagistrates appointed under section 9 or under section 11 may exercise all or any of the powers with which\nthey may respectively be invested under this Sanhita:\nProvided that the Court of Special Judicial Magistrate may hold its sitting at any place within the local\narea for which it is established.\n(2)  Except  as  otherwise  provided  by  such  definition,  the  jurisdiction  and  powers  of  every  such\nMagistrate shall extend throughout the district.\n(3) Where the local jurisdiction of a Magistrate appointed under section 9 or section 11 extends to an\narea beyond the district in which he ordinarily holds Court, any reference in this Sanhita to the Court of\nSession or Chief Judicial Magistrate shall, in relation to such Magistrate, throughout the area within his\nlocal jurisdiction, be construed, unless the context otherwise requires, as a reference to the Court of Session\nor Chief Judicial Magistrate, as the case may be, exercising jurisdiction in relation to the said district.", "text_hi": "12. (1)        ,   , \n-             \n9   11              \n  ,         : \n         ,  \n     ,          \n(2)   ,     ,    \n            \n(3)   9   11       \n      ,       \n  ,             \n          ,    \n     ,         \n              \n, ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "13", "heading_en": "Subordination of Judicial Magistrates.—(1) Every Chief Judicial Magistrate shall be subordinate", "text_en": "to  the  Sessions  Judge;  and  every  other  Judicial  Magistrate  shall,  subject  to  the  general  control  of  the\nSessions Judge, be subordinate to the Chief Judicial Magistrate.\n(2) The Chief Judicial Magistrate may, from time to time, make rules or give special orders, consistent\nwith this Sanhita, as to the distribution of business among the Judicial Magistrates subordinate to him.", "text_hi": "13. (1)    ,       \n   ,         \n,         \n(2)   , - ,     \n      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "14", "heading_en": "Executive Magistrates.—(1) In every district, the State Government may appoint as many persons", "text_en": "as itthinks fit to be Executive Magistrates and shall appoint one of them to be the District Magistrate.\n(2)  The  State  Government  may  appoint  any  Executive  Magistrate  to  be  an  Additional  District\nMagistrate, and such Magistrate shall have such of the powers of a District Magistrate under this Sanhita\nor under any other law for the time being in force as may be directed by the State Government.\n(3)  Whenever,  in  consequence  of  the  office  of  a  District  Magistrate  becoming  vacant,  any  officer\nsucceeds temporarily to the executive administration of the district, such officer shall, pending the orders\nof  the  State  Government,  exercise  all  the  powers  and  perform  all  the  duties  respectively  conferred  and\nimposed by this Sanhita on the District Magistrate.\n(4) The  State  Government may  place  an  Executive  Magistrate in charge  of  a  sub-division  and  may\nrelieve him of the charge as occasion requires; and the Magistrate so placed in charge of a sub-division\nshall be called the Sub-divisional Magistrate.\n(5) The State Government may, by general or special order and subject to such control and directions\nas it may deem fit to impose, delegate its powers under sub-section (4) to the District Magistrate.\n(6) Nothing in this section shall preclude the State Government from conferring, under any law for the\ntime being in force, on a Commissioner of Police all or any of the powers of an Executive Magistrate.", "text_hi": "14. (1)  ,      ,    \n,             \n    \n(2)  ,          \n,               \n       ,       \n(3)  ,         ,  \n               \n ,       ,      \n             \n      \n(4)  , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "15", "heading_en": "Special Executive Magistrates.—The State Government may appoint, for such term as it may", "text_en": "think fit, Executive Magistrates or any police officer not below the rank of Superintendent of Police or\nequivalent, to be known as Special Executive Magistrates, for particular areas or for the performance of\nparticular functions and confer on such Special Executive Magistrates such of the powers as are conferrable\nunder this Sanhita on Executive Magistrates, as it may deem fit.", "text_hi": "15.  ,            \n  , \n,         \n,        ,     \n               \n,    ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "16", "heading_en": "Local Jurisdiction of Executive.—(1) Subject to the control of the State Government, the District", "text_en": "Magistrate  may,  from  time  to  time,  define  the  local  limits  of  the  areas  within  which  the  Executive\nMagistrates may exercise all or any of the powers with which they may be invested under this Sanhita.\n(2)  Except  as  otherwise  provided  by  such  definition,  the  jurisdiction  and  powers  of  every  such\nMagistrate shall extend throughout the district.", "text_hi": "16. (1)          , - \n,            \n            ,    \n       \n(2)   ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "17", "heading_en": "Subordination of Executive Magistrates.—(1) All Executive Magistrates shall be subordinate to", "text_en": "the  District  Magistrate,  and  every  Executive  Magistrate  (other  than  the  Sub-divisional  Magistrate)\nexercising powers in a sub-division shall also be subordinate to the Sub-divisional Magistrate, subject, to\nthe general control of the District Magistrate.\n(2) The District Magistrate may, from time to time, make rules or give special orders, consistent with\nthis Sanhita, as to the distribution or allocation of business among the Executive Magistrates subordinate\nto him.", "text_hi": "17. (1)  ,      \n    (  \n ),         ,    \n     \n(2)  , - ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "18", "heading_en": "Public Prosecutors.—(1) For every High Court, the Central Government or the State Government", "text_en": "shall, after consultation with the High Court, appoint a Public Prosecutor and may also appoint one or more\nAdditional Public Prosecutors, for conducting in such Court, any prosecution, appeal or other proceeding\non behalf of the Central Government or the State Government, as the case may be:\nProvided that for National Capital Territory of Delhi, the Central Government shall, after consultation\nwith  the  High  Court  of  Delhi,  appoint  the  Public  Prosecutor  or  Additional  Public  Prosecutors  for  the\npurposes of this sub-section.\n(2) The Central Government may appoint one or more Public Prosecutors for the purpose of conducting\nany case in any district or local area.\n(3) For every district, the State Government shall appoint a Public Prosecutor and may also appoint one\nor more Additional Public Prosecutors for the district:\nProvided that the Public Prosecutor or Additional Public Prosecutor appointed for one district may be\nappointed also to be a Public Prosecutor or an Additional Public Prosecutor, as the case may be, for another\ndistrict.\n(4) The District Magistrate shall, in consultation with the Sessions Judge, prepare a panel of names of\npersons, who are, in his opinion fit to be appointed as Public Prosecutors or Additional Public Prosecutors\nfor the district.\n(5) No person shall be appointed by the State Government as the Public Prosecutor or Additional Public\nProsecutor for the district unless his name appears in the panel of names prepared by the District Magistrate\nunder sub-section (4).\n(6)  Notwithstanding  anything  in  sub-section  (5),  where  in  a  State  there  exists  a  regular  Cadre  of\nProsecuting  Officers,  the  State  Government  shall  appoint  a  Public  Prosecutor  or  an  Additional  Public\nProsecutor only from among the persons constituting such Cadre:\nProvided that where, in the opinion of the State Government, no suitable person is available in such\nCadre for such appointment, that Government may appoint a person as Public Prosecutor or Additional\nPublic Prosecutor, as the case may be, from the panel of names prepared by the District Magistrate under\nsub-section (4).\nExplanation.—For the purposes of this sub-section,—\n(a) “regular Cadre of Prosecuting Officers” means a Cadre of Prosecuting Officers which includes\ntherein the post of Public Prosecutor, by whatever name called, and which provides for promotion of\nAssistant Public Prosecutors, by whatever name called, to that post;\n(b)  “Prosecuting  Officer”  means  a  person,  by  whatever  name  called,  appointed  to  perform  the\nfunctions of a Public Prosecutor, Special Public Prosecutor, Additional Public Prosecutor or Assistant\nPublic Prosecutor under this Sanhita.\n(7) A person shall be eligible to be appointed as a Public Prosecutor or an Additional Public Prosecutor\nunder sub-section (1) or sub-section (2) or sub-section (3) or sub-section (6), only if he has been in practice\nas an advocate for not less than seven years.\n(8) The Central Government or the State Government may appoint, for the purposes of any case or class\nof cases, a person who has been in practice as an advocate for not less than ten years as a Special Public\nProsecutor:\nProvided  that  the  Court  may  permit  the  victim  to  engage  an  advocate  of  his  choice  to  assist  the\nprosecution under this sub-section.\n(9) For the purposes of sub-section (7) and sub-section (8), the period during which a person has been\nin practice as an advocate, or has rendered (whether before or after the commencement of this Sanhita)\nservice as a Public Prosecutor or as an Additional Public Prosecutor or Assistant Public Prosecutor or other\nProsecuting Officer, by whatever name called, shall be deemed to be the period during which such person\nhas been in practice as an advocate.", "text_hi": "18. (1)     ,        \n    , ,         \n   ,           \n            \n : \n, \n, \n  \n(2)  ,\n164   [2 \n(3)  ,    ,       \n             :  \n           \n,      , ,      \n      \n(4)  ,     ,      \n       ,         \n         \n(5)  ,           \n            \n(4)                 \n(6)  (5)       ,      \n       ,      \n            : \n ,             \n          (4)     \n        , ,      \n            \n     ,    \n()        \n    ,         \n    ,        \n         ,; \n(        , \n,           \n         ,     \n      \n(7)    (1)   (2)   (3)   (6)  \n              \n                  \n(8)              \n     ,        \n    ,       : \n       ,      \n             \n(9)  (7)   (8)    ,  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "19", "heading_en": "Assistant Public Prosecutors.—(1) The State Government shall appoint in every district one or", "text_en": "more Assistant Public Prosecutors for conducting prosecutions in the Courts of Magistrates.\n(2) The Central Government may appoint one or more Assistant Public Prosecutors for the purpose of\nconducting any case or class of cases in the Courts of Magistrates.\n(3) Without prejudice to provisions contained in sub-sections (1) and (2), where no Assistant Public\nProsecutor is available for the purposes of any particular case, the District Magistrate may appoint any other\nperson to be the Assistant Public Prosecutor in charge of that case after giving notice of fourteen days to\nthe State Government:\nProvided that no police officer shall be eligible to be appointed as an Assistant Public Prosecutor, if\nhe—\n(a) has taken any part in the investigation into the offence with respect to which the accused is\nbeing prosecuted; or\n(b) is below the rank of Inspector.", "text_hi": "19. (1)  ,          \n              \n(2)  ,        \n             \n   \n(3) \n,             \n ,   , \n,            \n    :  \n   , \n,   \n()           ,  \n      ;  \n()             \n \n  (1)  ,  \n     ,   \n , \n;  \n  -\n,  \n(2) , \n   -      \n          --   \n   , ;   \n   \n(3)       ,     \n          \n(4)   - ,  \n   ; , -\n166   [2 \n(5)         ,  18  (1) \n  (8)         ,   \n    ,       \n(6)  18   (3)   (8)      \n            , \n      ,   19   (1)  \n     ,  -, \n      \n(7)       \n, \n \n-\n, ,  \n \n, \n \n, \n, , -\n \n, -\n, -\n, , ,\n,  \n(12)    ,      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "20", "heading_en": "Directorate of Prosecution.—(1) The State Government may establish,—", "text_en": "(a) a Directorate of Prosecution in the State consisting of a Director of Prosecution and as many\nDeputy Directors of Prosecution as it thinks fit; and\n(b) a District Directorate of Prosecution in every district consisting of as many Deputy Directors\nand Assistant Directors of Prosecution, as it thinks fit.\n(2) A person shall be eligible to be appointed,—\n(a) as a Director of Prosecution or a Deputy Director of Prosecution, if he has been in practice as\nan advocate for not less than fifteen years or is or has been a Sessions Judge;\n(b) as an Assistant Director of Prosecution, if he has been in practice as an advocate for not less\nthan seven years or has been a Magistrate of the first class.\n(3) The Directorate of Prosecution shall be headed by the Director of Prosecution, who shall function\nunder the administrative control of the Home Department in the State.\n(4) Every Deputy Director of Prosecution or Assistant Director of Prosecution shall be subordinate to\nthe Director of Prosecution; and every Assistant Director of Prosecution shall be subordinate to the Deputy\nDirector of Prosecution.\n(5) Every Public Prosecutor, Additional Public Prosecutor and Special Public Prosecutor appointed by\nthe State Government under sub-section (1) or sub-section (8) of section 18 to conduct cases in the High\nCourt shall be subordinate to the Director of Prosecution.\n(6) Every Public Prosecutor, Additional Public Prosecutor and Special Public Prosecutor appointed by\nthe State Government under sub-section (3) or sub-section (8) of section 18 to conduct cases in District\nCourts  and  every  Assistant  Public  Prosecutor  appointed  under  sub-section  (1)  of  section  19  shall  be\nsubordinate to the Deputy Director of Prosecution or the Assistant Director of Prosecution.\n(7) The powers and functions of the Director of Prosecution shall be to monitor cases in which offences\nare punishable for ten years or more, or with life imprisonment, or with death; to expedite the proceedings\nand to give opinion on filing of appeals.\n(8) The powers and functions of the Deputy Director of Prosecution shall be to examine and scrutinise\npolice report and monitor the cases in which offences are punishable for seven years or more, but less than\nten years, for ensuring their expeditious disposal.\n(9) The functions of the Assistant Director of Prosecution shall be to monitor cases in which offences\nare punishable for less than seven years.\n(10) Notwithstanding anything contained in sub-sections (7), (8) and (9), the Director, Deputy Director\nor Assistant Director of Prosecution shall have the power to deal with and be responsible for all proceedings\nunder this Sanhita.\n(11) The other powers and functions of the Director of Prosecution, Deputy Directors of Prosecution\nand Assistant Directors of Prosecution and the areas for which each of the Deputy Directors of Prosecution\nor Assistant Directors of Prosecution have been appointed shall be such as the State Government may, by\nnotification, specify.\n(12)  The  provisions  of  this  section  shall  not  apply  to  the  Advocate  General  for  the  State  while\nperforming the functions of a Public Prosecutor.", "text_hi": "20        \n           \n          \n   \n()                \n            ,     \n               -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "21", "heading_en": "Courts by which offences are triable.—Subject to the other provisions of this Sanhita,—", "text_en": "(a) any offence under the Bharatiya Nyaya Sanhita, 2023 may be tried by—\n(i) the High Court; or\n(ii) the Court of Session; or\n(iii) any other Court by which such offence is shown in the First Schedule to be triable:\nProvided  that  any  offence  under  section  64,  section  65,  section  66,  section  67,  section  68,\nsection  69,  section  70  or  section  71  of  the  Bharatiya  Nyaya  Sanhita,  2023  shall  be  tried  as  far  as\npracticable by a Court presided over by a woman;\n(b) any offence under any other law shall, when any Court is mentioned in this behalf in such law, be\ntried by such Court and when no Court is so mentioned, may be tried by—\n(i) the High Court; or\n(ii) any other Court by which such offence is shown in the First Schedule to be triable.", "text_hi": "21.         ,   \n() ,       \n   \n(i)  ;  \n(ii)   ;  \n(iii)  ,     \n       :", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "22", "heading_en": "Sentences which High Courts and Sessions Judges may pass.—(1) A High Court may pass any", "text_en": "sentence authorised by law.\n(2) A Sessions Judge or Additional Sessions Judge may pass any sentence authorised by law; but any\nsentence of death passed by any such Judge shall be subject to confirmation by the High Court.", "text_hi": "22. (1)  ,          \n(2)      ,      \n   ;       ,  \n        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "23", "heading_en": "Sentences which Magistrates may pass.—(1) The Court of a Chief Judicial Magistrate may pass", "text_en": "any sentence authorised by law except a sentence of death or of imprisonment for life or of imprisonment\nfor a term exceeding seven years.\n(2) The Court of a Magistrate of the first class may pass a sentence of imprisonment for a term not\nexceeding three years, or of fine not exceeding fifty thousand rupees, or of both, or of community service.\n(3) The Court of Magistrate of the second class may pass a sentence of imprisonment for a term not\nexceeding one year, or of fine not exceeding ten thousand rupees, or of both, or of community service.\nExplanation.—“Community  service”  shall  mean  the  work  which  the  Court  may  order  a  convict  to\nperform as a form of punishment that benefits the community, for which he shall not be entitled to any\nremuneration.", "text_hi": "23. (1)     ,      \n               \n       \n(2)    ,        \n         ,   , \n,     \n(3)    ,        \n         ,   , \n,    \n, \n, \n,  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "24", "heading_en": "Sentence of imprisonment in default of fine.—(1) The Court of a Magistrate may award such", "text_en": "term of imprisonment in default of payment of fine as is authorised by law:\nProvided that the term—\n(a) is not in excess of the powers of the Magistrate under section 23;\n(b) shall not, where imprisonment has been awarded as part of the substantive sentence, exceed\none-fourth of the term of imprisonment which the Magistrate is competent to inflict as punishment for\nthe offence otherwise than as imprisonment in default of payment of the fine.\n(2)  The  imprisonment  awarded  under  this  section  may  be  in  addition  to  a  substantive  sentence  of\nimprisonment for the maximum term awardable by the Magistrate under section 23.", "text_hi": "24. (1)            \n     ,     : \n   \n()  23         ; \n()             \n,              \n,        \n       \n(2)      ,  23\n168   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "25", "heading_en": "Sentence in cases of conviction of several offences at one trial.—(1) When a person is convicted", "text_en": "at one trial of two or more offences, the Court may, subject to the provisions of section 9 of the Bharatiya\nNyaya Sanhita, 2023, sentence him for such offences, to the several punishments prescribed therefor which\nsuch  Court  is  competent  to  inflict  and  the  Court  shall,  considering  the  gravity  of  offences,  order  such\npunishments to run concurrently or consecutively.\n(2) In the case of consecutive sentences, it shall not be necessary for the Court by reason only of the\naggregate punishment for the several offences being in excess of the punishment which it is competent to\ninflict on conviction of a single offence, to send the offender for trial before a higher Court:\nProvided that—\n(a) in no case shall such person be sentenced to imprisonment for a longer period than twenty years;\n(b) the aggregate punishment shall not exceed twice the amount of punishment which the Court is\ncompetent to inflict for a single offence.\n(3) For the purpose of appeal by a convicted person, the aggregate of the consecutive sentences passed\nagainst him under this section shall be deemed to be a single sentence.", "text_hi": "25. (1)             \n     , ,      \n    ,            \n ,        ,    ; , \n, -\n \n(2)       ,         \n               \n      ,         \n          : \n   \n()    ,          \n       ; \n()  ,             \n         \n(3)         ,   \n  ,          ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "26", "heading_en": "Mode of conferring powers.—(1) In conferring powers under this Sanhita, the High Court or the", "text_en": "State Government, as the case may be, may, by order, empower persons specially by name or in virtue of\ntheir offices or classes of officials generally be their official titles.\n(2)  Every  such  order  shall  take  effect  from  the  date  on  which  it  is  communicated  to  the  person  so\nempowered.", "text_hi": "26. (1)        , ,  \n     ,         \n            ,  \n    \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "27", "heading_en": "Powers of officers appointed.—Whenever any person holding an office in the service of", "text_en": "Government who has been invested by the High Court or the State Government with any powers under this\nSanhita throughout any local area is appointed to an equal or higher office of the samenature, within a like\nlocal area under the same State Government, he shall, unless the High Court or the State Government, as\nthe case may be, otherwise directs, or has otherwise directed, exercise the same powers in the local area in\nwhich he is so appointed.", "text_hi": "27.          ,   \n    ,         \n      ,          \n               , \n ,  , ,           \n   ,    ,       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "28", "heading_en": "Withdrawal of powers.—(1) The High Court or the State Government, as the case may be, may", "text_en": "withdraw  all  or  any  of  the  powers  conferred  by  it  under  this  Sanhita  on  any  person  or  by  any  officer\nsubordinate to it.\n(2)  Any  powers  conferred  by  the  Chief  Judicial  Magistrate  or  by  the  District  Magistrate  may  be\nwithdrawn by the respective Magistrate by whom such powers were conferred.", "text_hi": "28. (1) ,     ,      \n               \n            \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "29", "heading_en": "Powers of Judges and Magistrates exercisable by their successors-in office.—(1) Subject to the", "text_en": "other  provisions  of  this  Sanhita,  the  powers  and  duties  of  a  Judge  or  Magistrate  may  be  exercised  or\nperformed by his successor-in-office.\n(2) When there is any doubt as to who is the successor-in-office, the Sessions Judge shall determine by\norder  in  writing  the  Judge  who  shall,  for  the  purposes  of  this  Sanhita  or  of  any  proceedings  or  order\nthereunder, be deemed to be the successor-in-office.\n(3) When there is any doubt as to who is the successor-in-office of any Magistrate, the Chief Judicial\nMagistrate, or the District Magistrate, as the case may be, shall determine by order in writing the Magistrate\nwho shall, for the purpose of this Sanhita or of any proceedings or order thereunder, be deemed to be the\nsuccessor-in-office of such Magistrate.", "text_hi": "29.(1)    , \n,        \n            \n(2)  (1)            \n      ,\n282   [2 \n        \n,       \n(3)   (1)         \n              \n        \n(4)   (3)          \n     ,        \n        ,       \n,           \n()             \n     ,        \n        \n           \n             \n      ; \n()             \n    ,          \n      ,         \n   ,      (1)     \n   ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "30", "heading_en": "Powers of superior officers of police.—Police officers superior in rank to an officer in charge of", "text_en": "a police station may exercise the same powers, throughout the local area to which they are appointed, as\nmay be exercised by such officer within the limits of his station.", "text_hi": "30.            \n  ,   ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "31", "heading_en": "Public when to assist Magistrates and police.—Every person is bound to assist a Magistrate or", "text_en": "police officer reasonably demanding his aid—\n(a) in the taking  or  preventing  the  escape  of any  other  person  whom  such  Magistrate  or  police\nofficer is authorised to arrest; or\n(b) in the prevention or suppression of a breach of the peace; or\n(c) in the prevention of any injury attempted to be committed to any public property.", "text_hi": "31.  ,           \n ,           ,   \n()     ,       \n     ,        ; \n \n()       ;  \n()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "32", "heading_en": "Aid to person, other than police officer, executing warrant.—When a warrant is directed to a", "text_en": "person other than a police officer, any other person may aid in the execution of such warrant, if the person\nto whom the warrant is directed be near at hand and acting in the execution of the warrant.", "text_hi": "32.   ,           \n              , \n   ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "33", "heading_en": "Public to give information of certain offences.—(1) Every person, aware of the commission of,", "text_en": "or  of  the  intention  of  any  other  person  to  commit,  any  offence  punishable  under  any  of  the  following\nsections of the Bharatiya Nyaya Sanhita, 2023, namely:—\n(i) sections 103 to 105 (both inclusive);\n(ii) sections 111 to 113 (both inclusive);\n(iii) sections 140 to 144 (both inclusive);\n(iv) sections 147 to 154 (both inclusive) and section 158;\n(v) sections 178 to 182 (both inclusive);\n(vi) sections 189 and 191;\n(vii) sections 274 to 280 (both inclusive);\n(viii) section 307;\n(ix) sections 309 to 312 (both inclusive);\n(x) sub-section (5) of section 316;\n(xi) sections 326 to 328 (both inclusive); and\n(xii) sections 331 and 332, upon the person so aware, forthwith give information to the nearest\nMagistrate or police officer of such commission or intention.\n(2) For the purposes of this section, the term “offence” includes any act committed at any place out of\nIndia which would constitute an offence if committed in India.", "text_hi": "33. (1)  ,  ,    \n             \n       , :   \n(i)  10   10 (  ; \n(ii)  1   11 (   ; \n(iii)  1   14 (  ;\n170   [2 \n(iv)  14  15 (    15 ; \n(v)  17 (  ;  \n(vi)  18 ; \n(vii)  27   2 (  ; \n(viii)  3 ; \n(ix)  30 (  ; \n(x)  31 (5) ; \n(xi)  32 (  ;  \n(xii)  3   33,  \n, \n, \n \n(2)      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "34", "heading_en": "Duty of officers employed in connection with affairs of a village to make certain", "text_en": "report.—(1) Every officer employed in connection with the affairs of a village and every person residing\nin a village shall forthwith communicate to the nearest Magistrate or to the officer in charge of the nearest\npolice station, whichever is nearer, any information which he may possess respecting—\n(a) the permanent or temporary residence of any notorious receiver or vendor of stolen property in\nor near such village;\n(b) the resort to any place within, or the passage through, such village of any person whom he\nknows, or reasonably suspects, to be a robber, escaped convict or proclaimed offender;\n(c) the commission of, or intention to commit, in or near such village any non-bailable offence or\nany offence punishable under section 189 and section 191 of the Bharatiya Nyaya Sanhita, 2023;\n(d) the occurrence in or near such village of any sudden or unnatural death or of any death under\nsuspicious circumstances or the discovery in or near such village of any corpse or part of a corpse, in\ncircumstances which lead to a reasonable suspicion that such a death has occurred or the disappearance\nfrom  such  village  of  any  person  in  circumstances  which  lead  to  a  reasonable  suspicion  that  a  non-\nbailable offence has been committed in respect of such person;\n(e) the commission of, or intention to commit, at any place out of India nearsuch village any act\nwhich, if committed in India, would be an offence punishable under any of the following sections of\nthe Bharatiya Nyaya Sanhita, 2023, namely, 103, 105, 111, 112, 113, 178 to 181 (both inclusive), 305,\n307, 309 to 312 (both inclusive), clauses (f) and (g) of section 326, 331or 332;\n(f) any matter likely to affect the maintenance of order or the prevention of crime or the safety of\nperson or property respecting which the District Magistrate, by general or special order made with the\nprevious sanction of the State Government, has directed him to communicate information.\n(2) In this section,—\n(i) “village” includes village lands;\n(ii) the expression “proclaimed offender” includes any person proclaimed as an offender by any\nCourt or authority in any territory in India to which this Sanhita does not extend, in respect of any act\nwhich if committed in the territories to which this Sanhita extends, would be an offence punishable\nunder any of the offence punishable with imprisonment for ten years or more or with imprisonment for\nlife or with death under the Bharatiya Nyaya Sanhita, 2023;\n(iii) the words “officer employed in connection with the affairs of the village” means a member of\nthe panchayat of the village and includes the headman and every officer or other person appointed to\nperform any function connected with the administration of the village.", "text_hi": "34. (1)              \n    ,         \n  ,    ,       \n    ,   ,   \n()            ,    \n      ,     ; \n()   ,   ,     \n              \n ,        -      ;  \n \n  ()           \n,    18   1      \n      ; \n()            , \n      ,        \n  ,        ,      \n      ,  ,       , \n               \n      ,    ; \n()    ,           \n            , \n  , , \n ( ),  30,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "35", "heading_en": "When police may arrest without warrant.—(1) Any police officer may without an order from a", "text_en": "Magistrate and without a warrant, arrest any person—\n(a) who commits, in the presence of a police officer, a cognizable offence; or\n(b) against whom a reasonable complaint has been made, or credible information has been received,\nor  a  reasonable  suspicion  exists  that  he  has  committed  a  cognizable  offence  punishable  with\nimprisonment  for  a  term  which  may  be  less  than  seven  years  or  which  may  extend  to  seven  years\nwhether with or without fine, if the following conditions are satisfied, namely:—\n(i) the police officer has reason to believe on the basis of such complaint, information, or\nsuspicion that such person has committed the said offence;\n(ii) the police officer is satisfied that such arrest is necessary—\n(a) to prevent such person from committing any further offence; or\n(b) for proper investigation of the offence; or\n(c)  to  prevent  such  person  from  causing  the  evidence  of  the  offence  to  disappear  or\ntampering with such evidence in any manner; or\n(d) to prevent such person from making any inducement, threat or promise to any person\nacquainted with the facts of the case so as to dissuade him from disclosing such facts to the\nCourt or to the police officer; or\n(e) as unless such person is arrested, his presence in the Court whenever required cannot\nbe ensured, and the police officer shall record while making such arrest, his reasons in writing:\nProvided that a police officer shall, in all cases where the arrest of a person is not required\nunder  the  provisions  of  this  sub-section,  record  the  reasons  in  writing  for  not  making  the\narrest; or\n(c)  against  whom  credible  information  has  been  received  that  he  has  committed  a  cognizable\noffence punishable with imprisonment for a term which may extend to more than seven years whether\nwith or without fine or with death sentence and the police officer has reason to believe on the basis of\nthat information that such person has committed the said offence; or\n(d)  who  has  been  proclaimed  as  an  offender  either  under  this  Sanhita  or  by  order  of  the  State\nGovernment; or\n(e) in whose possession anything is found which may reasonably be suspected to be stolen property\nand who may reasonably be suspected of having committed an offence with reference to such thing; or\n(f) who obstructs a police officer while in the execution of his duty, or who has escaped, or attempts\nto escape, from lawful custody; or\n(g) who is reasonably suspected of being a deserter from any of the Armed Forces of the Union; or\n(h) who has been concerned in, or against whom a reasonable complaint has been made, or credible\ninformation has been received, or a reasonable suspicion exists, of his having been concerned in, any\nact committed at any place out of India which, if committed in India, would have been punishable as\nan  offence,  and  for  which  he  is,  under  any  law  relating  to  extradition,  or  otherwise,  liable  to  be\napprehended or detained in custody in India; or\n(i)  who,  being  a  released  convict,  commits  a  breach  of  any  rule  made  under  sub-section  (5)  of\nsection 394; or\n(j) for whose arrest any requisition, whether written or oral, has been received from another police\nofficer, provided that the requisition specifies the person to be arrested and the offence or other cause\nfor which the arrest is to be made and it appears therefrom that the person might lawfully be arrested\nwithout a warrant by the officer who issued the requisition.\n(2) Subject to the provisions of section 39, no person concerned in a non-cognizable offence or against\nwhom a complaint has been made or credible information has been received or reasonable suspicion exists\nof his having so concerned, shall be arrested except under a warrant or order of a Magistrate.\n(3)  The  police  officer  shall,  in  all  cases  where  the  arrest  of  a  person  is  not  required  under\nsub-section (1) issue a notice directing the person against whom a reasonable complaint has been made, or\ncredible information has been received, or a reasonable suspicion exists that he has committed a cognizable\noffence, to appear before him or at such other place as may be specified in the notice.\n(4) Where such a notice is issued to any person, it shall be the duty of that person to comply with the\nterms of the notice.\n(5) Where such person complies and continues to comply with the notice, he shall not be arrested in\nrespect of the offence referred to in the notice unless, for reasons to be recorded, the police officer is of the\nopinion that he ought to be arrested.\n(6) Where  such  person,  at any  time,  fails to comply  with the terms  of  the  notice  or is  unwilling  to\nidentify himself, the police officer may, subject to such orders as may have been passed by a competent\nCourt in this behalf, arrest him for the offence mentioned in the notice.\n(7)  No  arrest  shall  be  made  without  prior  permission  of  an  officer  not  below  the  rank  of\nDeputy  Superintendent of Police in case of an offence which is punishable for imprisonment of less than\nthree years and such person is infirm or is above sixty years of age.", "text_hi": "35.          ,   \n               \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "36", "heading_en": "Procedure of arrest and duties of officer making arrest.—Every police officer while making an", "text_en": "arrest shall—\n(a)  bear  an  accurate,  visible  and  clear  identification  of  his  name  which  will  facilitate  easy\nidentification;\n(b) prepare a memorandum of arrest which shall be—\n(i) attested by at least one witness, who is a member of the family of the person arrested or a\nrespectable member of the locality where the arrest is made;\n(ii) countersigned by the person arrested; and\n(c) inform the person arrested, unless the memorandum is attested by a member of his family, that\nhe has a right to have a relative or a friend or any other person named by him to be informed of his\narrest.", "text_hi": "36.           \n              \n             ,    \n      ,         \n     \n()              \n           ; \n()              \n    ,            \n      \n  \n(i)             \n        ,  \n(ii)         \n ,  \n(iii)           \n    ,  \n(iv)           \n  ,             \n    ,\n312   [2 \n            , \n               , \n              \n       ,        \n              \n : \n \n   \n \n  \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "37", "heading_en": "Designated police officer.—The State Government shall—", "text_en": "(a) establish a police control room in every district and at State level;\n(b) designate a police officer in every district and in every police station, not below the rank of\nAssistant Sub-Inspector of Police who shall be responsible for maintaining the information about the\nnames and addresses of the persons arrested, nature of the offence with which charged, which shall be\nprominently displayed in any manner including in digital mode in every police station and at the district\nheadquarters.", "text_hi": "37.(1)        36   36   \n   , , ,        \n               \n              \n   \n(2)    3          \n          ,     \n     ,\n318   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "38", "heading_en": "Right of arrested person to meet an advocate of his choice during interrogation.—When any", "text_en": "person is arrested and interrogated by the police, he shall be entitled to meet an advocate of his choice\nduring interrogation, though not throughout interrogation.", "text_hi": "38.(1)  ,         \n   3   (1)   (2)      \n              , \n     ,      21  \n (4)            \n   , ,           \n      3    ,    \n                \n(2)     ,         3  \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "39", "heading_en": "Arrest on refusal to give name and residence.—(1) When any person who, in the presence of a", "text_en": "police  officer,  has  committed  or  has  been  accused  of  committing  a  non-cognizable  offence  refuses  on\ndemand of such officer to give his name and residence or gives a name or residence which such officer has\nreason to believe to be false, he may be arrested by such officer in order that his name or residence may be\nascertained.\n(2) When the true name and residence of such person have been ascertained, he shall be released on a\nbond or bail bond, to appear before a Magistrate if so required:\nProvided that if such person is not resident in India, the bail bond shall be secured by a surety or sureties\nresident in India.\n(3) If the true name and residence of such person is not ascertained within twenty-four hours from the\ntime of arrest or if he fails to execute the bond or bail bond, or, if so required, to furnish sufficient sureties,\nhe shall forthwith be forwarded to the nearest Magistrate having jurisdiction.", "text_hi": "39. (1)           \n              \n    ,           \n          ,       \n         ,       \n               \n(2)             ,  \n             \n            : \n             \n          \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "40", "heading_en": "Arrest by private person and procedure on such arrest.—(1) Any private person may arrest or", "text_en": "cause to be arrested any person who in his presence commits a non-bailable and cognizable offence, or any\nproclaimed offender, and, without unnecessary delay, but within six hours from such arrest, shall make over\nor cause to be made over any person so arrested to a police officer, or, in the absence of a police officer,\ntake such person or cause him to be taken in custody to the nearest police station.\n(2)  If  there  is  reason  to  believe  that  such  person  comes  under  the  provisions  of  sub-section  (1)  of\nsection 35, a police officer shall take him in custody.\n(3) If there is reason to believe that he has committed a non-cognizable offence, and he refuses on the\ndemand of a police officer to give his name and residence, or gives a name or residence which such officer\nhas reason to believe to be false, he shall be dealt with under the provisions of section 39; but if there is no\nsufficient reason to believe that he has committed any offence, he shall be at once released.", "text_hi": "40. (1)            \n     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "41", "heading_en": "Arrest by Magistrate.—(1) When any offence is committed in the presence of a Magistrate,", "text_en": "whether Executive or Judicial, within his local jurisdiction, he may himself arrest or order any person to\narrest the offender, and may thereupon, subject to the provisions herein contained as to bail, commit the\noffender to custody.\n(2) Any Magistrate, whether Executive or Judicial, may at any time arrest or direct the arrest, in his\npresence, within his local jurisdiction, of any person for whose arrest he is competent at the time and in the\ncircumstances to issue a warrant.", "text_hi": "41. (1)           \n           \n                 \n          ,     \n       \n(2)           \n          ,    \n       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "42", "heading_en": "Protection of members of Armed Forces from arrest.—(1) Notwithstanding anything contained", "text_en": "in section 35 and sections 39 to 41 (both inclusive), no member of the Armed Forces of the Union shall be\narrested for anything done or purported to be done by him in the discharge of his official duties except after\nobtaining the consent of the Central Government.\n(2) The State Government may, by notification, direct that the provisions of sub-section (1) shall apply\nto such class or category of the members of the Force charged with the maintenance of public order as may\nbe specified therein, wherever they may be serving, and thereupon the provisions of that sub-section shall\napply as if for the expression “Central Government” occurring therein, the expression “State Government”\nwere substituted.", "text_hi": "42. (1)  39   41     ( )  \n    ,             \n                 \n     ,           \n   \n(2)            \n        ,        \n  , -     ,  (1)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "43", "heading_en": "Arrest how made.—(1) In making an arrest the police officer or other person making the same", "text_en": "shall actually touch or confine the body of the person to be arrested, unless there be a submission to the\ncustody by word or action:\nProvided that where a woman is to be arrested, unless the circumstances indicate to the contrary, her\nsubmission  to  custody  on  an  oral  intimation  of  arrest  shall  be  presumed  and,  unless  the  circumstances\notherwise require or unless the police officer is a female, the police officer shall not touch the person of the\nwoman for making her arrest.\n(2) If such person forcibly resists the endeavour to arrest him, or attempts to evade the arrest, such\npolice officer or other person may use all means necessary to effect the arrest.\n(3) The police officer may, keeping in view the nature and gravity of the offence, use handcuff while\nmaking the arrest of a person or while producing such person before the court who is a habitual or repeat\noffender, or who escaped from custody, or who has committed offence of organised crime, terrorist act,\ndrug related crime, or illegal possession of arms and ammunition, murder, rape, acid attack, counterfeiting\nof coins and currency-notes, human trafficking, sexual offence against children, or offence against the State.\n(4) Nothing in this section gives a right to cause the death of a person who is not accused of an offence\npunishable with death or with imprisonment for life.\n(5) Save in exceptional circumstances, no woman shall be arrested after sunset and before sunrise, and\nwhere such exceptional circumstances exist, the woman police officer shall, by making a written report,\nobtain the prior permission of the Magistrate of the first class within whose local jurisdiction the offence is\ncommitted or the arrest is to be made.", "text_hi": "43. (1)        ,    \n ,             , \n                : \n             \n     ,         \n              \n          ,     \n             \n(2)\n176   [2 \n(3) , , \n,\n, , , \n, , , , , \n, ,  \n \n(4)     ,   ,       \n      ,           \n (5)    ,      \n            \n ,   ,    ,     \n     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "44", "heading_en": "Search of place entered by person sought to be arrested.—(1) If any person acting under a", "text_en": "warrant of arrest, or any police officer having authority to arrest, has reason to believe that the person to be\narrested has entered into, or is within, any place, any person residing in, or being in charge of, such place\nshall, on demand of such person acting as aforesaid or such police officer, allow him free ingress thereto,\nand afford all reasonable facilities for a search therein.\n(2) If ingress to such place cannot be obtained under sub-section (1), it shall be lawful in any case for\na  person acting  under  a  warrant and in  any  case in which  a  warrant  may  issue,  but cannot  be  obtained\nwithout affording the person to be arrested an opportunity of escape, for a police officer to enter such place\nand search therein, and in order to effect an entrance into such place, to break open any outer or inner door\nor window of any house or place, whether that of the person to be arrested or of any other person, if after\nnotification of his authority and purpose, and demand of admittance duly made, he cannot otherwise obtain\nadmittance:\nProvided that if any such place is an apartment in the actual occupancy of a female (not being the person\nto be arrested) who, according to custom, does not appear in public, such person or police officer shall,\nbefore entering such apartment, give notice to such female that she is at liberty to withdraw and shall afford\nher every reasonable facility for withdrawing, and may then break open the apartment and enter it.\n(3) Any police officer or other person authorised to make an arrest may break open any outer or inner\ndoor or window of any house or place in order to liberate himself or any other person who, having lawfully\nentered for the purpose of making an arrest, is detained therein.", "text_hi": "44. (1)            ,  \n        ,      \n        ,      ,   \n        ,        \n,               \n                 \n     \n(2)       (1)         \n     ,        ,     \n,               \n         ,      \n                 \n         ,         \n  ,      ,         \n                \n               : \n         (       \n)              \n                 \n                  \n               \n     \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "45", "heading_en": "Pursuit of offenders into other jurisdictions.—A police officer may, for the purpose of arresting", "text_en": "without warrant any person whom he is authorised to arrest, pursue such person into any place in India.", "text_hi": "45.             \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "46", "heading_en": "No unnecessary restraint.—The person arrested shall not be subjected to more restraint than is", "text_en": "necessary to prevent his escape.", "text_hi": "46.            \n            \n  \n \n 47. (1)            \n         ,     \n  ,              \n(2)            \n               \n                 \n       \n   \n  \n  \n  \n  \n  \n \n  (1)            \n  ,        ,     \n    , ,  ,       \n              \n      \n(2)       ,       \n  ,  (1)            \n(3)               , \n          ,      \n   ,    \n(4)   ,       ,  \n  ,           (2)  \n (3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "47", "heading_en": "Person arrested to be informed of grounds of arrest and of right to bail.—(1) Every police", "text_en": "officer  or  other  person  arresting  any  person  without  warrant  shall  forthwith  communicate  to  him  full\nparticulars of the offence for which he is arrested or other grounds for such arrest.\n(2) Where a police officer arrests without warrant any person other than a person accused of a non-\nbailable offence, he shall inform the person arrested that he is entitled to be released on bail and that he\nmay arrange for sureties on his behalf.", "text_hi": "47             \n              \n  \n  \n  \n  \n  \n  \n  \n   (1)  466   46          \n               \n     \n(2)              \n               \n           ,    \n            ,    \n          \n              \n   ,-        \n ,       ,   ,   \n  ,       \n  \n  \n  \n    (    ),         \n               \n  ,    ,     : \n     ,  400         \n 46      ,   46   (1)  \n   395          40  \n                   \n   \n  \n   \n   \n   \n  \n     \n  \n, \n, \n,\n354   [2 \n, , \n(i) \n ;  \nii  \n,  \n  \n, \n \n , \n,\n,, , \n \n,  \n \n, , \n,\n \n, ,\n \n   \n  \n  \n   \n  (1)            ,  \n ,  ,       ,    \n ,           \n  ,           \n(2)              \n  ,         ,  \n           , \n                \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "49", "heading_en": "Search of arrested person.—(1) Whenever,—", "text_en": "(i) a person is arrested by a police officer under a warrant which does not provide for the taking of\nbail, or under a warrant which provides for the taking of bail but the person arrested cannot furnish bail;\nand\n(ii) a person is arrested without warrant, or by a private person under a warrant, and cannot legally\nbe admitted to bail, or is unable to furnish bail, the officer making the arrest or, when the arrest is made\nby a private person, the police officer to whom he makes over the person arrested, may search such\nperson, and place in safe custody all articles, other than necessary wearing-apparel, found upon him\nand  where  any  article  is  seized  from  the  arrested  person,  a  receipt  showing  the  articles  taken  in\npossession by the police officer shall be given to such person.\n(2) Whenever it is necessary to cause a female to be searched, the search shall be made by another\nfemale with strict regard to decency.", "text_hi": "49. (1)  , \ni       ,      \n        ,       \n          ,   \n    ;   \n(ii             \n              \n        ,\n178   [2 \n    ,          \n   ,          ,  \n               \n                \n                \n             \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "50", "heading_en": "Power to seize offensive weapons.—The police officer or other person making any arrest under", "text_en": "this Sanhita may, immediately after the arrest is made, take from the person arrested any offensive weapons\nwhich he has about his person, and shall deliver all weapons so taken to the Court or officer before which\nor whom the officer or person making the arrest is required by this Sanhita to produce the person arrested.", "text_hi": "50.     ,         \n       ,     ,    \n            ,  \n             \n           \n  \n   \n-", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "51", "heading_en": "Examination of accused by medical practitioner at request of police officer.—(1) When a", "text_en": "person is arrested on a charge of committing an offence of such a nature and alleged to have been committed\nunder such circumstances that there are reasonable grounds for believing that an examination of his person\nwill  afford  evidence  as  to  the  commission  of  an  offence,  it  shall  be  lawful  for  a  registered  medical\npractitioner, acting at the request of any police officer, and for any person acting in good faith in his aid\nand under his direction, to make such an examination of the person arrested as is reasonably necessary in\norder to ascertain the facts which may afford such evidence, and to use such force as is reasonably necessary\nfor that purpose.\n(2) Whenever the person of a female is to be examined under this section, the examination shall be\nmade only by, or under the supervision of, a female registered medical practitioner.\n(3) The registered medical practitioner shall, without any delay, forward the examination report to the\ninvestigating officer.\nExplanation.—In this section and sections 52 and 53,—\n(a) “examination” shall include the examination of blood, blood stains, semen, swabs in case of sexual\noffences,  sputum  and  sweat,  hair  samples and finger nail  clippings by  the  use  of  modern and  scientific\ntechniques including DNA profiling and such other tests which the registered medical practitioner thinks\nnecessary in a particular case;\n(b)  “registered  medical  practitioner”  means  a  medical  practitioner  who  possesses  any  medical\nqualification recognised under the National Medical Commission Act, 2019 (30 of 2019) and whose name\nhas been entered in the National Medical Register or a State Medical Register under that Act.", "text_hi": "51. (1)             \n                \n               \n     ,     ,      \n    ,       -     \n             \n                \n  ,      ,        \n               \n   \n(2)              \n         -    \n      \n-\n  \n     52   53    \n(  ,   , ,      \n,   ,           \n    ,       \n,       ,   -\n       ,   ;  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n (  -   -   , \n , 2019", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "52", "heading_en": "Examination of person accused of rape by medical practitioner.—(1) When a person is arrested", "text_en": "on a charge of committing an offence of rape or an attempt to commit rape and there are reasonable grounds\nfor believing that an examination of his person will afford evidence as to the commission of such offence,\nit shall be lawful for a registered medical practitioner employed in a hospital run by the Government or by\na local authority and in the absence of such a practitioner within the radius of sixteen kilometres from the\nplace where the offence has been committed, by any other registered medical practitioner, acting at the\nrequest of any police officer, and for any person acting in good faith in his aid and under his direction, to\nmake such an examination of the arrested person and to use such force as is reasonably necessary for that\npurpose.\n(2) The registered medical practitioner conducting such examination shall, without any delay, examine\nsuch person and prepare a report of his examination giving the following particulars, namely:—\n(i) the name and address of the accused and of the person by whom he was brought;\n(ii) the age of the accused;\n(iii) marks of injury, if any, on the person of the accused;\n(iv) the description of material taken from the person of the accused for DNA profiling; and\n(v) other material particulars in reasonable detail.\n(3) The report shall state precisely the reasons for each conclusion arrived at.\n(4) The exact time of commencement and completion of the examination shall also be noted in the\nreport.\n(5) The registered medical practitioner shall, without any delay, forward the report to the investigating\nofficer, who shall forward it to the Magistrate referred to in section 193 as part of the documents referred\nto in clause (a) of sub-section (6) of that section.", "text_hi": "52(1)             \n                \n                 \n             \n -            , \n       -      \n    ,          ,  \n  -   ,       \n          ,    \n               \n    ,    \n(2)      -      \n           ,  \n   ,  : \n(i)     ,    ,    ; \n(ii)    ; \n(iii)       ,    ; \n(iv)             \n  ;  \n(v)   ,     \n(3)         ,    \n    \n(4)             \n   \n(5)  - ,       \n ,    193         (6)  \n ()           \n  \n -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "53", "heading_en": "Examination of arrested person by medical officer.—(1) When any person is arrested, he shall", "text_en": "be examined by a medical officer in the service of the Central Government or a State Government, and in\ncase the medical officer is not available, by a registered medical practitioner soon after the arrest is made:\nProvided that if the medical officer or the registered medical practitioner is of the opinion that one more\nexamination of such person is necessary, he may do so:\nProvided further that where the arrested person is a female, the examination of the body shall be made\nonly by or under the supervision of a female medical officer, and in case the female medical officer is not\navailable, by a female registered medical practitioner.\n(2)  The  medical  officer  or  a  registered  medical  practitioner  so  examining  the  arrested  person  shall\nprepare the  record  of such  examination,  mentioning  therein  any  injuries  or  marks  of  violence  upon  the\nperson arrested, and the approximate time when such injuries or marks may have been inflicted.\n(3) Where an examination is made under sub-section (1), a copy of the report of such examination shall\nbe furnished by the medical officer or registered medical practitioner, as the case may be, to the arrested\nperson or the person nominated by such arrested person not available, by a registered medical practitioner\nsoon after the arrest is made:", "text_hi": "53. (1)       ,      \n          \n        ,    \n     : \n-\n, : \n       ,\n180   [2 \n(2)            \n           \n               \n               \n(3)   (1)             \n , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "54", "heading_en": "Identification of person arrested.—Where a person is arrested on a charge of committing an", "text_en": "offence and his identification by any other person or persons is considered necessary for the purpose of\ninvestigation of such offence, the Court, having jurisdiction may, on the request of the officer in charge of\na police station, direct the person so arrested to subject himself to identification by any person or persons\nin such manner as the Court may deem fit:\nProvided  that  if  the  person  identifying  the  person  arrested  is  mentally  or  physically  disabled,  such\nprocess of identification shall take place under the supervision of a Magistrate who shall take appropriate\nsteps to ensure that such person identifies the person arrested using methods that person is comfortable with\nand the identification process shall be recorded by any audio-video electronic means.", "text_hi": "54             \n              \n         ,   ,  \n      ,     ,   \n     ,         \n       \n,\n, -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "55", "heading_en": "Procedure when police officer deputes subordinate to arrest without warrant.—(1) When any", "text_en": "officer  in  charge  of  a  police  station  or  any  police  officer  making  an  investigation  under  Chapter  XIII\nrequires any officer subordinate to him to arrest without a warrant (otherwise than in his presence) any\nperson who may lawfully be arrested without a warrant, he shall deliver to the officer required to make the\narrest an order in writing, specifying the person to be arrested and the offence or other cause for which the\narrest is to be made and the officer so required shall, before making the arrest, notify to the person to be\narrested the substance of the order and, if so required by such person, shall show him the order.\n(2)  Nothing  in  sub-section  (1)  shall  affect  the  power  of  a  police  officer  to  arrest  a  person  under\nsection 35.", "text_hi": "55. (1)   13          \n ,    ,       \n            ,   \n (  , )      ,    \n              , \n     ,         \n              \n   ,    ,       \n                  \n(2)  (1)         35    \n            \n   \n  \n  \n 56", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "57", "heading_en": "Person arrested to be taken before Magistrate or officer in charge of police station.—A police", "text_en": "officer making an arrest without warrant shall, without unnecessary delay and subject to the provisions\nherein contained as to bail, take or send the person arrested before a Magistrate having jurisdiction in the\ncase, or before the officer in charge of a police station.", "text_hi": "57.            \n            ,   \n,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "58", "heading_en": "Person arrested not to be detained more than twenty-four hours.—Officers in charge of police", "text_en": "stations shall report to the District Magistrate, or, if he so directs, to the Sub-divisional Magistrate, the cases\nof all persons arrested without warrant, within the limits of their respective stations, whether such persons\nhave been admitted to bail or otherwise.", "text_hi": "58         \n                \n               \n           ,  \n              \n                \n(2)  ,           \n,        \n    , \n,  \n   ,         ,   \n      , \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "59", "heading_en": "Police to report apprehensions.— Officers in charge of police stations shall report to the District", "text_en": "Magistrate, or, if he so directs, to the Sub-divisional Magistrate, the cases of all persons arrested without\nwarrant, within the limits of their respective stations, whether such persons have been admitted to bail or\notherwise.", "text_hi": "59.        ,   \n   ,   , -       \n           ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "60", "heading_en": "Discharge of person apprehended.—No person who has been arrested by a police officer shall be", "text_en": "discharged except on his bond, or bail bond, or under the special order of a Magistrate.", "text_hi": "60.             \n            ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "61", "heading_en": "Power, on escape, to pursue and retake.—(1) If a person in lawful custody escapes or is rescued,", "text_en": "the person from whose custody he escaped or was rescued may immediately pursue and arrest him in any\nplace in India.\n(2) The provisions of section 44 shall apply to arrests under sub-section (1) although the person making\nany such arrest is not acting under a warrant and is not a police officer having authority to arrest.", "text_hi": "61. (1)              \n    ,       ,   ,  \n                 \n(2)  (1)      44       \n               \n             \n   \n   \n  \n 62            \n              \n  \n   \n  \n  6", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "63", "heading_en": "Form of summons.—Every summons issued by a Court under this Sanhita shall be,—", "text_en": "(i) in writing, in duplicate, signed by the presiding officer of such Court or by such other officer as\nthe High Court may, from time to time, by rule direct, and shall bear the seal of the Court; or\n(ii) in an encrypted or any other form of electronic communication and shall bear the image of the\nseal of the Court or digital signature.", "text_hi": "63.           , \ni       ,      \n     ,      -\n   ,           \n ;  \nii", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "64", "heading_en": "Summons how served.—(1) Every summons shall be served by a police officer, or subject to such", "text_en": "rules as the State Government may make in this behalf, by an officer of the Court issuing it or other public\nservant:\nProvided that the police station or the registrar in the Court shall maintain a register to enter the address,\nemail address, phone number and such other details as the State Government may, by rules, provide.\n(2) The summons shall, if practicable, be served personally on the person summoned, by delivering or\ntendering to him one of the duplicates of the summons:\nProvided  that  summons  bearing  the  image  of  Court's  seal  may  also  be  served  by  electronic\ncommunication in such form and in such manner, as the State Government may, by rules, provide.\n(3) Every person on whom a summons is so served personally shall, if so required by the serving officer,\nsign a receipt therefor on the back of the other duplicate.", "text_hi": "64. (1)             \n     ,   ,      , \n          : \n, - ,\n182   [2 \n(2)                \n                :  \n,  \n(3)  ,        ,   \n         ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "65", "heading_en": "Service of summons on corporate bodies, firms, and societies.—(1) Service of a summons on a", "text_en": "company or corporation may be effected by serving it on the Director, Manager, Secretary or other officer\nof the company  or  corporation,  or  by  letter  sent  by  registered post  addressed  to  the  Director,  Manager,\nSecretary or other officer of the company or corporation in India, in which case the service shall be deemed\nto have been effected when the letter would arrive in ordinary course of post.\nExplanation.—In  this  section,  “company”  means  a  body  corporate  and  “corporation”  means  an\nincorporated company or other body corporate registered under the Companies Act, 2013 (18 of 2013) or\na society registered under the Societies Registration Act, 1860 (21 of 1860).\n(2) Service of a summons on a firm or other association of individuals may be effected by serving it on\nany partner of such firm or association, or by letter sent by registered post addressed to such partner, in\nwhich case the service shall be deemed to have been effected when the letter would arrive in ordinary course\nof post.", "text_hi": "65. (1)        \n, ,              \n   , ,        \n          ,       \n              \n         \n  , 1860   \n    \n,      \n ,           \n \n1860  21", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "66", "heading_en": "Service when persons summoned cannot be found.—Where the person summoned cannot, by", "text_en": "the exercise of due diligence, be found, the summons may be served by leaving one of the duplicates for\nhim with some adult member of his family residing with him, and the person with whom the summons is\nso left shall, if so required by the serving officer, sign a receipt therefor on the back of the other duplicate.\nExplanation.—A servant is not a member of the family within the meaning of this section.", "text_hi": "66.             , \n                 \n                \n          ,     \n    ,            \n  \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "67", "heading_en": "Procedure when service cannot be effected as before provided.—If service cannot by the", "text_en": "exercise of due diligence be effected as provided in section 64, section 65 or section 66, the serving officer\nshall affix one of the duplicates of the summons to some conspicuous part of the house or homestead in\nwhich the person summoned ordinarily resides; and thereupon the Court, after making such inquiries as it\nthinks fit, may either declare that the summons has been duly served or order fresh service in such manner\nas it considers proper.", "text_hi": "67.  64,  65   66       \n                \n         ,      \n   ,      ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "68", "heading_en": "Service on Government servant.—(1) Where the person summoned is in the active service of the", "text_en": "Government, the Court issuing the summons shall ordinarily send it in duplicate to the head of the office in\nwhich such  person  is  employed;  and  such  head shall thereupon  cause  the  summons to  be  served  in the\nmanner provided by section 64, and shall return it to the Court under his signature with the endorsement\nrequired by that section.\n(2) Such signature shall be evidence of due service.", "text_hi": "68. (1)              \n              \n          ,  64", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "69", "heading_en": "Service of summons outside local limits.—When a Court desires that a summons issued by it shall", "text_en": "be served at any place outside its local jurisdiction, it shall ordinarily send such summons in duplicate to a\nMagistrate within whose local jurisdiction the person summoned resides, or is, to be there served.", "text_hi": "69.", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "70", "heading_en": "Proof of service in such cases and when serving officer not present.—(1) When a summons", "text_en": "issued by a Court is served outside its local jurisdiction, and in any case where the officer who has served\na summons is not present at the hearing of the case, an affidavit, purporting to be made before a Magistrate,\nthat such summons has been served, and a duplicate of the summons purporting to be endorsed (in the\nmanner provided by section 64 or section 66) by the person to whom it was delivered or tendered or with\nwhom it was left, shall be admissible in evidence, and the statements made therein shall be deemed to be\ncorrect unless and until the contrary is proved.\n(2) The affidavit mentioned in this section may be attached to the duplicate of the summons and returned\nto the Court.\n(3) All summons served through electronic communication under sections 64 to 71 (both inclusive)\nshall be considered as duly served and a copy of such summons shall be attested and kept as a proof of\nservice of summons.", "text_hi": "70 (1)            \n                \n    ,        ,    \n                \n ,            , \n       ( 64   66    ), \n   ,           \n ,          \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "71", "heading_en": "Service of summons on witness.—(1) Notwithstanding anything contained in the preceding", "text_en": "sections of this Chapter, a Court issuing a summons to a witness may, in addition to and simultaneously\nwith the issue of such summons, direct a copy of the summons to be served by electronic communication\nor by registered post addressed to the witness at the place where he ordinarily resides or carries on business\nor personally works for gain.\n(2) When an acknowledgement purporting to be signed by the witness or an endorsement purporting to\nbe made by a postal employee that the witness refused to take delivery of the summons has been received\nor on the proof of delivery of summons under sub-section (3) of section 70 by electronic communication to\nthe satisfaction of the Court, the Court issuing summons may deem that the summons has been duly served.\nB.—Warrant of arrest", "text_hi": "71. (1)               \n     ,         \n-                \n   ,           \n        \n     \n(2)            \n               , \n   \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "72", "heading_en": "Form of warrant of arrest and duration.—(1) Every warrant of arrest issued by a Court under", "text_en": "this Sanhita shall be in writing, signed by the presiding officer of such Court and shall bear the seal of the\nCourt.\n(2) Every such warrant shall remain in force until it is cancelled by the Court which issued it, or until\nit is executed.", "text_hi": "72. (1)            \n             \n            \n(2)\n184   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "73", "heading_en": "Power to direct security to be taken.—(1) Any Court issuing a warrant for the arrest of any person", "text_en": "may in its discretion direct by endorsement on the warrant that, if such person executes a bail bond with\nsufficient  sureties  for  his  attendance  before  the  Court  at  a  specified  time  and  thereafter  until  otherwise\ndirected by the Court, the officer to whom the warrant is directed shall take such security and shall release\nsuch person from custody.\n(2) The endorsement shall state—\n(a) the number of sureties;\n(b)  the  amount  in  which  they  and  the  person  for  whose  arrest  the  warrant  is  issued,  are  to  be\nrespectively bound;\n(c) the time at which he is to attend before the Court.\n(3) Whenever security is taken under this section, the officer to whom the warrant is directed shall\nforward the bond to the Court.", "text_hi": "73. (1)            \n             \n            \n              \n             \n ,              \n(2)       : \n()    ; \n()  ,       ,  \n       ,    ; \n()             \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "74", "heading_en": "Warrants to whom directed.—(1) A warrant of arrest shall ordinarily be directed to one or more", "text_en": "police officers; but the Court issuing such a warrant may, if its immediate execution is necessary and no\npolice officer is immediately available, direct it to any other person or persons, and such person or persons\nshall execute the same.\n(2) When a warrant is directed to more officers or persons than one, it may be executed by all, or by\nany one or more of them.", "text_hi": "74. (1)          \n  ;             \n               \n              \n    \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "75", "heading_en": "Warrant may be directed to any person.—(1) The Chief Judicial Magistrate or a Magistrate of", "text_en": "the first class may direct a warrant to any person within his local jurisdiction for the arrest of any escaped\nconvict, proclaimed offender or of any person who is accused of a non-bailable offence and is evading\narrest.\n(2) Such person shall acknowledge in writing the receipt of the warrant, and shall execute it if the person\nfor whose arrest it was issued, is in, or enters on, any land or other property under his charge.\n(3) When the person against whom such warrant is issued is arrested, he shall be made over with the\nwarrant to the nearest police officer, who shall cause him to be taken before a Magistrate having jurisdiction\nin the case, unless security is taken under section 73.", "text_hi": "75. (1)           \n,            \n         ,       \n            \n(2)              \n ,          ,    \n                 \n    \n(3)   ,        ,   \n  ,            \n, ,   73        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "77", "heading_en": "Notification of substance of warrant.—The police officer or other person executing a warrant of", "text_en": "arrest shall notify the substance thereof to the person to be arrested, and, if so required, shall show him\nthe warrant.", "text_hi": "77.     ,         \n,   ,    ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "78", "heading_en": "Person arrested to be brought before Court without delay.—The police officer or other person", "text_en": "executing  a  warrant  of  arrest  shall  (subject  to  the  provisions  of  section  73  as  to  security)  without\nunnecessary delay bring the person arrested before the Court before which he is required by law to produce\nsuch person:\nProvided  that  such  delay  shall  not,  in  any  case,  exceed  twenty-four  hours  exclusive  of  the  time\nnecessary for the journey from the place of arrest to the Magistrate's Court.", "text_hi": "78.     ,        \n,      ( 73        \n)         ,    \n           :", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "79", "heading_en": "Where warrant may be executed.—A warrant of arrest may be executed at any place in India.", "text_en": "", "text_hi": "79.                 \n  \n  \n 80. (1)            \n        ,    \n             \n             \n            \n,              \n              \n    \n(2)  (1)           \n          ,   ,  \n 83       ,       \n             ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "81", "heading_en": "Warrant directed to police officer for execution outside jurisdiction.—(1) When a warrant", "text_en": "directed to a police officer is to be executed beyond the local jurisdiction of the Court issuing the same, he\nshall ordinarily take it for endorsement either to an Executive Magistrate or to a police officer not below\nthe rank of an officer in charge of a police station, within the local limits of whose jurisdiction the warrant\nis to be executed.\n(2) Such Magistrate or police officer shall endorse his name thereon and such endorsement shall be\nsufficient authority to the police officer to whom the warrant is directed to execute the same, and the local\npolice shall, if so required, assist such officer in executing such warrant.\n(3) Whenever there is reason to believe that the delay occasioned by obtaining the endorsement of the\nMagistrate or police officer within whose local jurisdiction the warrant is to be executed will prevent such\nexecution, the police officer to whom it is directed may execute the same without such endorsement in any\nplace beyond the local jurisdiction of the Court which issued it.", "text_hi": "81. (1)             \n              \n       ,     \n         ,   \n           ,     \n(2)              \n     ,       ,  \n              \n                \n(3)\n186   [2 \n,        ,  \n           ,    , \n     ,         \n ,               \n   \n  \n   \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "82", "heading_en": "Procedure on arrest of person against whom warrant issued.—(1) When a warrant of arrest is", "text_en": "executed outside the district in which it was issued, the person arrested shall, unless the Court which issued\nthe warrant is within thirty kilometres of the place of arrest or is nearer than the Executive Magistrate or\nDistrict Superintendent of Police or Commissioner of Police within the local limits of whose jurisdiction\nthe arrest was made, or unless security is taken under section 73, be taken before such Magistrate or District\nSuperintendent or Commissioner.\n(2) On the arrest of any person referred to in sub-section (1), the police officer shall forthwith give the\ninformation regarding such arrest and the place where the arrested person is being held to the designated\npolice officer in the district and to such officer of another district where the arrested person normally resides.", "text_hi": "82. (1)              \n     ,      ,     \n             \n              \n ,           , \n  ,   73       ,     \n         \n, \n, \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "83", "heading_en": "Procedure by Magistrate before whom such person arrested is brought.—(1) The Executive", "text_en": "Magistrate  or  District  Superintendent  of  Police  or  Commissioner  of  Police  shall,  if  the  person  arrested\nappears to be the person intended by the Court which issued the warrant, direct his removal in custody to\nsuch Court:\nProvided that, if the offence is bailable, and such person is ready and willing to give bail bond to the\nsatisfaction of such Magistrate, District Superintendent or Commissioner, or a direction has been endorsed\nunder section 73 on the warrant and such person is ready and willing to give the security required by such\ndirection, the Magistrate, District Superintendent or Commissioner shall take such bail bond or security, as\nthe case may be, and forward the bond, to the Court which issued the warrant:\nProvided  further  that  if  the  offence  is  a  non-bailable  one,  it  shall  be  lawful  for  the  Chief  Judicial\nMagistrate (subject to the provisions of section 480), or the Sessions Judge, of the district in which the\narrest is made on consideration of the information and the documents referred to in sub-section (2) of section\n80, to release such person on bail.\n(2)  Nothing  in  this  section  shall  be  deemed  to  prevent  a  police  officer  from  taking  security  under\nsection 73.\nC.—Proclamation and attachment", "text_hi": "83. (1)              \n             \n               : \n             \n      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "84", "heading_en": "Proclamation for person absconding.—(1) If any Court has reason to believe (whether after", "text_en": "taking evidence or not) that any person against whom a warrant has been issued by it has absconded or is\nconcealing himself so that such warrant cannot be executed, such Court may publish a written proclamation\nrequiring him to appear at a specified place and at a specified time not less than thirty days from the date\nof publishing such proclamation.\n(2) The proclamation shall be published as follows:—\n(i) (a) it shall be publicly read in some conspicuous place of the town or village in which such\nperson ordinarily resides;\n(b) it shall be affixed to some conspicuous part of the house or homestead in which such person\nordinarily resides or to some conspicuous place of such town or village;\n(c) a copy thereof shall be affixed to some conspicuous part of the Court-house;\n(ii) the Court may also, if it thinks fit, direct a copy of the proclamation to be published in a daily\nnewspaper circulating in the place in which such person ordinarily resides.\n(3) A statement in writing by the Court issuing the proclamation to the effect that the proclamation was\nduly published on a specified day, in the manner specified in clause (i) of sub-section (2), shall be conclusive\nevidence that  the  requirements  of  this  section have  been  complied  with,  and  that  the  proclamation  was\npublished on such day.\n(4) Where a proclamation published under sub-section (1) is in respect of a person accused of an offence\nwhich is made punishable with imprisonment of ten years or more, or imprisonment for life or with death\nunder the Bharatiya Nyaya Sanhita, 2023 or under any other law for the time being in force, and such person\nfails to appear at the specified place and time required by the proclamation, the Court may, after making\nsuch inquiry as it thinks fit, pronounce him a proclaimed offender and make a declaration to that effect.\n(5) The provisions of sub-sections (2) and (3) shall apply to a declaration made by the Court under\nsub-section (4) as they apply to the proclamation published under sub-section (1).", "text_hi": "84. (1)     (       )  \n              , \n   ,              \n             \n           ,   \n             ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "85", "heading_en": "Attachment of property of person absconding.—(1) The Court issuing a proclamation under", "text_en": "section 84 may, for reasons to be recorded in writing, at any time after the issue of the proclamation, order\nthe attachment of any property, movable or immovable, or both, belonging to the proclaimed person:\nProvided that where at the time of the issue of the proclamation the Court is satisfied, by affidavit or\notherwise, that the person in relation to whom the proclamation is to be issued,—\n(a) is about to dispose of the whole or any part of his property; or\n(b) is about to remove the whole or any part of his property from the local jurisdiction of the Court,\nit may order the attachment of property simultaneously with the issue of the proclamation.\n(2)  Such  order  shall  authorise  the  attachment  of  any  property  belonging  to  such  person  within  the\ndistrict in which it is made; and it shall authorise the attachment of any property belonging to such person\nwithout such district when endorsed by the District Magistrate within whose district such property is situate.\n(3) If the property ordered to be attached is a debt or other movable property, the attachment under this\nsection shall be made—\n(a) by seizure; or\n(b) by the appointment of a receiver; or\n(c) by an order in writing prohibiting the delivery of such property to the proclaimed person or to\nany one on his behalf; or\n(d) by all or any two of such methods, as the Court thinks fit.\n(4) If the property ordered to be attached is immovable, the attachment under this section shall, in the\ncase of land paying revenue to the State Government, be made through the Collector of the district in which\nthe land is situate, and in all other cases—\n(a) by taking possession; or\n(b) by the appointment of a receiver; or\n(c) by an order in writing prohibiting the payment of rent on delivery of property to the proclaimed\nperson or to any one on his behalf; or\n(d) by all or any two of such methods, as the Court thinks fit.\n(5) If the property ordered to be attached consists of live-stock or is of a perishable nature, the Court\nmay, if it thinks it expedient, order immediate sale thereof, and in such case the proceeds of the sale shall\nabide the order of the Court.\n(6) The powers, duties and liabilities of a receiver appointed under this section shall be the same as\nthose of a receiver appointed under the Code of Civil Procedure, 1908 (5 of 1908).", "text_hi": "85. (1)  84       ,   , \n   ,         , \n     ,    ,       \n    : \n             \n               \n()            ;  \n()            \n     ,  \n                \n(2)     ,     ,\n188   [2 \n          ,     \n  ,       \n(3)           ,     \n ,       \n()     ;  \n()       ;  \n()             \n           ;  \n()           ,    \n  \n(4)           ,     \n                 \n          ,     \n, \n()     ;  \n()       ;  \n()             \n              \n  ;  \n()           ,    \n  \n(5)           ,    \n    ,           \n                 \n   \n (6)        ,      \n,    , 1908          \n1908  5", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "86", "heading_en": "Identification and attachment of property of proclaimed person.—The Court may, on the", "text_en": "written request from a police officer not below the rank of the Superintendent of Police or Commissioner\nof Police, initiate the process of requesting assistance from a Court or an authority in the contracting State\nfor identification, attachment and forfeiture of property belonging to a proclaimed person in accordance\nwith the procedure provided in Chapter VIII.", "text_hi": "86. , \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "87", "heading_en": "Claims and objections to attachment.—(1) If any claim is preferred to, or objection made to the", "text_en": "attachment of, any property attached under section 85, within six months from the date of such attachment,\nby any person other than the proclaimed person, on the ground that the claimant or objector has an interest\nin such property, and that such interest is not liable to attachment under section 85, the claim or objection\nshall be inquired into, and may be allowed or disallowed in whole or in part:\nProvided that any claim preferred or objection made within the period allowed by this sub-section may,\nin the event of the death of the claimant or objector, be continued by his legal representative.\n(2) Claims or objections under sub-section (1) may be preferred or made in the Court by which the\norder of attachment is issued, or, if the claim or objection is in respect of property attached under an order\nendorsed under sub-section (2) of section 85, in the Court of the Chief Judicial Magistrate of the district in\nwhich the attachment is made.\n(3) Every such claim or objection shall be inquired into by the Court in which it is preferred or made:\nProvided that, if it is preferred or made in the Court of a Chief Judicial Magistrate, he may make it over\nfor disposal to any Magistrate subordinate to him.\n(4) Any person whose claim or objection has been disallowed in whole or in part by an order under\nsub-section (1) may, within a period of one year from the date of such order, institute a suit to establish the\nright which he claims in respect of the property in dispute; but subject to the result of such suit, if any, the\norder shall be conclusive.", "text_hi": "87. (1)   85              \n       ,      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "88", "heading_en": "Release, sale and restoration of attached property.—(1) If the proclaimed person appears within", "text_en": "the  time  specified  in  the  proclamation,  the  Court  shall  make  an  order  releasing  the  property  from  the\nattachment.\n(2) If the proclaimed person does not appear within the time specified in the proclamation, the property\nunder the attachment shall be at the disposal of the State Government; but it shall not be sold until the\nexpiration of six months from the date of the attachment and until any claim preferred or objection made\nunder section 87 has been disposed of under that section, unless it is subject to speedy and natural decay,\nor the Court considers that the sale would be for the benefit of the owner; in either of which cases the Court\nmay cause it to be sold whenever it thinks fit.\n(3) If, within two years from the date of the attachment, any person whose property is or has been at\nthe  disposal  of  the  State  Government  under  sub-section  (2),  appears  voluntarily  or  is  apprehended  and\nbrought before the Court by whose order the property was attached, or the Court to which such Court is\nsubordinate, and proves to the satisfaction of such Court that he did not abscond or conceal himself for the\npurpose of avoiding execution of the warrant, and that he had not such notice of the proclamation as to\nenable him to attend within the time specified therein, such property, or, if the same has been sold, the net\nproceeds of the sale, or, if part only thereof has been sold, the net proceeds of the sale and the residue of\nthe  property,  shall,  after  satisfying  therefrom  all  costs  incurred  in  consequence  of  the  attachment,  be\ndelivered to him.", "text_hi": "88. (1)           \n                \n(2)            \n    ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "89", "heading_en": "Appeal from order rejecting application for restoration of attached property.—Any person", "text_en": "referred  to  in  sub-section  (3)  of  section  88,  who  is  aggrieved  by  any  refusal  to  deliver  property  or  the\nproceeds of the sale thereof may appeal to the Court to which appeals ordinarily lie from the sentences of\nthe first-mentioned Court.\nD.—Other rules regarding processes", "text_hi": "89.  88   (3)    ,      \n        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "90", "heading_en": "Issue of warrant in lieu of, or in addition to, summons.—A Court may, in any case in which it", "text_en": "is empowered by this Sanhita to issue a summons for the appearance of any person, issue, after recording\nits reasons in writing, a warrant for his arrest—\n(a) if, either before the issue of such summons, or after the issue of the same but before the time\nfixed for his appearance, the Court sees reason to believe that he has absconded or will not obey the\nsummons; or\n(b) if at such time he fails to appear and the summons is proved to have been duly served in time\nto admit of his appearing in accordance therewith and no reasonable excuse is offered for such failure.", "text_hi": "90.      ,        \n            ,    \n   ,         \n()               \n              \n               ;   \n()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "91", "heading_en": "Power to take bond or bail bond for appearance.—When any person for whose appearance or", "text_en": "arrest the officer presiding in any Court is empowered to issue a summons or warrant, is present in such\nCourt, such officer may require such person to execute a bond or bail bond for his appearance in such Court,\nor any other Court to which the case may be transferred for trial.", "text_hi": "91.   ,         \n           ,    \n               \n     ,         \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "92", "heading_en": "Arrest on breach of bond or bail bond for appearance.—When any person who is bound by any", "text_en": "bond or bail bond taken under this Sanhita to appear before a Court, does not appear, the officer presiding\nin such Court may issue a warrant directing that such person be arrested and produced before him.", "text_hi": "92.  ,         \n         ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "93", "heading_en": "Provisions of this Chapter generally applicable to summons and warrants of arrest.—The", "text_en": "provisions  contained  in  this  Chapter  relating  to  summons  and  warrant,  and  their  issue,  service  and\nexecution, shall, so far as may be, apply to every summons and every warrant of arrest issued under this\nSanhita.", "text_hi": "93.       ,      \n                 \n     ,      \n  7", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "94", "heading_en": "Summons to produce document or other thing.—(1) Whenever any Court or any officer in", "text_en": "charge  of  a  police  station  considers  that  the  production  of  any  document,  electronic  communication,\nincluding communication devices, which is likely to contain digital evidence or other thing is necessary or\ndesirable for the purposes of any investigation, inquiry, trial or other proceeding under this Sanhita by or\nbefore such Court or officer, such Court may issue a summons or such officer may, by a written order,\neither  in  physical  form  or  in  electronic  form,  require  the  person  in  whose  possession  or  power  such\ndocument or thing is believed to be, to attend and produce it, or to produce it, at the time and place stated\nin the summons or order.\n(2)  Any  person  required  under  this  section  merely  to  produce  a  document,  or  other  thing  shall  be\ndeemed to have complied with the requisition if he causes such document or thing to be produced instead\nof attending personally to produce the same.\n(3) Nothing in this section shall be deemed—\n(a) to affect sections 129 and 130 of the Bharatiya Sakshya Adhiniyam, 2023 or the Bankers’ Books\nEvidence Act, 1891 (13 of 1891); or\n(b) to apply to a letter, postcard, or other document or any parcel or thing in the custody of the\npostal authority.", "text_hi": "94. (1)            \n      , , ,      \n ,               \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "95", "heading_en": "Procedure as to letters.—(1) If any document, parcel or thing in the custody of a postal authority", "text_en": "is,  in  the  opinion  of  the  District  Magistrate,  Chief  Judicial  Magistrate,  Court  of  Session  or  High  Court\nwanted  for  the  purpose  of  any  investigation,  inquiry,  trial  or  other  proceeding  under  this  Sanhita,  such\nMagistrate or Court may require the postal authority to deliver the document, parcel or thing to such person\nas the Magistrate or Court directs.\n(2) If any such document, parcel or thing is, in the opinion of any other Magistrate, whether Executive\nor Judicial, or of any Commissioner of Police or District Superintendent of Police, wanted for any such\npurpose, he may require the postal authority to cause search to be made for and to detain such document,\nparcel  or  thing  pending  the  order  of  a  District  Magistrate,  Chief  Judicial  Magistrate  or  Court  under\nsub-section (1).", "text_hi": "95. (1)    ,   ,    \n            ,  \n       , ,      \n        , ,    \n      ,        , \n      ,      \n(2)     ,      ,   \n           ,    \n       , ,      \n    ,           \n(1)    ,         \n        \n  \n -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "96", "heading_en": "When search-warrant may be issued.—(1) Where—", "text_en": "B.—Search-warrants\n(a)  any  Court  has  reason  to  believe  that  a  person  to  whom  a  summons  order  under  section  94  or  a\nrequisition  under  sub-section  (1)  of  section  95  has  been,  or  might  be,  addressed,  will  not  or  would  not\nproduce the document or thing as required by such summons or requisition; or\n(b) such document or thing is not known to the Court to be in the possession of any person; or\n(c) the Court considers that the purposes of any inquiry, trial or other proceeding under this Sanhita will\nbe served by a general search or inspection,\nit  may  issue  a  search-warrant;  and  the  person  to  whom  such  warrant  is  directed,  may  search  or  inspect  in\naccordance therewith and the provisions hereinafter contained.\n(2) The Court may, if it thinks fit, specify in the warrant the particular place or part thereof to which only\nthe search or inspection shall extend; and the person charged with the execution of such warrant shall then search\nor inspect only the place or part so specified.\n(3) Nothing contained in this section shall authorise any Magistrate other than a District Magistrate or Chief\nJudicial Magistrate to grant a warrant to search for a document, parcel or other thing in the custody of the postal\nauthority.", "text_hi": "96. (1)  \n()            , \n  94        95   (1)   \n        ,        \n                \n()               \n         \n()           ,  \n            ,  \n  -       ,     , \n              \n     -\n192   [2 \n(2) ,    ,          \n               \n    ,          ,  \n         ,      \n(3)              \n         ,    \n              \n   \n,  \n  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "97", "heading_en": "Search of place suspected to contain stolen property, forged documents, etc.—(1) If a District", "text_en": "Magistrate, Sub-divisional Magistrate or Magistrate of the first class, upon information and after such inquiry as\nhe thinks necessary, has reason to believe that any place is used for the deposit or sale of stolen property, or for\nthe  deposit,  sale  or  production  of  any  objectionable  article  to  which  this  section  applies,  or  that  any  such\nobjectionable article is deposited in any place, he may by warrant authorise any police officer above the rank of\na constable—\n(a) to enter, with such assistance as may be required, such place;\n(b) to search the same in the manner specified in the warrant;\n(c) to take possession of any property or article therein found which he reasonably suspects to be stolen\nproperty or objectionable article to which this section applies;\n(d) to convey such property or article before a Magistrate, or to guard the same on the spot until the\noffender is taken before a Magistrate, or otherwise to dispose of it in some place of safety;\n(e) to take into custody and carry before a Magistrate every person found in such place who appears to\nhave  been  privy  to  the  deposit,  sale  or  production  of  any  such  property  or  article  knowing  or  having\nreasonable cause to suspect it to be  stolen property or, as the case may be, objectionable article to which\nthis section applies.\n(2) The objectionable articles to which this section applies are—\n(a) counterfeit coin;\n(b) pieces of metal made in contravention of the Coinage Act, 2011 (11 of 2011), or brought into India\nin  contravention  of  any  notification  for  the  time  being  in  force  issued  under  section  11  of  the  Customs\nAct, 1962 (52 of 1962);\n(c) counterfeit currency note; counterfeit stamps;\n(d) forged documents;\n(e) false seals;\n(f) obscene objects referred to in section 294 of the Bharatiya Nyaya Sanhita, 2023 (45 of 2023);\n(g)  instruments  or  materials  used  for  the  production  of  any  of  the  articles  mentioned  in\nclauses (a) to (f).", "text_hi": "97. (1)   ,         \n          ,     \n                 \n  ,      , ,      \n    ,          , \n               \n     \n()       ,   ,    \n()          \n()         ,      \n  ,      ,      \n,     \n()              \n               \n       \n()              \n    ,            \n  ,             \n      , ,        \n  ,         \n(2)   ,      ,    \n()     \n () - , 2011       \n , 1962   11      \n        -  \n()        \n()    \n 2011  11 \n \n \n \n () ,    294", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "98", "heading_en": "Power to declare certain publications forfeited and to issue search-warrants for", "text_en": "same.—(1) Where—\n(a) any newspaper, or book; or\n(b) any document,\nwherever  printed,  appears  to  the  State  Government  to  contain  any  matter  the  publication  of  which  is\npunishable under section 152 or section 196 or section 197 or section 294 or section 295 or section 299 of\nthe Bharatiya Nyaya Sanhita, 2023 (45 of 2023) , the State Government may, by notification, stating the\ngrounds of its opinion, declare every copy of the issue of the newspaper containing such matter, and every\ncopy of such book or other document to be forfeited to Government, and thereupon any police officer may\nseize the same wherever found in India and any Magistrate may by warrant authorise any police officer not\nbelow the rank of sub-inspector to enter upon and search for the same in any premises where any copy of\nsuch issue, or any such book or other document may be or may be reasonably suspected to be.\n(2) In this section and in section 99,—\n(a) “newspaper” and “book” have the same meanings as in the Press and Registration of Books\nAct, 1867 (25 of 1867);\n(b) “document” includes any painting, drawing or photograph, or other visible representation.\n(3) No order passed or action taken under this section shall be called in question in any Court otherwise\nthan in accordance with the provisions of section 99.", "text_hi": "98. (1) ,        \n()        \n()   , \n      ,        \n,           \n      ,   ,     \n               \n            ,    \n    ,        ,   \n ,           , -\n        ,    ,  \n                 \n   ,            \n       \n   \n  \n  \n  \n- \n   \n \n \n \n \n1867  25 \n (2)      99  \n(      ,     \n , 1867   ; \n(   ,      \n    \n(3)               \n   99", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "99", "heading_en": "Application to High Court to set aside declaration of forfeiture.—(1) Any person having any", "text_en": "interest in any newspaper, book or other document, in respect of which a declaration of forfeiture has been\nmade under section 98, may, within two months from the date of publication in the Official Gazette of such\ndeclaration,  apply  to  the  High  Court  to  set  aside  such  declaration  on  the  ground  that  the  issue  of  the\nnewspaper, or the book or other document, in respect of which the declaration was made, did not contain\nany such matter as is referred to in sub-section (1) of section 98.\n(2) Every such application shall, where the High Court consists of three or more Judges, be heard and\ndetermined by a Special Bench of the High Court composed of three Judges and where the High Court\nconsists of less than three Judges, such Special Bench shall be composed of all the Judges of that High\nCourt.\n(3)  On  the  hearing  of  any  such  application  with  reference  to  any  newspaper,  any  copy  of  such\nnewspaper may be given in evidence in aid of the proof of the nature or tendency of the words, signs or\nvisible representations contained in such newspaper, in respect of which the declaration of forfeiture was\nmade.\n(4) The  High  Court  shall, if  it is  not  satisfied  that the  issue  of the  newspaper, or the  book  or  other\ndocument, in respect of which the application has been made, contained any such matter as is referred to in\nsub-section (1) of section 98, set aside the declaration of forfeiture.\n(5) Where there is a difference of opinion among the Judges forming the Special Bench, the decision\nshall be in accordance with the opinion of the majority of those Judges.", "text_hi": "99. (1)   ,     ,     \n98        ,        \n                 \n               \n       ,        ,  \n    ,   98   (1)      \n(2)         ,    \n             \n              \n             \n(3)           ,  \n ,        ,  ,\n194   [2 \n(4)               \n         ,        \n,        98   (1)   ,    \n        \n(5)    ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "100", "heading_en": "Search for persons wrongfully confined.—If any District Magistrate, Sub-divisional Magistrate", "text_en": "or Magistrate of the first class has reason to believe that any person is confined under such circumstances\nthat the confinement amounts to an offence, he may issue a search-warrant, and the person to whom such\nwarrant is directed may search for the person so confined; and such search shall be made in accordance\ntherewith, and the person, if found, shall be immediately taken before a Magistrate, who shall make such\norder as in the circumstances of the case seems proper.", "text_hi": "100.    ,         \n            ,   \n      ,   -      \n,       ,       \n ,             ,  \n       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "101", "heading_en": "Power to compel restoration of abducted females.—Upon complaint made on oath of the", "text_en": "abduction  or  unlawful  detention  of  a  woman,  or  a  female  child  for  any  unlawful  purpose,  a  District\nMagistrate, Sub-divisional Magistrate or Magistrate of the first class may make an order for the immediate\nrestoration of such woman to her liberty, or of such female child to her parent, guardian or other person\nhaving the lawful charge of such child, and may compel compliance with such order, using such force as\nmay be necessary.\nC.—General provisions relating to searches", "text_hi": "101.            \n                \n ,             \n         -,    \n ,       ,        \n       ,   ,      \n   \n-", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "102", "heading_en": "Direction, etc., of search-warrants.—The provisions of sections 32, 72, 74, 76, 79, 80 and 81", "text_en": "shall,  so  far  as  may  be,  apply  to  all  search-warrants  issued  under  section  96,  section  97,  section  98  or\nsection 100.", "text_hi": "102.  32,  72,  74,  76,  79,  80   81  \n,    ,   -      96,  97, \n 98   100", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "103", "heading_en": "Persons in charge of closed place to allow search.—(1) Whenever any place liable to search or", "text_en": "inspection under this Chapter is closed, any person residing in, or being in charge of, such place, shall, on\ndemand of the officer or other person executing the warrant, and on production of the warrant, allow him\nfree ingress thereto, and afford all reasonable facilities for a search therein.\n(2) If ingress into such place cannot be so obtained, the officer or other person executing the warrant\nmay proceed in the manner provided by sub-section (2) of section 44.\n(3) Where any person in or about such place is reasonably suspected of concealing about his person\nany article for which search should be made, such person may be searched and if such person is a woman,\nthe search shall be made by another woman with strict regard to decency.\n(4) Before making a search under this Chapter, the officer or other person about to make it shall call\nupon two or more independent and respectable inhabitants of the locality in which the place to be searched\nis situate or of any other locality if no such inhabitant of the said locality is available or is willing to be a\nwitness to the search, to attend and witness the search and may issue an order in writing to them or any of\nthem so to do.\n(5) The search shall be made in their presence, and a list of all things seized in the course of such search\nand of the places in which they are respectively found shall be prepared by such officer or other person and\nsigned by such witnesses; but no person witnessing a search under this section shall be required to attend\nthe Court as a witness of the search unless specially summoned by it.\n(6)  The  occupant  of  the  place  searched,  or  some  person  in  his  behalf,  shall,  in  every  instance,  be\npermitted to attend during the search, and a copy of the list prepared under this section, signed by the said\nwitnesses, shall be delivered to such occupant or person.\n(7) When any person is searched under sub-section (3), a list of all things taken possession of shall be\nprepared, and a copy thereof shall be delivered to such person.\n(8) Any person who, without reasonable cause, refuses or neglects to attend and witness a search under\nthis section, when called upon to do so by an order in writing delivered or tendered to him, shall be deemed\nto have committed an offence under section 222 of the Bharatiya Nyaya Sanhita, 2023 (45 of 2023).", "text_hi": "103. (1)             \n                \n      ,       ,   \n                \n         \n(2)                \n  ,         44   (2)  \n        \n(3)       ,        , \n                 \n                \n    ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "104", "heading_en": "Disposal of things found in search beyond jurisdiction.—When, in the execution of a search-", "text_en": "warrant at any place beyond the local jurisdiction of the Court which issued the same, any of the things for\nwhich  search  is  made,  are  found,  such  things,  together  with  the  list  of  the  same  prepared  under  the\nprovisions hereinafter contained, shall be immediately taken before the Court issuing the warrant, unless\nsuch place is nearer to the Magistrate having jurisdiction therein than to such Court, in which case the list\nand  things  shall  be  immediately  taken  before  such  Magistrate;  and,  unless  there  be  good  cause  to  the\ncontrary, such Magistrate shall make an order authorising them to be taken to such Court.\nD.—Miscellaneous", "text_hi": "104. -        ,    \n     ,     ,    ,   \n   ,       ,       \n   ,       ,     \n                \n  ,     ,         \n          ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "105", "heading_en": "Recording of search and seizure through audio-video electronic means.—The process of", "text_en": "conducting search of a place or taking possession of any property, article or thing under this Chapter or\nunder section 185, including preparation of the list of all things seized in the course of such search and\nseizure and signing of such list by witnesses, shall be recorded through any audio-video electronic means\npreferably mobile phone and the police officer shall without delay forward such recording to the District\nMagistrate, Sub-divisional Magistrate or Judicial Magistrate of the first class.", "text_hi": "105. , \n-\n -\n196   [2 \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "106", "heading_en": "Power of police officer to seize certain property.—(1) Any police officer may seize any property", "text_en": "which may be alleged or suspected to have been stolen, or which may be found under circumstances which\ncreate suspicion of the commission of any offence.\n(2) Such police officer, if subordinate to the officer in charge of a police station, shall forthwith report\nthe seizure to that officer.\n(3) Every police officer acting under sub-section (1) shall forthwith report the seizure to the Magistrate\nhaving jurisdiction and where the property seized is such that it cannot be conveniently transported to the\nCourt, or where there is difficulty in securing proper accommodation for the custody of such property, or\nwhere the continued retention of the property in police custody may not be considered necessary for the\npurpose of investigation, he may give custody thereof to any person on his executing a bond undertaking\nto produce the property before the Court as and when required and to give effect to the further orders of the\nCourt as to the disposal of the same:\nProvided that where the property seized under sub-section (1) is subject to speedy and natural decay\nand if the person entitled to the possession of such property is unknown or absent and the value of such\nproperty  is  less  than  five  hundred  rupees,  it  may  forthwith  be  sold  by  auction  under  the  orders  of  the\nSuperintendent of Police and the provisions of sections 503 and 504 shall, as nearly as may be practicable,\napply to the net proceeds of such sale.", "text_hi": "106. (1)       ,     \n                 \n   ,            \n(2)            \n            \n(3)  (1)          \n              \n                 \n         ,      \n               \n                \n               \n             \n    \n   (1)          \n               \n           ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "107", "heading_en": "Attachment, forfeiture or restoration of property.—(1) Where a police officer making an", "text_en": "investigation has reason to believe that any property is derived or obtained, directly or indirectly, as a result\nof  a  criminal  activity  or  from  the  commission  of  any  offence,  he  may,  with  the  approval  of  the\nSuperintendent of Police or Commissioner of Police, make an application to the Court or the Magistrate\nexercising  jurisdiction  to  take  cognizance  of  the  offence  or  commit  for  trial  or  try  the  case,  for  the\nattachment of such property.\n(2) If the Court or the Magistrate has reasons to believe, whether before or after taking evidence, that\nall or any of such properties are proceeds of crime, the Court or the Magistrate may issue a notice upon\nsuch  person  calling  upon  him  to  show  cause  within  a  period  of  fourteen  days  as  to  why  an  order  of\nattachment shall not be made.\n(3) Where the notice issued to any person under sub-section (2) specifies any property as being held by\nany other person on behalf of such person, a copy of the notice shall also be served upon such other person.\n(4) The Court or the Magistrate may, after considering the explanation, if any, to the show-cause notice\nissued under sub-section (2) and the material fact available before such Court or Magistrate and after giving\na reasonable opportunity of being heard to such person or persons, may pass an order of attachment, in\nrespect of those properties which are found to be the proceeds of crime:\nProvided that if such person does not appear before the Court or the Magistrate or represent his case\nbefore the Court or Magistrate within a  period of fourteen days specified in the show-cause notice, the\nCourt or the Magistrate may proceed to pass the ex parte order.\n(5)  Notwithstanding  anything  contained  in  sub-section  (2),  if  the  Court  or  the  Magistrate  is  of  the\nopinion that issuance of notice under the said sub-section would defeat the object of attachment or seizure,\nthe  Court  or  Magistrate  may  by  an  interim  order  passed  ex  parte  direct  attachment  or  seizure  of  such\nproperty, and such order shall remain in force till an order under sub-section (6) is passed.\n(6) If the Court or the Magistrate finds the attached or seized properties to be the proceeds of crime, the\nCourt or the Magistrate shall by order direct the District Magistrate to rateably distribute such proceeds of\ncrime to the persons who are affected by such crime.\n(7) On receipt of an order passed under sub-section (6), the District Magistrate shall, within a period of\nsixty days distribute the proceeds of crime either by himself or authorise any officer subordinate to him to\neffect such distribution.\n(8) If there are no claimants to receive such proceeds or no claimant is ascertainable or there is any\nsurplus after satisfying the claimants, such proceeds of crime shall stand forfeited to the Government.", "text_hi": "107. (1) \n, ,\n,   \n \n \n \n \n, , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "108", "heading_en": "Magistrate may direct search in his presence.—Any Magistrate may direct a search to be made", "text_en": "in his presence of any place for the search of which he is competent to issue a search-warrant.", "text_hi": "108.     ,        \n     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "109", "heading_en": "Power to impound document, etc., produced.—Any Court may, if it thinks fit, impound any", "text_en": "document or thing produced before it under this Sanhita.", "text_hi": "109.      ,       , \n          ,        \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "110", "heading_en": "Reciprocal arrangements regarding processes.—(1) Where a Court in the territories to which", "text_en": "this Sanhita extends (hereafter in this section referred to as the said territories) desires that—\n(a) a summons to an accused person; or\n(b) a warrant for the arrest of an accused person; or\n(c) a summons to any person requiring him to attend and produce a document or other thing, or to\nproduce it; or\n(d) a search-warrant,\nissued by it shall be served or executed at any place,—\n(i) within the local jurisdiction of a Court in any State or area in India outside the said territories, it\nmay send such summons or warrant in duplicate by post or otherwise, to the presiding officer of that\nCourt to be served or executed; and where any summons referred to in clause (a) or clause (c) has been\nso served, the provisions of section 70 shall apply in relation to such summons as if the presiding officer\nof the Court to whom it is sent were a Magistrate in the said territories;\n(ii) in any country or place outside India in respect of which arrangements have been made by the\nCentral Government with the Government of such country or place for service or execution of summons\nor warrant in relation to criminal matters (hereafter in this section referred to as the contracting State),\nit  may  send  such  summons  or  warrant  in  duplicate  in  such  form,  directed  to  such  Court,  Judge  or\nMagistrate,  and  send  to  such  authority  for  transmission,  as  the  Central  Government  may,  by\nnotification, specify in this behalf.\n(2) Where a Court in the said territories has received for service or execution—\n(a) a summons to an accused person; or\n(b) a warrant for the arrest of an accused person; or\n(c) a summons to any person requiring him to attend and produce a document or other thing, or to\nproduce it; or\n(d) a search-warrant,\nissued by—\n(I) a Court in any State or area in India outside the said territories;\n(II) a Court, Judge or Magistrate in a contracting State,\nit shall cause the same to be served or executed as if it were a summons or warrant received by it from\nanother Court in the said territories for service or execution within its local jurisdiction; and where—\n(i) a warrant of arrest has been executed, the person arrested shall, so far as possible, be dealt with\nin accordance with the procedure specified by sections 82 and 83;\n(ii) a search-warrant has been executed, the things found in the search shall, so far as possible, be\ndealt with in accordance with the procedure specified by section 104:\nProvided that in a case where a summons or search-warrant received from a contracting State has been\nexecuted, the documents or things produced or things found in the search shall be forwarded to the Court\nissuing  the  summons  or  search-warrant  through  such  authority  as  the  Central  Government  may,  by\nnotification, specify in this behalf.", "text_hi": "110. (1)      ,      \n (          )     \n()            \n()             \n()               \n       ,           \n()  - , \n       ,\n198   [2 \n   \n(i)              \n ,          \n  ,   ,        \n           ()   ()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "112", "heading_en": "Letter of request to competent authority for investigation in a country or place outside", "text_en": "India.—(1) If, in the course of an investigation into an offence, an application is made by the investigating\nofficer or any officer superior in rank to the investigating officer that evidence may be available in a country\nor place outside India, any Criminal Court may issue a letter of request to a Court or an authority in that\ncountry  or  place  competent  to  deal  with  such  request  to  examine  orally  any  person  supposed  to  be\nacquainted with the facts and circumstances of the case and to record his statement made in the course of\nsuch examination and also to require such person or any other person to produce any document or thing\nwhich may be in his possession pertaining to the case and to forward all the evidence so taken or collected\nor the authenticated copies thereof or the thing so collected to the Court issuing such letter.\n(2) The letter of request shall be transmitted in such manner as the Central Government may specify in\nthis behalf.\n(3) Every statement recorded or document or thing received under sub-section (1) shall be deemed to\nbe the evidence collected during the course of investigation under this Sanhita.", "text_hi": "112(1)        ,    \n               \n               \n            ,  \n        ,      \n       ,       \n            \n             \n             \n              \n              \n    \n(2)             \n   \n()  ()\n200   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "113", "heading_en": "Letter of request from a country or place outside India to a Court or an authority for", "text_en": "investigation in India.—(1) Upon receipt of a letter of request from a Court or an authority in a country or\nplace outside India competent to issue such letter in that country or place for the examination of any person\nor production of any document or thing in relation to an offence under investigation in that country or place,\nthe Central Government may, if it thinks fit—\n(i) forward the same to the Chief Judicial Magistrate or Judicial Magistrate as he may appoint in\nthis behalf, who shall thereupon summon the person before him and record his statement or cause the\ndocument or thing to be produced; or\n(ii) send the letter to any police officer for investigation, who shall thereupon investigate into the\noffence in the same manner,\nas if the offence had been committed within India.\n(2) All the evidence taken or collected under sub-section (1), or authenticated copies thereof or the\nthing so collected, shall be forwarded by the Magistrate or police officer, as the case may be, to the Central\nGovernment for transmission to the Court or the authority issuing the letter of request, in such manner as\nthe Central Government may deem fit.", "text_hi": "113(1)              \n,               \n                 \n         ,    ,  \n     ,  \n(i)        ,    \n  ,          \n             \n ;  \n(ii)              \n       ,  \n          \n(2)  (1)        ,   \n     , ,       \n   ,   ,     \n    ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "114", "heading_en": "Assistance in securing transfer of persons.—(1) Where a Court in India, in relation to a criminal", "text_en": "matter, desires that a warrant for arrest of any person to attend or produce a document or other thing issued\nby it shall be executed in any place in a contracting State, it shall send such warrant in duplicate in such\nform  to  such  Court,  Judge  or  Magistrate  through  such  authority,  as  the  Central  Government  may,  by\nnotification, specify in this behalf and that Court, Judge or Magistrate, as the case may be, shall cause the\nsame to be executed.\n(2) If , in the course of an investigation or any inquiry into an offence, an application is made by the\ninvestigating  officer  or  any  officer  superior  in  rank  to  the  investigating  officer  that  the  attendance  of  a\nperson who is in any place in a contracting State is required in connection with such investigation or inquiry\nand  the  Court  is  satisfied  that  such  attendance  is  so  required,  it  shall  issue  a  summons  or  warrant,  in\nduplicate,  against  the  said  person  to  such  Court,  Judge  or  Magistrate,  in  such  form  as  the  Central\nGovernment may, by notification, specify in this behalf, to cause the same to be served or executed.\n(3) Where a Court in India, in relation to a criminal matter, has received a warrant for arrest of any\nperson requiring him to attend or attend and produce a document or other thing in that Court or before any\nother investigating agency, issued by a Court, Judge or Magistrate in a contracting State, the same shall be\nexecuted as if it is the warrant received by it from another Court in India for execution within its local\nlimits.\n(4) Where a person transferred to a contracting State pursuant to sub-section (3) is a prisoner in India,\nthe Court in India or the Central Government may impose such conditions as that Court or Government\ndeems fit.\n(5) Where the person transferred to India pursuant to sub-section (1) or sub-section (2) is a prisoner in\na  contracting  State,  the  Court  in  India  shall  ensure  that  the  conditions  subject  to  which  the  prisoner  is\ntransferred  to  India  are  complied  with  and  such  prisoner  shall  be  kept  in  such  custody  subject  to  such\nconditions as the Central Government may direct in writing.", "text_hi": "114(1)     ,        \n               , \n        ,      \n  ,             \n           ,    \n,      ,   ,  ,  \n  , , ,  ,     \n      \n(2) ,            \n             \n       ,         \n,               \n                \n         ,   ,  , \n        ,   ,  \n,      \n(3)     ,      ,  \n    ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "115", "heading_en": "Assistance in relation to orders of attachment or forfeiture of property.—(1) Where a Court", "text_en": "in India has reasonable grounds to believe that any property obtained by any person is derived or obtained,\ndirectly  or  indirectly,  by  such  person  from  the  commission  of  an  offence,  it  may  make  an  order  of\nattachment or forfeiture of such property, as it may deem fit under the provisions of sections 116 to 122\n(both inclusive).\n(2)  Where  the  Court  has  made  an  order  for  attachment  or  forfeiture  of  any  property  under\nsub-section (1), and such property is suspected to be in a contracting State, the Court may issue a letter of\nrequest to a Court or an authority in the contracting State for execution of such order.\n(3) Where a letter of request is received by the Central Government from a Court or an authority in a\ncontracting State requesting attachment or forfeiture of the property in India, derived or obtained, directly\nor indirectly, by any person from the commission of an offence committed in that contracting State, the\nCentral  Government  may  forward  such  letter  of  request  to  the  Court,  as  it  thinks  fit,  for  execution  in\naccordance with the provisions of sections 116 to 122 (both inclusive) or, as the case may be, any other law\nfor the time being in force.", "text_hi": "115 (1)             \n              \n                 \n             116   122 \n( )         \n(2)     (1)          \n                 \n,             \n       \n(3)             \n                \n                 \n                 \n    ,      ,    , \n,  116   122 (  )", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "116", "heading_en": "Identifying unlawfully acquired property.—(1) The Court shall, under sub-section (1), or on", "text_en": "receipt of a letter of request under sub-section (3) of section 115, direct any police officer not below the\nrank of Sub-Inspector of Police to take all steps necessary for tracing and identifying such property.\n(2) The steps referred to in sub-section (1) may include any inquiry, investigation or survey in respect\nof  any  person,  place,  property,  assets,  documents,  books  of  account  in  any  bank  or  public  financial\ninstitutions or any other relevant matters.\n(3) Any inquiry, investigation or survey referred to in sub-section (2) shall be carried out by an officer\nmentioned in sub-section (1) in accordance with such directions issued by the said Court in this behalf.", "text_hi": "116 (1) ,  115   (1)      (3) \n       -      \n              \n         \n(2)  (1)     ,  , , , \n, ,            \n    ,         \n(3)  (2)    ,   ,    \n        (1)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "117", "heading_en": "Seizure or attachment of property.—(1) Where any officer conducting an inquiry or", "text_en": "investigation under section 116 has a reason to believe that any property in relation to which such inquiry\nor investigation is being conducted is likely to be concealed, transferred or dealt with in any manner which\nwill result in disposal of such property, he may make an order for seizing such property and where it is not\npracticable to seize such property, he may make an order of attachment directing that such property shall\nnot be transferred or otherwise dealt with, except with the prior permission of the officer making such order,\nand a copy of such order shall be served on the person concerned.\n(2) Any order made under sub-section (1) shall have no effect unless the said order is confirmed by an\norder of the said Court, within a period of thirty days of its being made.", "text_hi": "117 (1)   116          \n           ,      \n     ,  ,\n202   [2 \n               \n                \n                \n                \n               \n          \n(2)  (1)             \n,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "118", "heading_en": "Management of properties seized or forfeited under this Chapter.—(1) The Court may appoint", "text_en": "the District Magistrate of the area where the property is situated, or any other officer that may be nominated\nby the District Magistrate, to perform the functions of an Administrator of such property.\n(2) The Administrator appointed under sub-section (1) shall receive and manage the property in relation\nto which the order has been made under sub-section (1) of section 117 or under section 120 in such manner\nand subject to such conditions as may be specified by the Central Government.\n(3) The Administrator shall also take such measures, as the Central Government may direct, to dispose\nof the property which is forfeited to the Central Government.", "text_hi": "118. (1)    ,    ,   ,  \n   ,       ,  \n               \n(2)  (1)      ,   ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "119", "heading_en": "Notice of forfeiture of property.—(1) If as a result of the inquiry, investigation or survey under", "text_en": "section 116, the Court has reason to believe that all or any of such properties are proceeds of crime, it may\nserve a notice upon such person (hereinafter referred to as the person affected) calling upon him within a\nperiod of thirty days specified in the notice to indicate the source of income, earnings or assets, out of which\nor by means of which he has acquired such property, the evidence on which he relies and other relevant\ninformation and particulars, and to show cause why all or any of such properties, as the case may be, should\nnot be declared to be proceeds of crime and forfeited to the Central Government.\n(2) Where a notice under sub-section (1) to any person specifies any property as being held on behalf\nof such person by any other person, a copy of the notice shall also be served upon such other person.", "text_hi": "119. (1) ,  116   ,     , \n             ,  \n        (       \n )      ,          \n           ,    \n  ,          ,     \n              \n  , ,          \n                  \n(2)      (1)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "120", "heading_en": "Forfeiture of property in certain cases.—(1) The Court may, after considering the explanation,", "text_en": "if any, to the show-cause notice issued under section 119 and the material available before it and after giving\nto the person affected (and in a case where the person affected holds any property specified in the notice\nthrough any other person, to such other person also) a  reasonable opportunity of being heard, by order,\nrecord a finding whether all or any of the properties in question are proceeds of crime:\nProvided that if the person affected (and in a case where the person affected holds any property specified\nin the notice through any other person such other person also) does not appear before the Court or represent\nhis case before it within a period of thirty days specified in the show-cause notice, the Court may proceed\nto record a finding under this sub-section ex parte on the basis of evidence available before it.\n(2) Where the Court is satisfied that some of the properties referred to in the show-cause notice are\nproceeds of crime but it is not possible to identify specifically such properties, then, it shall be lawful for\nthe Court to specify the properties which, to the best of its judgment, are proceeds of crime and record a\nfinding accordingly under sub-section (1).\n(3) Where the Court records a finding under this section to the effect that any property is proceeds of\ncrime, such property shall stand forfeited to the Central Government free from all encumbrances.\n(4) Where any shares in a company stand forfeited to the Central Government under this section, then,\nthe company shall, notwithstanding anything contained in the Companies Act, 2013 (18 of 2013) or the\nArticles of Association of the company, forthwith register the Central Government as the transferee of such\nshares.", "text_hi": "120. (1) ,  119          \n ,   ,          \n     (         \n               \n  )       ,  ,   \n             \n  : \n    (", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "121", "heading_en": "Fine in lieu of forfeiture.—(1) Where the Court makes a declaration that any property stands", "text_en": "forfeited to the Central Government under section 120 and it is a case where the source of only a part of\nsuch property has not been proved to the satisfaction of the Court, it shall make an order giving an option\nto the person affected to pay, in lieu of forfeiture, a fine equal to the market value of such part.\n(2) Before making an order imposing a fine under sub-section (1), the person affected shall be given a\nreasonable opportunity of being heard.\n(3) Where the person affected pays the fine due  under sub-section (1), within such time as may be\nallowed in that behalf, the Court may, by order, revoke the declaration of forfeiture under section 120 and\nthereupon such property shall stand released.", "text_hi": "121 (1)           120   \n              \n               \n    ,            \n       ,     \n(2)  (1)          , \n           \n(3)   ,  (1)         \n,      ,      ,  \n,  120             \n         \n \n 122   117   (1)        119  \n      ,         \n                \n  ,              \n 120", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "123", "heading_en": "Procedure in respect of letter of request.—Every letter of request, summons or warrant, received", "text_en": "by the Central Government from, and every letter of request, summons or warrant, to be transmitted to a\ncontracting State under this Chapter shall be transmitted to a contracting State or, as the case may be, sent\nto  the  concerned  Court  in  India  in  such  form  and  in  such  manner  as  the  Central  Government  may,  by\nnotification, specify in this behalf.", "text_hi": "123              \n,             \n ,      ,         \n ,  ,    , ,\n204   [2 \n              \n   \n  124  ,    ,       \n    ,       ,   \n    ,           \n     \n  9", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "125", "heading_en": "Security for keeping peace on conviction.—(1) When a Court of Session or Court of a Magistrate", "text_en": "of the first class convicts a person of any of the offences specified in sub-section (2) or of abetting any such\noffence and is of opinion that it is necessary to take security from such person for keeping the peace, the\nCourt may, at the time of passing sentence on such person, order him to execute a bond or bail bond, for\nkeeping the peace for such period, not exceeding three years, as it thinks fit.\n(2) The offences referred to in sub-section (1) are—\n(a) any offence punishable under Chapter XI of the Bharatiya Nyaya Sanhita, 2023 (45 of 2023),\nother than an offence punishable under sub-section (1) of section 193 or section 196 or section 197\nthereof;\n(b)  any  offence  which  consists  of,  or  includes,  assault  or  using  criminal  force  or  committing\nmischief;\n(c) any offence of criminal intimidation;\n(d) any other offence which caused, or was intended or known to be likely to cause, a breach of the\npeace.\n(3) If the conviction is set aside on appeal or otherwise, the bond or bail bond so executed shall become\nvoid.\n(4) An order under this section may also be made by an Appellate Court or by a Court when exercising\nits powers of revision.", "text_hi": "125. (1)           \n   (2)             \n               \n             ,  \n                \n    ,    ,     , \n     \n(2)  (1)        \n () ,         \n,   19   19   \n     ; \n()    ,   ,      \n     ; \n()      ; \n()   ,          \n ,               \n(3)              \n     ,      \n(4)             \n           ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "126", "heading_en": "Security for keeping peace in other cases.—(1) When an Executive Magistrate receives", "text_en": "information that any person is likely to commit a breach of the peace or disturb the public tranquillity or to\ndo any wrongful act that may probably occasion a breach of the peace or disturb the public tranquillity and\nis of opinion that there is sufficient ground for proceeding, he may, in the manner hereinafter provided,\nrequire such person to show cause why he should not be ordered to execute a bond or bail bond for keeping\nthe peace for such period, not exceeding one year, as the Magistrate thinks fit.\n(2) Proceedings under this section may be taken before any Executive Magistrate when either the place\nwhere the breach of the peace or disturbance is apprehended is within his local jurisdiction or there is within\nsuch jurisdiction a person who is likely to commit a breach of the peace or disturb the public tranquillity or\nto do any wrongful act as aforesaid beyond such jurisdiction.", "text_hi": "126. (1)            \n               \n             \n              ,  \n               \n           ,    \n  ,         \n         \n(2)              \n              ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "127", "heading_en": "Security for good behaviour from persons disseminating certain matters.—(1) When an", "text_en": "Executive Magistrate receives information that there is within his local jurisdiction any person who, within\nor without such jurisdiction,—\n(i)  either  orally  or  in  writing  or  in  any  other  manner,  intentionally  disseminates  or  attempts  to\ndisseminate or abets the dissemination of,—\n(a)  any  matter  the  publication  of  which  is  punishable  under  section  152  or  section  196  or\nsection 197 or section 299 of the Bharatiya Nyaya Sanhita, 2023 (45 of 2023); or\n(b) any matter concerning a Judge acting or purporting to act in the discharge of his official\nduties which amounts to criminal intimidation or defamation under the Bharatiya Nyaya Sanhita,\n2023;\n(ii)  makes,  produces,  publishes  or  keeps  for  sale,  imports,  exports,  conveys,  sells,  lets  to  hire,\ndistributes, publicly exhibits or in any other manner puts into circulation any obscene matter such as is\nreferred to in section 294 of the Bharatiya Nyaya Sanhita, 2023,\nand the Magistrate is of opinion that there is sufficient ground for proceeding, the Magistrate may, in the\nmanner hereinafter provided, require such person to show cause why he should not be ordered to execute a\nbond or bail bond, for his good behaviour for such period, not exceeding one year, as the Magistrate thinks\nfit.\n(2) No proceedings shall be taken under this section against the editor, proprietor, printer or publisher\nof any publication registered under, and edited, printed and published in conformity with, the rules laid\ndown in the Press and Registration of Books Act, 1867 (25 of 1867) with reference to any matter contained\nin such publication except by the order or under the authority of the State  Government or some officer\nempowered by the State Government in this behalf.", "text_hi": "127. (1)            \n        \n(i)               \n              \n  ,   \n  \n  \n   \n \n ()   ,   ,   \n 15   19   19   29     ;   \n \n \n ()   ,         \n         ,     \n,          \n   ;    \n  (ii) ,    29    \n     ,  ,     , \n  ,   ,   ,   ,    \n,   ,            \n  ,  \n            ,   \n,               \n             ,   \n  ,           \n          \n (2) ,       \n,    ,        \n          , ,   \n     ,         \n             ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "128", "heading_en": "Security for good behaviour from suspected persons.—When an Executive Magistrate receives", "text_en": "information that there is within his local jurisdiction a person taking precautions to conceal his presence\nand that there is reason to believe that he is doing so with a view to committing a cognizable offence, the\nMagistrate may, in the manner hereinafter provided, require such person to show cause why he should not\nbe ordered to execute a bond or bail bond for his good behaviour for such period, not exceeding one year,\nas the Magistrate thinks fit.", "text_hi": "128.             \n          \n                 \n  ,              \n                , \n    ,\n206   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "129", "heading_en": "Security for good behaviour from habitual offenders.—When an Executive Magistrate", "text_en": "receives information that there is within his local jurisdiction a person who—\n(a) is by habit a robber, house-breaker, thief, or forger; or\n(b) is by habit a receiver of stolen property knowing the same to have been stolen; or\n(c) habitually protects or harbours thieves, or aids in the concealment or disposal of stolen property;\nor\n(d)  habitually  commits,  or  attempts  to  commit,  or  abets  the  commission  of,  the  offence  of\nkidnapping, abduction, extortion, cheating or mischief, or any offence punishable under Chapter X of\nthe Bharatiya Nyaya Sanhita, 2023, or under section 178, section 179, section 180 or section 181 of\nthat Sanhita; or\n(e) habitually commits, or attempts to commit, or abets the commission of, offences, involving a\nbreach of the peace; or\n(f) habitually commits, or attempts to commit, or abets the commission of—\n(i) any offence under one or more of the following Acts, namely:—\n(a) the Drugs and Cosmetics Act, 1940 (23 of 1940.);\n(b) the Foreigners Act, 1946 (31 of 1946);\n(c) the Employees' Provident Fund and Miscellaneous Provisions Act, 1952 (19 of 1952);\n(d) the Essential Commodities Act, 1955 (10 of 1955);\n(e) the Protection of Civil Rights Act, 1955 (22 of 1955);\n(f) the Customs Act, 1962 (52 of 1962);\n(g) the Food Safety and Standards Act, 2006 (34 of 2006); or\n(ii) any offence punishable under any other law providing for the prevention of hoarding or\nprofiteering or of adulteration of food or drugs or of corruption; or\n(g) is so desperate and dangerous as to render his being at large without security hazardous to the\ncommunity,\nsuch Magistrate may, in the manner hereinafter provided, require such person to show cause why he\nshould not be ordered to execute a bail bond, for his good behaviour for such period, not exceeding three\nyears, as the Magistrate thinks fit.", "text_hi": "129.             \n   ,  \n()  , ,     ;   \n()    ,     ,    ;   \n()               \n           ;   \n() , , ,       \n,    10        ,  \n,              \n            ;   \n()              \n   ,      ;   \n()              \n      \n(i)           \n ,  :  \n \n \n \n \n \n \n \n \n \n \n ()     , 1940; 1940  23 \n () , 1946 ; 1946  \n  - , 1952 ; 1952  19 \n ()   , 1955  ;  1955  10 \n () ; 1955  22 \n ()  , 1962  ; 1962  52 \n () , 2006  ;   2006  34 \n (ii)           \n             \n    ;  \n()            \n     , \n  ,   ,         \n                , \n     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "130", "heading_en": "Order to be made.—When a Magistrate acting under section 126, section 127, section 128 or", "text_en": "section 129, deems it necessary to require any person to show cause under such section, he shall make an\norder  in  writing,  setting  forth  the  substance  of  the  information  received,  the  amount  of  the  bond  to  be\nexecuted, the term for which it is to be in force and the number of sureties, after considering the sufficiency\nand fitness of sureties.", "text_hi": "130.   ,   126,  127,  128   129  \n    ,            \n               , \n   ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "132", "heading_en": "Summons or warrant in case of person not so present.—If such person is not present in Court,", "text_en": "the Magistrate shall issue a summons requiring him to appear, or, when such person is in custody, a warrant\ndirecting the officer in whose custody he is to bring him before the Court:\nProvided that whenever it appears to such Magistrate, upon the report of a police officer or upon other\ninformation (the substance of which report or information shall be recorded by the Magistrate), that there\nis reason to fear the commission of a breach of the peace, and that such breach of the peace cannot be\nprevented otherwise than by the immediate arrest of such person, the Magistrate may at any time issue a\nwarrant for his arrest.", "text_hi": "132.             \n     ,           \n                 \n,   : \n              \n (          ),", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "133", "heading_en": "Copy of order to accompany summons or warrant.—Every summons or warrant issued under", "text_en": "section 132 shall be accompanied by a copy of the order made under section 130, and such copy shall be\ndelivered by the officer serving or executing such summons or warrant to the person served with, or arrested\nunder, the same.", "text_hi": "133.  132             \n130", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "134", "heading_en": "Power to dispense with personal attendance.—The Magistrate may, if he sees sufficient cause,", "text_en": "dispense with the personal attendance of any person called upon to show cause why he should not be ordered\nto execute a bond for keeping the peace or for good behaviour and may permit him to appear by an advocate.", "text_hi": "134.              \n,                \n               \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "135", "heading_en": "Inquiry as to truth of information.—(1) When an order under section 130 has been read or", "text_en": "explained under section 131 to a person present in Court, or when any person appears or is brought before\na Magistrate in compliance with, or in execution of, a summons or warrant, issued under section 132, the\nMagistrate shall proceed to inquire into the truth of the information upon which action has been taken, and\nto take such further evidence as may appear necessary.\n(2) Such inquiry shall be made, as nearly as may be practicable, in the manner hereinafter prescribed\nfor conducting trial and recording evidence in summons-cases.\n(3)  After  the  commencement,  and  before  the  completion,  of  the  inquiry  under  sub-section  (1),  the\nMagistrate, if he considers that immediate measures are necessary for the prevention of a breach of the\npeace or disturbance of the public tranquillity or the commission of any offence or for the public safety,\nmay, for reasons to be recorded in writing, direct the person in respect of whom the order under section 130\nhas been made to execute a bond or bail bond, for keeping the peace or maintaining good behaviour until\nthe conclusion of the inquiry, and may detain him in custody until such bond or bail bond is executed or, in\ndefault of execution, until the inquiry is concluded:\nProvided that—\n(a) no person against whom proceedings are not being taken under section 127, section 128, or\nsection 129 shall be directed to execute a bond or bail bond for maintaining good behaviour;\n(b) the conditions of such bond, whether as to the amount thereof or as to the provision of sureties\nor the number thereof or the pecuniary extent of their liability, shall not be more onerous than those\nspecified in the order under section 130.\n(4) For the purposes of this section the fact that a person is a habitual offender or is so desperate and\ndangerous as to render his being at large without security hazardous to the community may be proved by\nevidence of general repute or otherwise.\n(5) Where two or more persons have been associated together in the matter under inquiry, they may be\ndealt with in the same or separate inquiries as the Magistrate shall think just.\n(6) The inquiry under this section shall be completed within a period of six months from the date of its\ncommencement, and if such inquiry is not so completed, the proceedings under this Chapter shall, on the\nexpiry  of  the  said  period,  stand  terminated  unless,  for  special  reasons  to  be  recorded  in  writing,  the\nMagistrate otherwise directs:\nProvided that where any person has been kept in detention pending such inquiry, the proceeding against\nthat person, unless terminated earlier, shall stand terminated on the expiry of a period of six months of such\ndetention.\n(7) Where any direction is made under sub-section (6) permitting the continuance of proceedings, the\nSessions Judge may, on an application made to him by the aggrieved party, vacate such direction if he is\nsatisfied that it was not based on any special reason or was perverse.", "text_hi": "135. (1)   130      ,    \n ,  131          ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "136", "heading_en": "Order to give security.—If, upon such inquiry, it is proved that it is necessary for keeping the", "text_en": "peace or maintaining good behaviour, as the case may be, that the person in respect of whom the inquiry is\nmade should execute a bond or bail bond, the Magistrate shall make an order accordingly:\nProvided that—\n(a) no person shall be ordered to give security of a nature different from, or of an amount larger\nthan, or for a period longer than, that specified in the order made under section 130;\n(b) the amount of every bond or bail bond shall be fixed with due regard to the circumstances of\nthe case and shall not be excessive;\n(c) when the person in respect of whom the inquiry is made is a child, the bond shall be executed\nonly by his sureties.", "text_hi": "136.          , ,   \n              ,  \n      ,       \n  : \n \n()               \n              \n ,   130         ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "137", "heading_en": "Discharge of person informed against.—If, on an inquiry under section 135, it is not proved that", "text_en": "it is necessary for keeping the peace or maintaining good behaviour, as the case may be, that the person in\nrespect of whom the inquiry is made, should execute a bond, the Magistrate shall make an entry on the\nrecord to that effect, and if such person is in custody only for the purposes of the inquiry, shall release him,\nor, if such person is not in custody, shall discharge him.", "text_hi": "137.   135          , , \n                \n,       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "138", "heading_en": "Commencement of period for which security is required.—(1) If any person, in respect of", "text_en": "whom an order requiring security is made under section 125 or section 136, is at the time such order is\nmade,  sentenced  to,  or  undergoing  a  sentence  of,  imprisonment,  the  period  for  which  such  security  is\nrequired shall commence on the expiration of such sentence.\n(2)  In  other cases such  period  shall commence  on the  date  of  such  order  unless the Magistrate,  for\nsufficient reason, fixes a later date.", "text_hi": "138. (1)   ,          \n 125   136     ,       \n            ,    \n     ,          \n(2)     ,       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "139", "heading_en": "Contents of bond.—The bond or bail bond to be executed by any such person shall bind him to", "text_en": "keep the peace or to be of good behaviour, as the case may be, and in the latter case the commission or\nattempt  to commit,  or the abetment  of,  any  offence punishable  with imprisonment,  wherever it  may  be\ncommitted, is a breach of the bond or bail bond.", "text_hi": "139.          \n, ,             \n              \n ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "140", "heading_en": "Power to reject sureties.— (1) A Magistrate may refuse to accept any surety offered, or may", "text_en": "reject any surety previously accepted by him or his predecessor under this Chapter on the ground that such\nsurety is an unfit person for the purposes of the bail bond:\nProvided that before so refusing to accept or rejecting any such surety, he shall either himself hold an\ninquiry on oath into the fitness of the surety, or cause such inquiry to be held and a report to be made thereon\nby a Magistrate subordinate to him.\n(2) Such Magistrate shall, before holding the inquiry, give reasonable notice to the surety and to the\nperson  by  whom  the  surety  was  offered  and  shall,  in  making  the  inquiry,  record  the  substance  of  the\nevidence adduced before him.\n(3) If the Magistrate is satisfied, after considering the evidence so adduced either before him or before\na Magistrate deputed under sub-section (1), and the report of such Magistrate (if any), that the surety is an\nunfit person for the purposes of the bail bond, he shall make an order refusing to accept or rejecting, as the\ncase may be, such surety and recording his reasons for so doing:\nProvided  that  before  making  an  order  rejecting  any  surety  who  has  previously  been  accepted,  the\nMagistrate shall issue his summons or warrant, as he thinks fit, and cause the person for whom the surety\nis bound to appear or to be brought before him.", "text_hi": "140. (1)             \n   ,    ,        \n             \n      : \n              \n                 \n                \n(2)            ,   \n   ,            \n        \n(3)       (1)    \n             (  \n),             \n          , ,   \n                \n    : \n   ,       ,    \n        ,    ,\n210   [2 \n   ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "141", "heading_en": "Imprisonment in default of security.—(1) (a) If any person ordered to give security under", "text_en": "section 125 or section 136 does not give such security on or before the date on which the period for which\nsuch  security  is  to  be  given  commences,  he  shall,  except  in  the  case  next  hereinafter  mentioned,  be\ncommitted to prison, or, if he is already in prison, be detained in prison until such period expires or until\nwithin such period he gives the security to the Court or Magistrate who made the order requiring it;\n(b) if any person after having executed a bond or bail bond for keeping the peace in pursuance of an\norder of a Magistrate under section 136, is proved, to the satisfaction of such Magistrate or his successor-\nin-office, to have committed breach of the bond or bail bond, such Magistrate or successor-in-office may,\nafter recording the grounds of such proof, order that the person be arrested and detained in prison until the\nexpiry  of  the  period  of  the  bond  or  bail  bond  and  such  order  shall  be  without  prejudice  to  any  other\npunishment or forfeiture to which the said person may be liable in accordance with law.\n(2) When such person has been ordered by a Magistrate to give security for a period exceeding one\nyear, such Magistrate shall, if such person does not give such security as aforesaid, issue a warrant directing\nhim to be detained in prison pending the orders of the Sessions Judge and the proceedings shall be laid, as\nsoon as conveniently may be, before such Court.\n(3)  Such  Court,  after  examining  such  proceedings  and  requiring  from  the  Magistrate  any  further\ninformation  or  evidence  which  it  thinks  necessary,  and  after  giving  the  concerned  person  a  reasonable\nopportunity of being heard, may pass such order on the case as it thinks fit:\nProvided that the period (if any) for which any person is imprisoned for failure to give security shall\nnot exceed three years.\n(4) If security has been required in the course of the same proceeding from two or more persons in\nrespect of any one of whom the proceedings are referred to the Sessions Judge under sub-section (2) such\nreference shall also include the case of any other of such persons who has been ordered to give security,\nand the provisions of sub-sections (2) and (3) shall, in that event, apply to the case of such other person\nalso, except that the period (if any) for which he may be imprisoned, shall not exceed the period for which\nhe was ordered to give security.\n(5)  A  Sessions  Judge  may  in  his  discretion  transfer  any  proceedings  laid  before  him  under\nsub-section (2) or sub-section (4) to an Additional Sessions Judge and upon such transfer, such Additional\nSessions  Judge  may  exercise  the  powers  of  a  Sessions  Judge  under  this  section  in  respect  of  such\nproceedings.\n(6) If the security is tendered to the officer in charge of the jail, he shall forthwith refer the matter to\nthe Court or Magistrate who made the order, and shall await the orders of such Court or Magistrate.\n(7) Imprisonment for failure to give security for keeping the peace shall be simple.\n(8) Imprisonment for failure to give security for good behaviour shall, where the proceedings have been\ntaken  under  section  127,  be  simple,  and,  where  the  proceedings  have  been  taken  under  section  128  or\nsection 129, be rigorous or simple as the Court or Magistrate in each case directs.", "text_hi": "141. (1) ()   ,   125   136   \n       ,         \n ,   ,       ,   ,  \n ,               \n                  \n                 \n             \n    \n()      136         \n           , \n       -        \n             -\n,         ,       \n            \n                \n           \n(2)                \n     ,        \n                \n  ,           \n           \n  (3)             \n     ,    ,      \n               \n       : \n   (  )         \n      ,          \n(4)             \n    ,            \n (2)      ,          \n   ,        ,   \n    (2)   (3)     ,    \n   ,          (  ),  \n     ,      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "142", "heading_en": "Power to release persons imprisoned for failing to give security.— (1) Whenever the District", "text_en": "Magistrate in the case of an order passed by an Executive Magistrate under section 136, or the Chief Judicial\nMagistrate in any other case is of opinion that any person imprisoned for failing to give security under this\nChapter may be released without hazard to the community or to any other person, he may order such person\nto be discharged.\n(2) Whenever any person has been imprisoned for failing to give security under this Chapter, the High\nCourt or Court of Session, or, where the order was made by any other Court, District Magistrate, in the case\nof an order passed by an Executive Magistrate under section 136, or the Chief Judicial Magistrate in any\nother case, may make an order reducing the amount of the security or the number of sureties or the time for\nwhich security has been required.\n(3) An order under sub-section (1) may direct the discharge of such person either without conditions or\nupon any conditions which such person accepts:\nProvided that any condition imposed shall cease to be operative when the period for which such person\nwas ordered to give security has expired.\n(4) The State Government may prescribe, by rules, the conditions upon which a conditional discharge\nmay be made.\n(5) If any condition upon which any person has been discharged is, in the opinion of District Magistrate,\nin the case of an order passed by an Executive Magistrate under section 136, or the Chief Judicial Magistrate\nin any other case by whom the order of discharge was made or of his successor, not fulfilled, he may cancel\nthe same.\n(6) When a conditional order of discharge has been cancelled under sub-section (5), such person may\nbe  arrested  by  any  police  officer  without  warrant,  and  shall  thereupon  be  produced  before  the  District\nMagistrate,  in  the  case  of  an  order  passed  by  an  Executive  Magistrate  under  section  136,  or  the  Chief\nJudicial Magistrate in any other case.\n(7)  Unless  such  person  gives  security  in  accordance  with  the  terms  of  the  original  order  for  the\nunexpired portion of the term for which he was in the first instance committed or ordered to be detained\n(such  portion  being  deemed  to  be  a  period  equal  to  the  period  between  the  date  of  the  breach  of  the\nconditions of discharge and the date on which, except for such conditional discharge, he would have been\nentitled to release), District Magistrate, in the case of an order passed by an Executive Magistrate under\nsection 136, or the Chief Judicial Magistrate in any other case may remand such person to prison to undergo\nsuch unexpired portion.\n(8) A person remanded to prison under sub-section (7) shall, subject to the provisionsof section 141, be\nreleased at any time on giving security in accordance with the terms of the original order for the unexpired\nportion aforesaid to the Court or Magistrate by whom such order was made, or to its or his successor.\n(9) The High Court or Court of Session may at any time, for sufficient reasons to be recorded in writing,\ncancel any bond for keeping the peace or for good behaviour executed under this Chapter by any order\nmade by it, and District Magistrate, in the case of an order  passed by an Executive Magistrate under section\n136, or the Chief Judicial Magistrate in any other case may make such cancellation where such bond was\nexecuted under his order or under the order of any other Court in his district.\n(10) Any surety for the peaceable conduct or good behaviour of another person ordered to execute a\nbond under this Chapter may at any time apply to the Court making such order to cancel the bond and on\nsuch application being made, the Court shall issue a summons or warrant, as it thinks fit, requiring the\nperson for whom such surety is bound to appear or to be brought before it.", "text_hi": "142 (1)    136         \n               \n                  \n ,               \n             \n(2)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "143", "heading_en": "Security for unexpired period of bond.—(1) When a person for whose appearance a summons", "text_en": "or warrant has been issued under the proviso to sub-section (3) of section 140 or under sub-section (10) of\nsection 142, appears or is brought before the Magistrate or Court, the Magistrate or Court shall cancel the\nbond or bail bond executed by such person and shall order such person to give, for the unexpired portion\nof the term of such bond, fresh security of the same description as the original security.\n(2) Every such order shall, for the purposes of sections 139 to 142 (both inclusive) be deemed to be an\norder made under section 125 or section 136, as the case may be.", "text_hi": "143. (1)   ,      140   (3) \n      142   (10)       \n  ,              \n            \n                 , \n   ,          \n()             ( \n     )   , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "144", "heading_en": "Order for maintenance of wives, children and parents.—(1) If any person having sufficient", "text_en": "means neglects or refuses to maintain—\n(a) his wife, unable to maintain herself; or\n(b) his legitimate or illegitimate child, whether married or not, unable to maintain itself; or\n(c) his legitimate or illegitimate child (not being a married daughter) who has attained majority,\nwhere such child is, by reason of any physical or mental abnormality or injury unable to maintain itself;\nor\n(d) his father or mother, unable to maintain himself or herself,\na  Magistrate of  the first  class  may,  upon  proof of  such  neglect  or refusal,  order  such  person to  make  a\nmonthly allowance for the maintenance of his wife or such child, father or mother, at such monthly rate as\nsuch Magistrate thinks fit and to pay the same to such person as the Magistrate may from time to time\ndirect:\nProvided that the Magistrate may order the father of a female child referred to in clause (b) to make\nsuch allowance, until she attains her majority, if the Magistrate is satisfied that the husband of such female\nchild, if married, is not possessed of sufficient means:\nProvided further that the Magistrate may, during the pendency of the proceeding regarding monthly\nallowance for the maintenance under this sub-section, order such person to make a monthly allowance for\nthe interim maintenance of his wife or such child, father or mother, and the expenses of such proceeding\nwhich the Magistrate considers reasonable, and to pay the same to such person as the Magistrate may from\ntime to time direct:\nProvided also that an application for the monthly allowance for the interim maintenance and expenses\nof proceeding under the second proviso shall, as far as possible, be disposed of within sixty days from the\ndate of the service of notice of the application to such person.\nExplanation.—For the purposes of this Chapter, “wife” includes a woman who has been divorced by,\nor has obtained a divorce from, her husband and has not remarried.\n(2) Any such allowance for the maintenance or interim maintenance and expenses of proceeding shall\nbe payable from the date of the order, or, if so ordered, from the date of the application for maintenance or\ninterim maintenance and expenses of proceeding, as the case may be.\n(3) If any person so ordered fails without sufficient cause to comply with the order, any such Magistrate\nmay, for every breach of the order, issue a warrant for levying the amount due in the manner provided for\nlevying fines, and may sentence such person, for the whole or any part of each month's allowance for the\nmaintenance or the interim maintenance and expenses of proceeding, as the case may be, remaining unpaid\nafter the execution of the warrant, to imprisonment for a term which may extend to one month or until\npayment if sooner made:\nProvided that no warrant shall be issued for the recovery of any amount due under this section unless\napplication be made to the Court to levy such amount within a period of one year from the date on which it\nbecame due:\nProvided further that if such person offers to maintain his wife on condition of her living with him, and\nshe refuses to live with him, such Magistrate may consider any grounds of refusal stated by her, and may\nmake an order under this section notwithstanding such offer, if he is satisfied that there is just ground for\nso doing.\nExplanation.—If a husband has contracted marriage with another woman or keeps a mistress, it shall\nbe considered to be just ground for his wife's refusal to live with him.\n(4) No wife shall be entitled to receive an allowance for the maintenance or the interim maintenance\nand expenses of proceeding, from her husband under this section if she is living in adultery, or if, without\nany sufficient reason, she refuses to live with her husband, or if they are living separately by mutual consent.\n(5)  On  proof  that  any  wife  in  whose  favour  an  order  has  been  made  under  this  section  is living  in\nadultery,  or  that  without  sufficient  reason  she  refuses  to  live  with  her  husband,  or  that  they  are  living\nseparately by mutual consent, the Magistrate shall cancel the order.", "text_hi": "144. (1)        \n()   ,       ;  \n()            ,  \n     ;  \n()       (    ),  \n    ,        \n          ;   \n()     ,       ,  \n                \n,         ,       \n       ,          \n  ,    ,          \n        -    : \n   ()             \n                \n       ,    ,      \n    \n    ,         \n         ,        \n      ,         \n              \n    ,     , -   \n : \n              \n      , ,       \n            \n         \n,     -         -\n            ,  \n - \n  \n  \n \n \n  (2)             \n ,    , ,       , , \n              \n    \n(3)        ,\n214   [2 \n                \n          ,     \n         ,    \n                \n        ,          \n       ,      : \n                 \n           ,      \n              : \n              \n                  \n               \n                 \n                \n              \n                 \n(4)          ,   \n              , \n                   \n                  \n(5)              ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "145", "heading_en": "Procedure.— (1) Proceedings under section 144 may be taken against any person in any district—", "text_en": "(a) where he is; or\n(b) where he or his wife resides; or\n(c) where he last resided with his wife, or as the case may be, with the mother of the illegitimate\nchild; or\n(d) where his father or mother resides.\n(2) All evidence in such proceedings shall be taken in the presence of the person against whom an order\nfor payment of maintenance is proposed to be made, or, when his personal attendance is dispensed with, in\nthe presence of his advocate, and shall be recorded in the manner prescribed for summons-cases:\nProvided  that  if  the  Magistrate  is  satisfied  that  the  person  against  whom  an  order  for  payment  of\nmaintenance is proposed to be made is wilfully avoiding service, or willfully neglecting to attend the Court,\nthe Magistrate may proceed to hear and determine the case ex parte and any order so made may be set aside\nfor good cause shown on an application made within three months from the date thereof subject to such\nterms including terms as to payment of costs to the  opposite party as the Magistrate may think just and\nproper.\n(3) The Court in dealing with applications under section 144 shall have power to make such order as to\ncosts as may be just.", "text_hi": "145. (1)      144       \n     \n()    ;   \n()         ;  \n()    , ,       \n        ;  \n \n(2)     ,     ,   \n         ,     \n               \n        -     : \n            \n         ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "146", "heading_en": "Alteration in allowance.—(1) On proof of a change in the circumstances of any person, receiving,", "text_en": "under section 144 a monthly allowance for the maintenance or interim maintenance, or ordered under the\nsame section to pay a monthly allowance for the maintenance, or interim maintenance, to his wife, child,\nfather  or  mother,  as  the  case  may  be,  the  Magistrate  may  make  such  alteration,  as  he  thinks  fit,  in  the\nallowance for the maintenance or the interim maintenance, as the case may be.\n(2) Where it appears to the Magistrate that in consequence of any decision of a competent Civil Court,\nany order made under section 144 should be cancelled or varied, he shall cancel the order or, as the case\nmay be, vary the same accordingly.\n(3) Where any order has been made under section 144 in favour of a woman who has been divorced\nby, or has obtained a divorce from, her husband, the Magistrate shall, if he is satisfied that—\n(a) the woman has, after the date of such divorce, remarried, cancel such order as from the date of\nher remarriage;\n(b) the woman has been divorced by her husband and that she has received, whether before or after\nthe date of the said order, the whole of the sum which, under any customary or personal law applicable\nto the parties, was payable on such divorce, cancel such order,—\n(i) in the case where such sum was paid before such order, from the date on which such order\nwas made;\n(ii) in any other case, from the date of expiry of the period, if any, for which maintenance has\nbeen actually paid by the husband to the woman;\n(c) the woman has obtained a divorce from her husband and that she had voluntarily surrendered\nher rights to maintenance or interim maintenance, as the case may be, after her divorce, cancel the order\nfrom the date thereof.\n(4) At the time of making any decree for the recovery of any maintenance or dowry by any person, to\nwhom a monthly allowance for the maintenance and interim maintenance or any of them has been ordered\nto be paid under section 144, the Civil Court shall take into account the sum which has been paid to, or\nrecovered by, such person as monthly allowance for the maintenance and interim maintenance or any of\nthem, as the case may be, in pursuance of the said order.", "text_hi": "146. (1)           \n    , ,  , ,     \n              \n            , \n,            \n,      \n(2)          144      \n            \n     , ,       \n       \n(3)   144            \n    -         - \n              \n()    -        \n ,              ;  \n()      -      \n                \n          -   \n     , \n(i)               \n           ; \n(ii)       ,   ,   \n         ,   \n     ;  \n()      -      \n  -   , ,    \n         ,     \n        \n(4)     ,    ,   144\n216   [2 \n       ,         \n            , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "147", "heading_en": "Enforcement of order of maintenance.—A copy of the order of maintenance or interim", "text_en": "maintenance and expenses of proceedings, as the case may be, shall be given without payment to the person\nin  whose  favour  it  is  made,  or  to  his  guardian,  if  any,  or  to  the  person  to  whom  the  allowance  for  the\nmaintenance or the allowance for the interim maintenance and expenses of proceeding, as the case may be,\nis to be paid; and such order may be enforced by any Magistrate in any place where the person against\nwhom  it  is  made  may  be,  on  such  Magistrate  being  satisfied  as  to  the  identity  of  the  parties  and  the\nnon-payment of the allowance, or as the case may be, expenses, due.", "text_hi": "147.  ,         \n   ,   ,           \n,   ,    , , ,      \n               \n         ,    ,  \n     ,          \n, ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "148", "heading_en": "Dispersal of assembly by use of civil force.—(1) Any Executive Magistrate or officer in charge", "text_en": "of a police station or, in the absence of such officer in charge, any police officer, not below the rank of a\nsub-inspector, may command any unlawful assembly, or any assembly of five or more persons likely to\ncause a disturbance of the public peace, to disperse; and it shall thereupon be the duty of the members of\nsuch assembly to disperse accordingly.\n(2)  If,  upon  being  so  commanded,  any  such  assembly  does  not  disperse,  or  if,  without  being  so\ncommanded, it conducts itself in such a manner as to show a determination not to disperse, any Executive\nMagistrate or police officer referred to in sub-section (1), may proceed to disperse such assembly by force,\nand may require the assistance of any person, not being an officer or member of the armed forces and acting\nas such, for the purpose of dispersing such assembly, and, if necessary, arresting and confining the persons\nwho form part of it, in order to disperse such assembly or that they may be punished according to law.", "text_hi": "148. (1)           \n             \n     ,        \n  ,       , -   \n                 \n-     \n(2)          -     \n           ,   -\n       ,   (1)     \n         -    \n                \n      ,    -      \n       ,    ,   \n         -      \n      ,          \n  -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "149", "heading_en": "Use of armed forces to disperse assembly.—(1) If any assembly referred to in sub-section (1) of", "text_en": "section  148  cannot  otherwise  be  dispersed,  and  it  is  necessary  for  the  public  security  that  it  should  be\ndispersed, the District Magistrate or any other Executive Magistrate authorised by him, who is present, may\ncause it to be dispersed by the armed forces.\n(2) Such Magistrate may require any officer in command of any group of persons belonging to the\narmed forces to disperse the assembly with the help of the armed forces under his command, and to arrest\nand confine such persons forming part of it as the Executive Magistrate may direct, or as it may be necessary\nto arrest and confine in order to disperse the assembly or to have them punished according to law.\n(3) Every such officer of the armed forces shall obey such requisition in such manner as he thinks fit,\nbut in so doing he shall use as little force, and do as little injury to person and property, as may be consistent\nwith dispersing the assembly and arresting and detaining such persons.", "text_hi": "149. (1)      \n-                \n-     \n ,   ,     -   \n(2)      ,        \n     ,         \n       -       \n ,          -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "150", "heading_en": "Power of certain armed force officers to disperse assembly.—When the public security is", "text_en": "manifestly endangered by any such assembly and no Executive Magistrate can be communicated with, any\ncommissioned or gazetted officer of the armed forces may disperse such assembly with the help of the\narmed forces under his command, and may arrest and confine any persons forming part of it, in order to\ndisperse such assembly or that they may be punished according to law; but if, while he is acting under this\nsection, it becomes practicable for him to communicate with an Executive Magistrate, he shall do so, and\nshall thenceforward obey the instructions of the Magistrate, as to whether he shall or shall not continue such\naction.", "text_hi": "150.              \n               \n             \n -       ,    ,  \n  -              \n,     ,    ,      \n    ,           \n                  , \n           \n-", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "151", "heading_en": "Protection against prosecution for acts done under sections 148, 149 and 150.—(1) No", "text_en": "prosecution  against  any  person  for  any  act  purporting  to  be  done  under  section  148,  section  149  or\nsection 150 shall be instituted in any Criminal Court except—\n(a) with the sanction of the Central Government where such person is an officer or member of the\narmed forces;\n(b) with the sanction of the State Government in any other case.\n(2) (a) No Executive Magistrate or police officer acting under any of the said sections in good faith;\n(b)  no  person  doing  any  act  in  good  faith  in  compliance  with  a  requisition  under  section  148  or\nsection 149;\n(c) no officer of the armed forces acting under section 150 in good faith;\n(d) no member of the armed forces doing any act in obedience to any order which he was bound to\nobey,\nshall be deemed to have thereby committed an offence.\n(3) In this section and in the preceding sections of this Chapter,—\n(a) the expression “armed forces” means the army, naval and air forces, operating as land forces\nand includes any other armed forces of the Union so operating;\n(b) “officer”, in relation to the armed forces, means a person commissioned, gazetted or in pay as\nan officer of the armed forces and includes a junior commissioned officer, a warrant officer, a petty\nofficer, a non-commissioned officer and a non-gazetted officer;\n(c) “member”, in relation to the armed forces, means a person in the armed forces other than an\nofficer.\nB.—Public nuisances", "text_hi": "151. (1)    ,   148,  149   150   \n   ,          \n \n()           ,  \n          ; \n()             \n   \n(2) ()             \n        ; \n()  148   149        \n        ; \n()  150           \n    ; \n()             \n               , \n: \n(3)           \n()          ,   \n             \n   ; \n()             \n ,             148,  \n149  \n150\n218   [2 \n ,  ,  , -   \n    ; \n()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "152", "heading_en": "Conditional order for removal of nuisance.—(1) Whenever a District Magistrate or a", "text_en": "Sub-divisional Magistrate or  any  other  Executive  Magistrate specially  empowered  in this  behalf  by  the\nState  Government,  on  receiving  the  report  of  a  police  officer  or  other  information  and  on  taking  such\nevidence (if any) as he thinks fit, considers—\n(a) that any unlawful obstruction or nuisance should be removed from any public place or from any\nway, river or channel which is or may be lawfully used by the public; or\n(b) that the conduct of any trade or occupation, or the keeping of any goods or merchandise, is\ninjurious to the health or physical comfort of the community, and that in consequence such trade or\noccupation should be prohibited or regulated or such goods or merchandise should be removed or the\nkeeping thereof regulated; or\n(c) that the construction of any building, or, the disposal of any substance, as is likely to occasion\nconflagration or explosion, should be prevented or stopped; or\n(d) that any building, tent or structure, or any tree is in such a condition that it is likely to fall and\nthereby cause injury to persons living or carrying on business in the neighbourhood or passing by, and\nthat in consequence the removal, repair or support of such building, tent or structure, or the removal or\nsupport of such tree, is necessary; or\n(e) that any tank, well or excavation adjacent to any such way or public place should be fenced in\nsuch manner as to prevent danger arising to the public; or\n(f) that any dangerous animal should be destroyed, confined or otherwise disposed of,\nsuch Magistrate may make a conditional order requiring the person causing such obstruction or nuisance,\nor carrying on such trade or occupation, or keeping any such goods or merchandise, or owning, possessing\nor controlling such building, tent, structure, substance, tank, well or excavation, or owning or possessing\nsuch animal or tree, within a time to be fixed in the order—\n(i) to remove such obstruction or nuisance; or\n(ii) to desist from carrying on, or to remove or regulate in such manner as may be directed, such\ntrade or occupation, or to remove such goods or merchandise, or to regulate the keeping thereof in such\nmanner as may be directed; or\n(iii)  to  prevent  or  stop  the  construction  of  such  building,  or  to  alter  the  disposal  of  such\nsubstance; or\n(iv)  to  remove,  repair  or  support  such  building,  tent  or  structure,  or  to  remove  or  support  such\ntrees; or\n(v) to fence such tank, well or excavation; or\n(vi) to destroy, confine or dispose of such dangerous animal in the manner provided in the said\norder, or, if he objects so to do, to appear before himself or some other Executive Magistrate subordinate\nto him at a time and place to be fixed by the order, and show cause, in the manner hereinafter provided,\nwhy the order should not be made absolute.\n(2) No order duly made by a Magistrate under this section shall be called in question in any Civil Court.\nExplanation.—A “public place” includes also property belonging to the State, camping grounds and\ngrounds left unoccupied for sanitary or recreative purposes.", "text_hi": "152. (1)            \n            \n           (  )  \n,    ,     \n()      ,    ,   \n          ,    \n     ;  \n()             \n              \n            \n              \n ;   \n()         ,    \n     ,         ;   \n()  , ,             \n                \n    ,    ,     \n,        ,      \n      ; \n()          ,   \n                \n    ;   \n()     ,      \n  , \n               \n              , , \n, , ,            \n                \n         ,       \n,   \n(i)        ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "153", "heading_en": "Service or notification of order.—(1) The order shall, if practicable, be served on the person", "text_en": "against whom it is made, in the manner herein provided for service of summons.\n(2) If such order cannot be so served, it shall be notified by proclamation published in such manner as\nthe State Government may, by rules, direct, and a copy thereof shall be stuck up at such place or places as\nmay be fittest for conveying the information to such person.", "text_hi": "153. (1)      ,      , \n   ,     ,        \n   \n(2)               \n        ,     \n              ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "154", "heading_en": "Person to whom order is addressed to obey or show cause.—The person against whom such", "text_en": "order is made shall—\n(a) perform, within the time and in the manner specified in the order, the act directed thereby; or\n(b) appear in accordance with such order and show cause against the same;  and such appearance or\nhearing may be permitted through audio-video conferencing.", "text_hi": "154.          \n()              \n     ,   \n()            \n-", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "155", "heading_en": "Penalty for failure to comply with section 154.—If the person against whom an order is made", "text_en": "under section 154 does not perform such act or appear and show cause, he shall be liable to the penalty\nspecified in that behalf in section 223 of the Bharatiya Nyaya Sanhita, 2023, and the order shall be made\nabsolute.", "text_hi": "155.   \n             ,   \n,    22\n220   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "156", "heading_en": "Procedure where existence of public right is denied.— (1) Where an order is made under", "text_en": "section 152 for the purpose of preventing obstruction, nuisance or danger to the public in the use of any\nway, river, channel or place, the Magistrate shall, on the appearance before him of the person against whom\nthe order was made, question him as to whether he denies the existence of any public right in respect of the\nway, river, channel or place, and if he does so, the Magistrate shall, before proceeding under section 157,\ninquire into the matter.\n(2) If in such inquiry the Magistrate finds that there is any reliable evidence in support of such denial,\nhe shall stay the proceedings until the matter of the existence of such right has been decided by a competent\nCourt; and, if he finds that there is no such evidence, he shall proceed as laid down in section 157.\n(3) A person who has, on being questioned by the Magistrate under sub-section (1), failed to deny the\nexistence of a public right of the nature therein referred to, or who, having made such denial, has failed to\nadduce reliable evidence in support thereof, shall not in the subsequent proceedings be permitted to make\nany such denial.", "text_hi": "156. (1)   , ,          \n ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "157", "heading_en": "Procedure where person against whom order is made under section 152 appears to show", "text_en": "cause.—(1) If the person against whom an order under section 152 is made appears and shows cause against\nthe order, the Magistrate shall take evidence in the matter as in a summons-case.\n(2) If the Magistrate is satisfied that the order, either as originally made or subject to such modification\nas he considers necessary, is reasonable and proper, the order shall be made absolute without modification\nor, as the case may be, with such modification.\n(3) If the Magistrate is not so satisfied, no further proceedings shall be taken in the case:\nProvided that the proceedings under this section shall be completed, as soon as possible, within a period\nof ninety days, which may be extended for the reasons to be recorded in writing, to one hundred and twenty\ndays.", "text_hi": "157       \n        \n(2)               \n                \n             \n    ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "158", "heading_en": "Power of Magistrate to direct local investigation and examination of an expert.—The", "text_en": "Magistrate may, for the purposes of an inquiry under section 156 or section 157—\n(a) direct a local investigation to be made by such person as he thinks fit; or\n(b) summon and examine an expert.", "text_hi": "158.   156   157        \n, \n()   ,    ,     \n     ;   \n()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "159", "heading_en": "Power of Magistrate to furnish written instructions, etc.—(1) Where the Magistrate directs a", "text_en": "local investigation by any person under section 158, the Magistrate may—\n(a) furnish such person with such written instructions as may seem necessary for his guidance;\n(b) declare by whom the whole or any part of the necessary expenses of the local investigation shall\nbe paid.\n(2) The report of such person may be read as evidence in the case.\n(3) Where the  Magistrate  summons  and  examines an expert  under  section  158, the  Magistrate  may\ndirect by whom the costs of such summoning and examination shall be paid.", "text_hi": "159. (1)    158       \n       ,   \n()             \n    ;", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "160", "heading_en": "Procedure on order being made absolute and consequences of disobedience.—(1) When an", "text_en": "order has been made absolute under section 155 or section 157, the Magistrate shall give notice of the same\nto the person against whom the order was made, and shall further require him to perform the act directed\nby the order within the time to be fixed in the notice, and inform him that, in case of disobedience, he shall\nbe liable to the penalty provided by section 223 of the Bharatiya Nyaya Sanhita, 2023.\n(2) If such act is not performed within the time fixed, the Magistrate may cause it to be performed, and\nmay recover the costs of performing it, either by the sale of any building, goods or other property removed\nby his order, or by the distress and sale of any other movable property of such person within or  without\nsuch Magistrate's local jurisdiction, and if such other property is without such jurisdiction, the order shall\nauthorise  its  attachment  and  sale  when  endorsed  by  the  Magistrate  within  whose  local  jurisdiction  the\nproperty to be attached is found.\n(3) No suit shall lie in respect of anything done in good faith under this section.", "text_hi": "160. (1)   155   157         \n    ,       ,   \n               \n   ,            \n   ,         \n    \n(2)              \n            ,    \n ,       ,       \n          \n             \n                \n           \n          \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "161", "heading_en": "Injunction pending inquiry.—(1) If a Magistrate making an order under section 152 considers", "text_en": "that immediate measures should be taken to prevent imminent danger or injury of a serious kind to the\npublic, he may issue such an injunction to the person against whom the order was made, as is required to\nobviate or prevent such danger or injury pending the determination of the matter.\n(2) In default of such person forthwith obeying such injunction, the Magistrate may himself use, or\ncause to be used, such means as he thinks fit to obviate such danger or to prevent such injury.\n(3) No suit shall lie in respect of anything done in good faith by a Magistrate under this section.", "text_hi": "161. (1)   152           \n               \n     ,   ,      , \n        ,     ,   \n        \n(2)              \n                \n               \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "162", "heading_en": "Magistrate may prohibit repetition or Continuance of public nuisance.—A District Magistrate", "text_en": "or  Sub-divisional  Magistrate,  or  any  other  Executive  Magistrate  or  Deputy  Commissioner  of  Police\nempowered by the State Government or the District Magistrate in this behalf, may order any person not to\nrepeat or continue a public nuisance, as defined in the Bharatiya Nyaya Sanhita, 2023, or any special or\nlocal law.\nC.—Urgent cases of nuisance or apprehended danger", "text_hi": "162.            \n          \n         ,\n222   [2 \n       -     \n  \n  \n -", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "163", "heading_en": "Power to issue order in urgent cases of nuisance or apprehended danger.— (1) In cases where,", "text_en": "in  the  opinion  of  a  District    Magistrate,  a  Sub-divisional  Magistrate  or  any  other  Executive  Magistrate\nspecially empowered by the State Government in this behalf, there is sufficient ground for proceeding under\nthis section and immediate prevention or speedy remedy is desirable, such Magistrate may, by a written\norder stating the material facts of the case and served in the manner provided by section 153, direct any\nperson to abstain from a certain act or to take certain order with respect to certain property in his possession\nor under his management, if such Magistrate considers that such direction is likely to prevent, or tends to\nprevent, obstruction, annoyance or injury to any person lawfully employed, or danger to human life, health\nor safety or a disturbance of the public tranquillity, or a riot, or an affray.\n(2) An order under this section may, in cases of emergency or in cases where the circumstances do not\nadmit of the serving in due time of a notice upon the person against whom the order is directed, be passed\nex parte.\n(3) An order under this section may be directed to a particular individual, or to persons residing in a\nparticular place or area, or to the public generally when frequenting or visiting a particular place or area.\n(4) No order under this section shall remain in force for more than two months from the making thereof:\nProvided that if the State Government considers it necessary so to do for preventing danger to human\nlife, health or safety or for preventing a riot or any affray, it may, by notification, direct that an order made\nby a Magistrate under this section shall remain in force for such further period not exceeding six months\nfrom the date on which the order made by the Magistrate would have, but for such order, expired, as it may\nspecify in the said notification.\n(5) Any Magistrate may, either on his own motion or on the application of any person aggrieved, rescind\nor  alter  any  order  made  under  this  section  by  himself  or  any  Magistrate  subordinate  to  him  or  by  his\npredecessor-in-office.\n(6) The State Government may, either on its own motion or on the application of any person aggrieved,\nrescind or alter any order made by it under the proviso to sub-section (4).\n(7) Where an application under sub-section (5) or sub-section (6) is received, the Magistrate, or the\nState Government, as the case may be, shall afford to the applicant an early opportunity of appearing before\nhim or it, either in person or by an advocate and showing cause against the order; and if the Magistrate or\nthe State Government, as the case may be, rejects the application wholly or in part, he or it shall record in\nwriting the reasons for so doing.\nD.—Disputes as to immovable property", "text_hi": "163. (1)   ,         \n            \n                \n      ,      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "164", "heading_en": "Procedure where dispute concerning land or water is likely to cause breach of", "text_en": "peace.—(1) Whenever an Executive Magistrate is satisfied from a report of a police officer or upon other\ninformation that a dispute likely to cause a breach of the peace exists concerning any land or water or the\nboundaries thereof, within his local jurisdiction, he shall make an order in writing, stating the grounds of\nhis being so satisfied, and requiring the parties concerned in such dispute to attend his Court in person or\nby an advocate on aspecified date and time, and to put in written statements of their respective claims as\nrespects the fact of actual possession of the subject of dispute.\n(2)  For  the  purposes  of  this  section,  the  expression  “land  or  water”  includes  buildings,  markets,\nfisheries, crops or other produce of land, and the rents or profits of any such property.\n(3)  A  copy  of  the  order  shall  be  served  in  the  manner  provided  by  this  Sanhita  for  the  service  of\nsummons upon such person or persons as the Magistrate may direct, and at least one copy shall be published\nby being affixed to some conspicuous place at or near the subject of dispute.\n(4) The Magistrate shall, without reference to the merits or the claims of any of the parties to a right to\npossess the subject of dispute, peruse the statements so put in, hear the parties, receive all such evidence as\nmay be produced by them, take such further evidence, if any, as he thinks necessary, and, if possible, decide\nwhether any and which of the parties was, at the date of the order made by him under sub-section (1), in\npossession of the subject of dispute:\nProvided  that  if  it  appears  to  the  Magistrate  that  any  party  has  been  forcibly  and  wrongfully\ndispossessed  within  two  months  next  before  the  date  on  which  the  report  of  a  police  officer  or  other\ninformation  was  received  by  the  Magistrate,  or  after  that  date  and  before  the  date  of  his  order  under\nsub-section (1), he may treat the party so dispossessed as if that party had been in possession on the date of\nhis order under sub-section (1).\n(5) Nothing in this section shall preclude any party so required to attend, or any other person interested,\nfrom showing that no such dispute as aforesaid exists or has existed; and in such case the Magistrate shall\ncancel his said order, and all further proceedings thereon shall be stayed, but, subject to such cancellation,\nthe order of the Magistrate under sub-section (1) shall be final.\n(6)  (a)  If  the  Magistrate  decides  that  one  of  the  parties  was,  or  should  under  the  proviso  to\nsub-section (4) be treated as being, in such possession of the said subject of dispute, he shall issue an order\ndeclaring such party to be entitled to possession thereof until evicted therefrom in due course of law, and\nforbidding all disturbance of such possession until such eviction; and when he proceeds under the proviso\nto sub-section (4), may restore to possession the party forcibly and wrongfully dispossessed;\n(b) the order made under this sub-section shall be served and published in the manner laid down in sub-\nsection (3).\n(7) When any party to any such proceeding dies, the Magistrate may cause the legal representative of\nthe deceased party to be made a party to the proceeding and shall thereupon continue the inquiry, and if any\nquestion arises as to who the legal representative of a deceased party for the purposes of such proceeding\nis, all persons claiming to be representatives of the deceased party shall be made parties thereto.\n(8) If the Magistrate is of opinion that any crop or other produce of the property, the subject of dispute\nin a proceeding under this section pending before him, is subject to speedy and natural decay, he may make\nan order for the proper custody or sale of such property, and, upon the completion of the inquiry, shall make\nsuch order for the disposal of such property, or the sale-proceeds thereof, as he thinks fit.\n(9)  The  Magistrate  may,  if  he  thinks  fit,  at  any  stage  of  the  proceedings  under  this  section,  on  the\napplication  of  either  party,  issue  a  summons  to  any  witness  directing  him  to  attend  or  to  produce  any\ndocument or thing.\n(10) Nothing in this section shall be deemed to be in derogation of powers of the Magistrate to proceed\nunder section 126.", "text_hi": "164       \n              ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "242", "heading_en": "Offences of same kind within year may be charged together.— (1) When a person is accused", "text_en": "of more offences than one of the same kind committed within the space of twelve months from the first to\nthe last of such offences, whether in respect of the same person or not, he may be charged with, and tried\nat one trial for, any number of them not  exceeding five.\n(2) Offences are of the same kind when they are punishable with the same amount of punishment under\nthe same section of the Bharatiya Nyaya Sanhita, 2023 or of any special or local law:\nProvided  that  for  the  purposes  of  this  section,  an  offence  punishable  under  sub-section  (2)  of\nsection 303 of the Bharatiya Nyaya Sanhita, 2023 shall be deemed to be an offence of the same kind as an\noffence punishable under section 305 of the said Sanhita, and that an offence punishable under any section\nof the said Sanhita, or of any special or local law, shall be deemed to be an offence of the same kind as an\nattempt to commit such offence, when such an attempt is an offence.", "text_hi": "242          \n : \n                 \n     ,  \n   \n  \n \n           234   235   \n     ,     ,    \n    ,     ,   ,  \n     ,          \n   \n   \n  \n   \n()   -              \n                   \n()                 \n      ,        ,   \n   \n()\n262   [2 \n                \n      \n()                \n                \n               \n()                \n                   \n   \n()                  \n            \n   \n   \n    \n   \n    \n   \n                   \n        ,        \n            \n  \n        ,       , \n                \n            ,    \n                 \n ,       \n   \n()   ,    1      \n            ,    \n    ,          \n                    \n ,         \n()                   \n ,                \n  ,            \n                 \n      \n()", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "244", "heading_en": "Where it is doubtful what offence has been committed.—(1) If a single act or series of acts is", "text_en": "of such a nature that it is doubtful which of several offences the facts which can be proved will constitute,\nthe accused may be charged with having committed all or any of such offences, and any number of such\ncharges may be tried at once; or he may be charged in the alternative with having committed someone of\nthe said offences.\n(2)  If  in  such  a  case  the  accused  is  charged  with  one  offence,  and  it  appears  in  evidence  that  he\ncommitted  a  different  offence  for  which  he  might  have  been  charged  under  the  provisions  of\nsub-section (1), he may be convicted of the offence which he is shown to have committed, although he was\nnot charged with it.\nIllustrations.\n(a) A is accused of an act which may amount to theft, or receiving stolen property, or criminal breach\nof trust or cheating. He may be charged with theft, receiving stolen property, criminal breach of trust and\ncheating, or he may be charged with having committed theft, or receiving stolen property, or criminal breach\nof trust or cheating.\n(b) In the case mentioned, A is only charged with theft. It appears that he committed the offence of\ncriminal breach of trust, or that of receiving stolen goods. He may be convicted of criminal breach of trust\nor of receiving stolen goods (as the case may be), though he was not charged with such offence.\n(c) A states on oath before the Magistrate that he saw B hit C with a club. Before the Sessions Court A\nstates on oath that B never hit C. A may be charged in the alternative and convicted of intentionally giving\nfalse evidence, although it cannot be proved which of these contradictory statements was false.", "text_hi": "244 (1)                 \n   ,      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "245", "heading_en": "When offence proved included in offence charged.—(1) When a person is charged with an", "text_en": "offence consisting of several particulars, a combination of some only of which constitutes a complete minor\noffence, and such combination is proved, but the remaining particulars are not proved, he may be convicted\nof the minor offence, though he was not charged with it.\n(2) When a person is charged with an offence and facts are proved which reduce it to a minor offence,\nhe may be convicted of the minor offence, although he is not charged with it.\n(3)  When  a  person  is charged  with  an  offence,  he  may  be  convicted  of  an  attempt  to  commit  such\noffence although the attempt is not separately charged.\n(4) Nothing in this section shall be deemed to authorise a conviction of any minor offence where the\nconditions requisite for the initiation of proceedings in respect of that minor offence have not been satisfied.\nIllustrations.\n(a)  A  is  charged,  under  sub-section  (3)  of  section  316  of  the  Bharatiya  Nyaya  Sanhita,  2023,  with\ncriminal breach of trust in respect of property entrusted to him as a carrier. It appears, that he did commit\ncriminal breach of trust under sub-section (2) of section 316 of that Sanhita in respect of the property, but\nthat it was not entrusted to him as a carrier. He may be convicted of criminal breach of trust under the said\nsub-section (2) of section 316.\n(b)  A  is  charged,  under  sub-section  (2)  of  section  117  of  the  Bharatiya  Nyaya  Sanhita,  2023,  with\ncausing grievous hurt. He proves that he acted on grave and sudden provocation. He may be convicted\nunder sub-section (2) of section 122 of that Sanhita.", "text_hi": "245. (1)             \n,                 \n                \n               \n(2)               \n                 \n               \n(3)               \n               \n      \n(4)               \n               \n             , \n   \n,  \n  \n   \n     \n \n  ()       ,        , \n -   ,    31\n268   [2", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "248", "heading_en": "Trial to be conducted by Public Prosecutor.—In every trial before a Court of Session, the", "text_en": "prosecution shall be conducted by a Public Prosecutor.", "text_hi": "248.            \n        \n  \n  \n  \n  9   232    \n               \n      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "250", "heading_en": "Discharge.—(1) The accused may prefer an application for discharge within a period of sixty days", "text_en": "from the date of commitment of the case under section 232.\n(2) If, upon consideration of the record of the case and the documents submitted therewith, and after\nhearing the submissions of the accused and the prosecution in this behalf, the Judge considers that there is\nnot  sufficient  ground  for  proceeding  against the  accused,  he  shall  discharge  the  accused and record  his\nreasons for so doing.", "text_hi": "250. (1) , 2\n \n              \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "251", "heading_en": "Framing of charge.—(1) If, after such consideration and hearing as aforesaid, the Judge is of", "text_en": "opinion that there is ground for presuming that the accused has committed an offence which—\n(a) is not exclusively triable by the Court of Session, he may, frame a charge against the accused\nand, by order, transfer the case for trial to the Chief Judicial Magistrate, or any other Judicial Magistrate\nof the first class and direct the accused to appear before the Chief Judicial Magistrate, or the Judicial\nMagistrate of the first class, on such date as he deems fit, and thereupon such Magistrate shall try the\noffence in accordance with the procedure for the trial of warrant-cases instituted on a police report;\n(b) is exclusively triable by the Court, he shall frame in writing a charge against the accused within\na period of sixty days from the date of first hearing on charge.\n(2) Where the Judge frames any charge under clause (b) of sub-section (1), the charge shall be read and\nexplained to the accused present either physically or through audio-video electronic means and the accused\nshall be asked whether he pleads guilty of the offence charged or claims to be tried.", "text_hi": "251. (1)         ,    \n                \n, \n()         ,  \n         ,     \n             \n ,       ,    \n            \n  ,           \n           ;\n270   [2 \n()           \n  \n       \n(2)    (1)   ()       \n,   -  \n             \n     ,     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "252", "heading_en": "Conviction on plea of guilty.—If the accused pleads guilty, the Judge shall record the plea and", "text_en": "may, in his discretion, convict him thereon.", "text_hi": "252.             \n       , ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "253", "heading_en": "Date for prosecution evidence.—If the accused refuses to plead, or does not plead, or claims to", "text_en": "be tried or is not convicted under section 252, the Judge shall fix a date for the examination of witnesses,\nand may, on the application of the prosecution, issue any process for compelling the attendance of any\nwitness or the production of any document or other thing.", "text_hi": "253.             \n           252", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "254", "heading_en": "Evidence for prosecution.— (1) On the date so fixed, the Judge shall proceed to take all such", "text_en": "evidence as may be produced in support of the prosecution:\nProvided that evidence of a witness under this sub-section may be recorded by audio-video electronic\nmeans.\n(2)  The  deposition  of  evidence  of  any  public  servant  may  be  taken  through  audio-video  electronic\nmeans.\n(3) The Judge may, in his discretion, permit the cross-examination of any witness to be deferred until\nany other witness or witnesses have been examined or recall any witness for further cross-examination.", "text_hi": "254. (1)             \n         : \n, -\n \n-\n   \n  () , ,        ,  \n           ,     \n                  \n           ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "346", "heading_en": "Power to postpone or adjourn proceedings.—(1) In every inquiry or trial the proceedings shall", "text_en": "be continued from day-to-day basis until all the witnesses in attendance have been examined, unless the\nCourt  finds  the  adjournment  of  the  same  beyond  the  following  day  to  be  necessary  for  reasons  to  be\nrecorded:\nProvided that when the inquiry or trial relates to an offence under section 64, section 65, section 66,\nsection 67, section 68, section 70 or section 71 of the Bharatiya Nyaya Sanhita, 2023 (45 of 2023) the\ninquiry or trial shall be completed within a period of two months from the date of filing of the chargesheet.\n(2) If the Court, after taking cognizance of an offence, or commencement of trial, finds it necessary or\nadvisable to postpone the commencement of, or adjourn, any inquiry or trial, it may, from time to time, for\nreasons to  be recorded,  postpone  or  adjourn the  same  on such  terms  as  it thinks  fit,  for such  time  as it\nconsiders reasonable, and may by a warrant remand the accused if in custody:\nProvided  that  no  Court  shall  remand  an  accused  person  to  custody  under  this  section  for  a  term\nexceeding fifteen days at a time:\nProvided  further  that  when  witnesses  are  in  attendance,  no  adjournment  or  postponement  shall  be\ngranted, without examining them, except for special reasons to be recorded in writing:\nProvided also that no adjournment shall be granted for the purpose only of enabling the accused person\nto show cause against the sentence proposed to be imposed on him:\nProvided also that—\n(a) no adjournment shall be granted at the request of a party, except where the circumstances are\nbeyond the control of that party;\n(b) where the circumstances are beyond the control of a party, not more than two adjournments\nmay be granted by the Court after hearing the objections of the other party and for the reasons to be\nrecorded in writing;\n(c)  the  fact  that  the  advocate  of  a  party  is  engaged  in  another  Court,  shall  not  be  a  ground  for\nadjournment;\n(d) where a witness is present in Court but a party or his advocate is not present or the party or his\nadvocate though present in Court, is not ready to examine or cross-examine the witness, the Court may,\nif thinks fit, record the statement of the witness and pass such orders as it thinks fit dispensing with the\nexamination-in-chief or cross-examination of the witness, as the case may be.\nExplanation 1.—If sufficient evidence has been obtained to raise a suspicion that the accused may have\ncommitted an offence, and it appears likely that further evidence may be obtained by a remand, this is a\nreasonable cause for a remand.\nExplanation  2.—The  terms  on  which  an  adjournment  or  postponement  may  be  granted  include,  in\nappropriate cases, the payment of costs by the prosecution or the accused.", "text_hi": "346         \n     \n(7)   (1)            \n ,                \n,        ,       \n ,        ,     \n   \n(8)            \n     (1)         \n      ,        \n        \n(9)       218         \n      \n  (1)              \n             ,   \n               \n         \n(2)            \n          \n(3)  44   (3),  (4),  (5),  (6),  \n(7)   (9)    (1)       \n         ,    44   (1) \n              ,  \n      (7)    ,     \n   ,\n348   [2 \n \n \n  \n   \n  \n  (1)          \n           ,    \n  ,     \n(2)             \n            ,   \n      ,    \n(3)   ,  (1)   (2)     \n       ,  , ,      \n               \n               \n     \n \n  \n  \n  \n  (1)    ,       \n        ,       \n ,               \n            ,   \n         \n(2)      ,    21   (2) \n        ,       \n          \n \n  \n   \n   \n  \n       , \n()    ,       ,   \n         ; \n()             \n  ,        ,     \n             \n       \n  \n \n    4,  4,  45   45       \n  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "392", "heading_en": "Judgment.—(1) The judgment in every trial in any Criminal Court of original jurisdiction shall", "text_en": "be pronounced in open Court by the presiding officer immediately after the termination of the trial or at\nsome subsequent time not later than forty-five days of which notice shall be given to the parties or their\nadvocates,—\n(a) by delivering the whole of the judgment; or\n(b) by reading out the whole of the judgment; or\n(c) by reading out the operative part of the judgment and explaining the substance of the judgment\nin a language which is understood by the accused or his advocate.\n(2) Where the judgment is delivered under clause (a) of sub-section (1), the presiding officer shall cause\nit to be taken down in short-hand, sign the transcript and every page thereof as soon as it is made ready, and\nwrite on it the date of the delivery of the judgment in open Court.\n(3)  Where  the  judgment  or  the  operative  part  thereof  is  read  out  under  clause  (b)  or  clause  (c)  of\nsub-section (1), as the case may be, it shall be dated and signed by the presiding officer in open Court, and\nif it is not written with his own hand, every page of the judgment shall be signed by him.\n(4)  Where  the judgment  is  pronounced in the  manner  specified in clause  (c) of sub-section  (1),  the\nwhole judgment or a copy thereof shall be immediately made available for the perusal of the parties or their\nadvocates free of cost:\nProvided that the Court shall, as far as practicable, upload the copy of the judgment on its portal within\na period of seven days from the date of judgment.\n(5) If the accused is in custody, he shall be brought up to hear the judgment pronounced either in person\nor through audio-video electronic means.\n(6) If the accused is not in custody, he shall be required by the Court to attend to hear the judgment\npronounced, except where his personal attendance during the trial has been dispensed with and the sentence\nis one of fine only or he is acquitted:\nProvided that where there are more accused persons than one, and one or more of them do not attend\nthe Court on the date on which the judgment is to be pronounced, the presiding officer may, in order to\navoid undue delay in the disposal of the case, pronounce the judgment notwithstanding their absence.\n(7) No judgment delivered by any Criminal Court shall be deemed to be invalid by reason only of the\nabsence of any party or his advocate on the day or from the place notified for the delivery thereof, or of any\nomission to serve, or defect in serving, on the parties or their advocates, or any of them, the notice of such\nday and place.\n(8)  Nothing  in  this  section  shall  be  construed  to  limit  in  any  way  the  extent  of  the  provisions  of\nsection 511.", "text_hi": "392.(1)            \n            \n   \n,         , \n()     ;  \n()     ;  \n()            \n            \n(2)   (1)   ()      ,   \n               \n           ,    \n         \n  (3)      , ,  (1)   () \n  ()      ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "393", "heading_en": "Language and contents of judgment.—(1) Except as otherwise expressly provided by this", "text_en": "Sanhita, every judgment referred to in section 392,—\n(a) shall be written in the language of the Court;\n(b) shall contain the point or points for determination, the decision thereon and the reasons for the\ndecision;\n(c)  shall  specify  the  offence  (if  any)  of  which,  and  the  section  of  the  Bharatiya  Nyaya\nSanhita, 2023 (45 of 2023) or other law under which, the accused is convicted, and the punishment to\nwhich he is sentenced;\n(d) if it be a judgment of acquittal, shall state the offence of which the accused is acquitted and\ndirect that he be set at liberty.\n(2) When the conviction is under the Bharatiya Nyaya Sanhita, 2023 (45 of 2023) and it is doubtful\nunder which of two sections, or under which of two parts of the same section, of that Sanhita the offence\nfalls, the Court shall distinctly express the same, and pass judgment in the alternative.\n(3)  When  the  conviction  is  for  an  offence  punishable  with  death  or,  in  the  alternative,  with\nimprisonment  for  life or  imprisonment  for  a term  of  years,  the judgment  shall state  the  reasons  for  the\nsentence awarded, and, in the case of sentence of death, the special reasons for such sentence.\n(4) When the conviction is for an offence punishable with imprisonment for a term of one year or more,\nbut the Court imposes a sentence of imprisonment for a term of less than three months, it shall record its\nreasons for awarding such sentence, unless the sentence is one of imprisonment till the rising of the Court\nor unless the case was tried summarily under the provisions of this Sanhita.\n(5) When any person is sentenced to death, the sentence shall direct that he be hanged by the neck till\nhe is dead.\n(6) Every order under section 136 or sub-section (2) of section 157 and every final order made under\nsection 144, section 164 or section 166 shall contain the point or points for determination, the decision\nthereon and the reasons for the decision.", "text_hi": "393. (1)          ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "394", "heading_en": "Order for notifying address of previously convicted offender.—(1) When any person, having", "text_en": "been convicted by a Court in India of an offence punishable with imprisonment for a term of three years,\nor upwards, is again convicted of any offence punishable with imprisonment for a term of three years or\nupwards by any Court other than that of a Magistrate of the second class, such Court may, if it thinks fit, at\nthe time of passing a sentence of imprisonment on such person, also order that his residence and any change\nof, or absence from, such residence after release be notified as hereinafter provided for a term not exceeding\nfive years from the date of the expiration of such sentence.\n(2) The provisions of sub-section (1) shall also apply to criminal conspiracies to commit such offences\nand to the abetment of such offences and attempts to commit them.\n(3) If such conviction is set aside on appeal or otherwise, such order shall become void.\n(4) An order under this section may also be made by an Appellate Court or by the High Court or Court\nof Session when exercising its powers of revision.\n(5) The State Government may, by notification, make rules to carry out the provisions of this section\nrelating to the notification of residence or change of, or absence from, residence by released convicts.\n(6) Such rules may provide for punishment for the breach thereof and any person charged with a breach\nof any such rule may be tried by a Magistrate of competent jurisdiction in the district in which the place\nlast notified by him as his place of residence is situated.", "text_hi": "394   (1)    \n          \n,  ,\n  ,  \n       \n   \n      \n  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "395", "heading_en": "Order to pay compensation.—(1) When a Court imposes a sentence of fine or a sentence", "text_en": "(including a sentence of death) of which fine forms a part, the Court may, when passing judgment, order\nthe whole or any part of the fine recovered to be applied—\n(a) in defraying the expenses properly incurred in the prosecution;\n(b) in the payment to any person of compensation for any loss or injury caused by the offence,\nwhen compensation is, in the opinion of the Court, recoverable by such person in a Civil Court;\n(c) when any person is convicted of any offence for having caused the death of another person or\nof having abetted the commission of such an offence, in paying compensation to the persons who are,\nunder  the  Fatal  Accidents  Act,  1855  (13  of  1855),  entitled  to  recover  damages  from  the  person\nsentenced for the loss resulting to them from such death;\n(d) when any person is convicted of any offence which includes theft, criminal misappropriation,\ncriminal  breach  of  trust,  or  cheating,  or  of  having  dishonestly  received  or  retained,  or  of  having\nvoluntarily assisted in disposing of, stolen property knowing or having reason to believe the same to be\nstolen,  in  compensating  any  bona  fide  purchaser  of  such  property  for  the  loss  of  the  same  if  such\nproperty is restored to the possession of the person entitled thereto.\n(2) If the fine is imposed in a case which is subject to appeal, no such payment shall be made before\nthe period allowed for presenting the appeal has elapsed, or, if an appeal be presented, before the decision\nof the appeal.\n(3) When a Court imposes a sentence, of which fine does not form a part, the Court may, when passing\njudgment, order the accused person to pay, by way of compensation, such amount as may be specified in\nthe order to the person who has suffered any loss or injury by reason of the act for which the accused person\nhas been so sentenced.\n(4) An order under this section may also be made by an Appellate Court or by the High Court or Court\nof Session when exercising its powers of revision.\n(5) At the time of awarding compensation in any subsequent civil suit relating to the same matter, the\nCourt shall take into account any sum paid or recovered as compensation under this section.", "text_hi": "395    \n    \n(2)  ,       ,   (1)  \n ()                \n                \n    ,     \n(3)  ,    (1)   ()     \n       -         \n              \n :", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "419", "heading_en": "Appeal in case of acquittal.—(1) Save as otherwise provided in sub-section (2), and subject", "text_en": "to the provisions of sub-sections (3) and (5),—\n(a) the District Magistrate may, in any case, direct the Public Prosecutor to present an appeal to the\nCourt of Session from an order of acquittal passed by a Magistrate in respect of a cognizable and non-\nbailable offence;\n(b) the State Government may, in any case, direct the Public Prosecutor to present an appeal to the\nHigh Court from an original or appellate order of acquittal passed by any Court other than a High Court\nnot being an order under clause (a) or an order of acquittal passed by the Court of Session in revision.\n(2) If such an order of acquittal is passed in a case in which the offence has been investigated by any\nagency empowered to make investigation into an offence under any Central Act other than this Sanhita, the\nCentral Government may, subject to the provisions of sub-section (3), also direct the Public Prosecutor to\npresent an appeal—\n(a)  to  the  Court  of  Session,  from  an  order  of  acquittal  passed  by  a  Magistrate  in  respect  of  a\ncognizable and non-bailable offence;\n(b) to the High Court from an original or appellate order of an acquittal passed by any Court other\nthan a High Court not being an order under clause (a) or an order of acquittal passed by the Court of\nSession in revision.\n(3) No appeal to the High Court under sub-section (1) or sub-section (2) shall be entertained except\nwith the leave of the High Court.\n(4) If such an order of acquittal is passed in any case instituted upon complaint and the High Court, on\nan application made to it by the complainant in this behalf, grants special leave to appeal from the order of\nacquittal, the complainant may present such an appeal to the High Court.\n(5)  No  application  under  sub-section  (4)  for  the  grant  of  special  leave  to  appeal  from  an  order  of\nacquittal shall be entertained by the High Court after the expiry of six months, where the complainant is a\npublic servant, and sixty days in every other case, computed from the date of that order of acquittal.\n(6) If, in any case, the application under sub-section (4) for the grant of special leave to appeal from an\norder of acquittal is refused, no appeal from that order of acquittal shall lie under sub-section (1) or under\nsub-section (2).", "text_hi": "419               \n,               \n        , , \n()             \n         , ,  \n       ,       \n       ; \n()    , \n(i)           \n           \n           \n       ;  \n(ii)          ;  \n(iii)            \n         ,   \n         ; \n()       , \n(i)           \n             \n        ;  \n(ii)          ;  \n(iii)       ,     \n            \n     ; \n()              \n  ; \n()        ,   \n  ,   : \n                \n           : \n         ,\n340   [2 \n        ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "423", "heading_en": "Petition of appeal.—Every appeal shall be made in the form of a petition in writing presented by", "text_en": "the  appellant  or  his  advocate,  and  every  such  petition  shall  (unless  the  Court  to  which  it  is  presented\notherwise directs) be accompanied by a copy of the judgment or order appealed against.", "text_hi": "423           \n          ,  434     \n  ,               \n               \n      \n  \n   \n  \n   \n  (1)             \n    ,       ,  \n(i)      ; \n(ii)   ,        ; \n(iii)            \n   ,    ; \n(iv)    418   419        \n   ,        \n     \n(2)       ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "429", "heading_en": "Order of High Court on appeal to be certified to lower Court.—(1) Whenever a case is decided", "text_en": "on appeal by the High Court under this Chapter, it shall certify its judgment or order to the Court by which\nthe finding, sentence or order appealed against was recorded or passed and if such Court is that of a Judicial\nMagistrate other than the Chief Judicial Magistrate, the High Court's judgment or order shall be sent through\nthe  Chief  Judicial  Magistrate,  and  if  such  Court  is  that  of  an  Executive  Magistrate,  the  High  Court's\njudgment or order shall be sent through the District Magistrate.\n(2) The Court to which the High Court certifies its judgment or order shall thereupon make such orders\nas are conformable to the judgment or order of the High Court; and if necessary, the record shall be amended\nin accordance therewith.", "text_hi": "429      \n        ,    \n,           ,    \n,             ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "433", "heading_en": "Procedure where Judges of Court of appeal are equally divided.—When an appeal under this", "text_en": "", "text_hi": "433  \n           \n  \n              \n                \n        ,   \n     \n                \n   \n  \n  \n \n   \n   \n               \n              :\n334   [2 \n              \n     \n  \n   \n   \n  \n   \n   \n   \n   \n   \n    , \n(i)             \n 136      ;   \n(ii)   140           \n       , \n          : \n              \n      141   (2)   (4)  \n         \n  \n  (1)         \n            ,  \n      \n(2)             \n              \n,                \n              \n    \n(3)  (2)      ,  , \n()            \n    ;   \n()   364       ;  \n()        401     \n       , \n         \n  , ,  , \n, \n   \n   \n  \n   \n , \n     415       ,       \n   ,          , \n(i)        ,     \n ;  \n(ii)            \n      ,          \n  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "438", "heading_en": "Calling for records to exercise powers of revision.—(1) The High Court or any Sessions Judge", "text_en": "may call for and examine the record of any proceeding before any inferior Criminal Court situate within its\nor  his  local  jurisdiction  for  the  purpose  of  satisfying  itself  or  himself  as  to  the  correctness,  legality  or\npropriety of any finding, sentence or order, recorded or passed, and as to the regularity of any proceedings\nof such inferior Court, and may, when calling, for such record, direct that the execution of any sentence or\norder be suspended, and if the accused is in confinement that he be released on his own bond or bail bond\npending the examination of the record.\nExplanation.—All  Magistrates,  whether  Executive  or  Judicial,  and  whether  exercising  original  or\nappellate jurisdiction, shall be deemed to be inferior to the Sessions Judge for the purposes of this sub-\nsection and of section 439.\n(2)  The  powers  of  revision  conferred  by  sub-section  (1)  shall  not  be  exercised  in  relation  to  any\ninterlocutory order passed in any appeal, inquiry, trial or other proceeding.\n(3) If an application under this section has been made by any person either to the High Court or to the\nSessions Judge, no further application by the same person shall be entertained by the other of them.", "text_hi": "438         \n   ,         ,  \n  ,   226   227     (4)     \n  ,          ,    \n  ,             \n              \n           : \n        ,     \n ,                \n            ,\n344   [2 \n \n  \n  \n  (1)            \n  ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "439", "heading_en": "Power to order inquiry.—On examining any record under section 438 or otherwise, the High", "text_en": "Court or the Sessions Judge may direct the Chief Judicial Magistrate by himself or by any of the Magistrates\nsubordinate to him to make, and the Chief Judicial Magistrate may himself make or direct any subordinate\nMagistrate to make, further inquiry into any complaint which has been dismissed under section 226 or sub-\nsection (4) of section 227, or into the case of any person accused of an offence who has been discharged:\nProvided that  no  Court  shall  make  any  direction  under  this section  for inquiry  into the case  of any\nperson who has been discharged unless such person has had an opportunity of showing cause why such\ndirection should not be made.", "text_hi": "439            \n(2)  (1)         , , \n            \n  \n(3)", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "442", "heading_en": "High Court's powers of revision.—(1) In the case of any proceeding the record of which has", "text_en": "been called for by itself or which otherwise comes to its knowledge, the High Court may, in its discretion,\nexercise any of the powers conferred on a Court of Appeal by sections 427, 430, 431 and 432 or on a Court\nof Session by section 344, and, when the Judges composing the Court of revision are equally divided in\nopinion, the case shall be disposed of in the manner provided by section 433.\n(2) No order under this section shall be made to the prejudice of the accused or other person unless he\nhas had an opportunity of being heard either personally or by advocate in his own defence.\n(3) Nothing in this section shall be deemed to authorise a High Court to convert a finding of acquittal\ninto one of conviction.\n(4) Where under this Sanhita an appeal lies and no appeal is brought, no proceeding by way of revision\nshall be entertained at the instance of the party who could have appealed.\n(5) Where under this Sanhita an appeal lies but an application for revision has been made to the High\nCourt by any person and the High Court is satisfied that such application was made under the erroneous\nbelief that no appeal lies thereto and that it is necessary in the interests of justice so to do, the High Court\nmay treat the application for revision as a petition of appeal and deal with the same accordingly.", "text_hi": "442   (1)         \n(2)             \n(1)         442   (2),  (3),  \n(4)   (5)  ,    ,       \n               \n       \n(3)              \n               \n              \n             \n    \n  \n  \n           ,    \n              \n,               \n      \n  \n   \n  (1)      ,      \n        ,   427,  430,  \n431   432       344     \n             , \n     ,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
{"act_id": "BNSS", "section_number": "503", "heading_en": "Procedure by police upon seizure of property.—(1) Whenever the seizure of property by any", "text_en": "police  officer  is reported  to  a  Magistrate  under the  provisions  of this  Sanhita,  and  such  property  is  not\nproduced before a Criminal Court during an inquiry or trial, the Magistrate may make such order as he\nthinks fit respecting the disposal of such property or the delivery of such property to the person entitled to\nthe possession thereof, or if such person cannot be ascertained, respecting the custody and production of\nsuch property.\n(2) If the person so entitled is known, the Magistrate may order the property to be delivered to him on\nsuch conditions (if any) as the Magistrate thinks fit and if such person is unknown, the Magistrate may\ndetain it and shall, in such case, issue a proclamation specifying the articles of which such property consists,\nand requiring any person who may have a claim thereto, to appear before him and establish his claim within\nsix months from the date of such proclamation.", "text_hi": "503   \n,    ,           \n,", "source_hi": "data\\processed\\pdf\\bnss_2023_hi_pypdf.txt"}
