{"act_id": "BSA-2023", "section_number": "1", "heading_en": "Short title, application and commencement.", "text_en": "(1) This Act may be called the Bharatiya Sakshya\nAdhiniyam, 2023.\n(2) It applies to all judicial proceedings in or before any Court, including Courts-martial, but not to\naffidavits presented to any Court or officer, nor to proceedings before an arbitrator.\n(3)  It  shall  come  into  force  on  such  date1  as  the  Central  Government  may,  by  notification  in  the\nOfficial Gazette, appoint.", "text_hi": "1\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "2", "heading_en": "Definitions.— (1) In this Adhiniyam, unless the context otherwise requires,—", "text_en": "(a)  “Court”  includes  all  Judges  and  Magistrates,  and  all  persons,  except  arbitrators,  legally\nauthorised to take evidence;\n(b) “conclusive proof” means when one fact is declared by this Adhiniyam to be conclusive proof\nof another, the Court shall, on proof of the one fact, regard the other as proved, and shall not allow\nevidence to be given for the purpose of disproving it;\n(c)  “disproved”  in  relation  to  a  fact,  means  when,  after  considering  the  matters  before  it,  the\nCourt either believes that it does not exist, or considers its non-existence so probable that a prudent\nman ought, under the circumstances of the particular case, to act upon the supposition that it does not\nexist;\n(d)  “document”  means  any  matter  expressed  or  described  or  otherwise  recorded  upon  any\nsubstance  by  means  of  letters,  figures  or  marks  or  any  other  means  or  by  more  than  one  of  those\nmeans,  intended  to  be  used,  or  which  may  be  used,  for  the  purpose  of  recording  that  matter  and\nincludes electronic and digital records.\nIllustrations.\n(i) A writing is a document.\n(ii) Words printed, lithographed or photographed are documents.\n(iii) A map or plan is a document.\n(iv) An inscription on a metal plate or stone is a document.\n(v) A caricature is a document.\n(vi) An electronic record on emails, server logs, documents on computers, laptop or smartphone,\nmessages,  websites,  locational  evidence  and  voice  mail  messages  stored  on  digital  devices  are\ndocuments;\n(e) “evidence” means and includes—", "text_hi": "2  \n\n,\n\n; \n\n,\n\n, \n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "3", "heading_en": "Evidence may be given of facts in issue and relevant facts.— Evidence may be given in any suit", "text_en": "or  proceeding  of  the  existence  or  non-existence  of  every  fact  in  issue  and  of  such  other  facts  as  are\nhereinafter declared to be relevant, and of no others.\nExplanation.—This  section  shall  not  enable  any  person  to  give  evidence  of  a  fact  which  he  is\ndisentitled to prove by any provision of the law for the time being in force relating to civil procedure.\n(a) A is tried for the murder of B by beating him with a club with the intention of causing his death.\nIllustrations.\nAt A’s trial the following facts are in issue:—\nA’s beating B with the club;\nA’s causing B’s death by such beating;\nA’s intention to cause B’s death.\n(b) A suitor does not bring with him, and have in readiness for production at the first hearing of the\ncase,  a  bond  on  which  he  relies.  This  section  does  not  enable  him  to  produce  the  bond  or  prove  its\ncontents  at  a  subsequent  stage  of  the  proceedings,  otherwise  than  in  accordance  with  the  conditions\nprescribed by the Code of Civil Procedure, 1908 (5 of 1908).", "text_hi": "3. \n\n,\n\n(\n\n)", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "4", "heading_en": "Relevancy of facts forming part of same transaction.—Facts which, though not in issue, are so", "text_en": "connected  with  a  fact  in  issue  or  a  relevant  fact  as  to  form  part  of  the  same  transaction,  are  relevant,\nwhether they occurred at the same time and place or at different times and places.\nClosely connected facts\nIllustrations.\n(a) A is accused of the murder of B by beating him. Whatever was said or done by A or B or the\nbystanders at the beating, or so shortly before or after it as to form part of the  transaction, is a relevant\nfact.\n(b)  A  is  accused  of  waging  war  against  the  Government  of  India  by  taking  part  in  an  armed\ninsurrection in which property is destroyed, troops are attacked and jails are broken open. The occurrence\nof these facts is relevant, as forming part of the general transaction, though A may not have been present\nat all of them.\n(c) A sues B for a libel contained in a letter forming part of a correspondence. Letters between the\nparties  relating  to  the  subject  out  of  which  the  libel  arose,  and  forming  part  of  the  correspondence  in\nwhich it is contained, are relevant facts, though they do not contain the libel itself.\n(d)  The  question  is,  whether  certain  goods  ordered  from  B  were  delivered  to  A.  The  goods  were\ndelivered to several intermediate persons successively. Each delivery is a relevant fact.", "text_hi": "4. \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "5", "heading_en": "Facts which are occasion, cause or effect of facts in issue or relevant facts.— Facts which are", "text_en": "the  occasion,  cause  or  effect,  immediate  or  otherwise,  of  relevant  facts,  or  facts  in  issue,  or  which\nconstitute  the  state  of  things  under  which  they  happened,  or  which  afforded  an  opportunity  for  their\noccurrence or transaction, are relevant.\nIllustrations.\n(a) The question is, whether A robbed B. The facts that, shortly before the robbery, B went to a fair\nwith money in his possession, and that he showed it, or mentioned the fact that he had it, to third persons,\nare relevant.\n(b) The question is, whether A murdered B. Marks on the ground, produced by a struggle at or near\nthe place where the murder was committed, are relevant facts.\n(c) The question is, whether A poisoned B. The state of B's health before the symptoms ascribed to\npoison, and habits of B, known to A, which afforded an opportunity for the administration of poison, are\nrelevant facts.", "text_hi": "5. \n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "6", "heading_en": "Motive, preparation and previous or subsequent conduct.—(1) Any fact is relevant which", "text_en": "shows or constitutes a motive or preparation for any fact in issue or relevant fact.\n(2) The conduct of any party, or of any agent to any party, to any suit or proceeding, in reference to\nsuch suit or proceeding, or in reference to any fact in issue therein or relevant thereto, and the conduct of\nany  person,  an  offence  against  whom  is  the  subject  of  any  proceeding,  is  relevant,  if  such  conduct\ninfluences or is influenced by any fact in issue or relevant fact, and whether it was previous or subsequent\nthereto.\nExplanation  1.—The  word  “conduct”  in  this  section  does  not  include  statements,  unless  those\nstatements  accompany  and  explain  acts  other  than  statements;  but  this  explanation  is  not  to  affect  the\nrelevancy of statements under any other section of this Adhiniyam.\nExplanation  2.—When  the  conduct  of  any  person is relevant,  any  statement  made  to him  or  in his\npresence and hearing, which affects such conduct, is relevant.\nIllustrations.\n(a) A is tried for the murder of B. The facts that A murdered C, that B knew that A had murdered C,\nand that B had tried to extort money from A by threatening to make his knowledge public, are relevant.\n(b) A sues B upon a bond for the payment of money. B denies the making of the bond. The fact that,\nat the time when the bond was alleged to be made, B required money for a particular purpose, is relevant.\n(c) A is tried for the murder of B by poison. The fact that, before the death of B, A procured poison\nsimilar to that which was administered to B, is relevant.\n(d) The question is, whether a certain document is the will of A. The facts that, not long before, the\ndate of the alleged will, A made inquiry into matters to which the provisions of the alleged will relate;\nthat he consulted advocates in reference to making the will, and that he caused drafts of other wills to be\nprepared, of which he did not approve, are relevant.\n(e) A is accused of a crime. The facts that, either before, or at the time of, or after the alleged crime,\nA  provided  evidence  which  would  tend  to  give  to  the  facts  of  the  case  an  appearance  favourable  to\nhimself, or that he destroyed or concealed evidence, or prevented the presence or procured the absence of\npersons  who  might  have  been  witnesses,  or  suborned  persons  to  give  false  evidence  respecting  it,  are\nrelevant.\n(f) The question is, whether A robbed B. The facts that, after B was robbed, C said in A's presence—\n“the  police  are  coming  to  look  for  the  person  who  robbed  B”,  and  that  immediately  afterwards  A  ran\naway, are relevant.\n(g) The  question is,  whether  A  owes  B  ten thousand  rupees. The  facts that  A asked  C  to  lend  him\nmoney, and that D said to C in A's presence and hearing—“I advise you not to trust A, for he owes B ten\nthousand rupees”, and that A went away without making any answer, are relevant facts.\n(h) The question is, whether A committed a crime. The fact that A absconded, after receiving a letter,\nwarning A that inquiry was being made for the criminal, and the contents of the letter, are relevant.\n(i) A is accused of a crime. The facts that, after the commission of the alleged crime, A absconded, or\nwas in possession of property or the proceeds of property acquired by the crime, or attempted to conceal\nthings which were or might have been used in committing it, are relevant.\n(j)  The  question  is,  whether  A  was  raped.  The  fact  that,  shortly  after  the  alleged  rape,  A  made  a\ncomplaint relating  to  the  crime,  the  circumstances  under  which,  and  the terms  in  which, the  complaint\nwas made, are relevant. The fact that, without making a complaint, A said that A had been raped is not\nrelevant as conduct under this section, though it may be relevant as a dying declaration under clause (a)\nof section 26, or as corroborative evidence under section 160.\n(k) The question is, whether A was robbed. The fact that, soon after the alleged robbery, A made a\ncomplaint relating to the offence, the circumstances under which, and the terms in which, the complaint\nwas made, are relevant. The fact that A said he had been robbed, without making any complaint, is not\nrelevant, as conduct under this section, though it may be relevant as a dying declaration under clause (a)\nof section 26, or as corroborative evidence under section 160.", "text_hi": "6.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "7", "heading_en": "Facts necessary to explain or introduce fact in issue or relevant facts.—Facts necessary to", "text_en": "explain or introduce a fact in issue or relevant fact, or which support or rebut an inference suggested by a\nfact in issue or a relevant fact, or which establish the identity of anything, or person whose identity, is\nrelevant, or fix the time or place at which any fact in issue or relevant fact happened, or which show the\nrelation of parties by whom any such fact was transacted, are relevant in so far as they are necessary for\nthat purpose.\nIllustrations.\n(a) The question is, whether a given document is the will of A. The state of A's property and of his\nfamily at the date of the alleged will may be relevant facts.\n(b) A sues B for a libel imputing disgraceful conduct to A; B affirms that the  matter alleged to be\nlibellous is true. The position and relations of the parties at the time when the libel was published may be\nrelevant facts as introductory to the facts in issue. The particulars of a dispute between A and B about a\nmatter unconnected with the alleged libel are irrelevant, though the fact that there was a dispute may be\nrelevant if it affected the relations between A and B.\n(c) A is accused of a crime. The fact that, soon after the commission of the crime, A absconded from\nhis house, is relevant under section 6, as conduct subsequent to and affected by facts in issue. The fact\nthat, at the time when he left home, A had sudden and urgent business at the place to which he went, is\nrelevant, as tending to explain the fact that he left home suddenly. The details of the business on which he\nleft  are  not  relevant,  except  in  so  far  as  they  are  necessary  to  show  that  the  business  was  sudden  and\nurgent.\n(d) A sues B for inducing C to break a contract of service made by him with A. C, on leaving A's\nservice, says to A—“I am leaving you because B has made me a better offer”. This statement is a relevant\nfact as explanatory of C's conduct, which is relevant as a fact in issue.\n(e) A, accused of theft, is seen to give the stolen property to B, who is seen to give it to A's wife. B\nsays as he delivers it—“A says you are to hide this”. B's statement is relevant as explanatory of a fact\nwhich is part of the transaction.\n(f) A is tried for a riot and is proved to have marched at the head of a mob. The cries of the mob are\nrelevant as explanatory of the nature of the transaction.", "text_hi": "7. \n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,\n\n  (\n\n)\n\n,\n\n,\n\n-\n\n,\n\n-\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "8", "heading_en": "Things said or done by conspirator in reference to common design.—Where there is", "text_en": "reasonable ground to believe that two or more persons have conspired together to commit an offence or\nan  actionable  wrong,  anything  said,  done  or  written  by  any  one  of  such  persons  in  reference  to  their\ncommon  intention,  after  the  time  when  such  intention  was  first  entertained  by  any  one  of  them,  is  a\nrelevant  fact  as  against  each  of  the  persons  believed  to  be  so  conspiring,  as  well  for  the  purpose  of\nproving the existence of the conspiracy as for the purpose of showing that any such person was a party to\nit.\nIllustration.\nReasonable  ground  exists  for  believing  that  A  has  joined  in  a  conspiracy  to  wage  war  against  the\nState.\nThe  facts that  B  procured arms  in  Europe  for the  purpose of the  conspiracy,  C collected  money  in\nKolkata for a like object, D persuaded persons to join the conspiracy in Mumbai, E published writings\nadvocating the object in view at Agra, and F transmitted from Delhi to G at Singapore the money which\nC had collected at Kolkata, and the contents of a letter written by H giving an account of the conspiracy,\nare  each  relevant,  both  to  prove  the  existence  of  the  conspiracy,  and  to  prove  A's  complicity  in  it,\nalthough he may have been ignorant of all of them, and although the persons by whom they were done\nwere strangers to him, and although they may have taken place before he joined the conspiracy or after he\nleft it.", "text_hi": "8. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n-\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "9", "heading_en": "When facts not otherwise relevant become relevant.—Facts not otherwise relevant are", "text_en": "relevant—\n(1) if they are inconsistent with any fact in issue or relevant fact;\n(2) if by themselves or in connection with other facts they make the existence or non-existence of\nany fact in issue or relevant fact highly probable or improbable.\nIllustrations.\n(a) The question is, whether A committed a crime at Chennai on a certain day. The fact that, on that\nday, A was at Ladakh is relevant. The fact that, near the time when the crime was committed, A was at a\ndistance from  the  place  where  it  was  committed,  which  would  render it  highly improbable, though  not\nimpossible, that he committed it, is relevant.\n(b) The question is, whether A committed a crime. The circumstances are such that the crime must\nhave  been  committed  either  by  A,  B,  C  or  D.  Every  fact  which  shows  that  the  crime  could  have  been\ncommitted by no one else, and that it was not committed by either B, C or D, is relevant.", "text_hi": "9.  \n\n,\n\n,\n\n(1) \n\n(2)\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n; \n\n,\n\n \n \n \n \n \n \n   \n \n \n \n   \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "10", "heading_en": "Facts tending to enable Court to determine amount are relevant in suits for damages.—In", "text_en": "suits  in  which  damages  are  claimed,  any  fact  which  will  enable  the  Court  to  determine  the  amount  of\ndamages which ought to be awarded, is relevant.", "text_hi": "10. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "11", "heading_en": "Facts relevant when right or custom is in question.—Where the question is as to the existence", "text_en": "of any right or custom, the following facts are relevant—\n(a)  any  transaction  by  which  the  right  or  custom  in  question  was  created,  claimed,  modified,\nrecognised, asserted or denied, or which was inconsistent with its existence;\n(b) particular instances in which the right or custom was claimed, recognised or exercised, or in\nwhich its exercise was disputed, asserted or departed from.\nIllustration.\nThe question is, whether A has a right to a fishery. A deed conferring the fishery on A's ancestors, a\nmortgage of the fishery by A's father, a subsequent grant of the fishery by A's father, irreconcilable with\nthe mortgage, particular instances in which A's father exercised the right, or in which the exercise of the\nright was stopped by A's neighbours, are relevant facts.", "text_hi": "11. \n\n,\n\n,\n\n,\n\n,\n\n; \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "12", "heading_en": "Facts showing existence of state of mind, or of body or bodily feeling.—Facts showing the", "text_en": "existence of any state of mind, such as intention, knowledge, good faith, negligence, rashness, ill-will or\ngoodwill towards any particular person, or showing the existence of any state of body or bodily feeling,\nare relevant, when the existence of any such state of mind or body or bodily feeling is in issue or relevant.\nExplanation 1.—A fact relevant as showing the existence of a relevant state of mind must show that\nthe state of mind exists, not generally, but in reference to the particular matter in question.\nExplanation  2.—But  where,  upon  the  trial  of  a  person  accused  of  an  offence,  the  previous\ncommission  by  the  accused  of  an  offence  is  relevant  within  the  meaning  of  this  section,  the  previous\nconviction of such person shall also be a relevant fact.\nIllustrations.\n(a)  A  is  accused  of  receiving  stolen  goods  knowing  them  to  be  stolen.  It  is  proved  that  he  was  in\npossession  of  a  particular stolen  article. The  fact  that,  at the same  time,  he  was  in  possession  of  many\nother stolen articles is relevant, as tending to show that he knew each and all of the articles of which he\nwas in possession to be stolen.\n(b) A is accused of fraudulently delivering to another person a counterfeit currency which, at the time\nwhen he delivered it, he knew to be counterfeit. The fact that, at the time of its delivery, A was possessed\nof  a  number  of  other  pieces  of  counterfeit  currency  is  relevant.  The  fact  that  A  had  been  previously\nconvicted of delivering to another person as genuine a counterfeit currency knowing it to be counterfeit is\nrelevant.\n(c) A sues B for damage done by a dog of B's, which B knew to be ferocious. The fact that the dog\nhad previously bitten X, Y and Z, and that they had made complaints to B, are relevant.\n(d) The question is, whether A, the acceptor of a bill of exchange, knew that the name of the payee\nwas fictitious. The fact that A had accepted other bills drawn in the same manner before they could have\nbeen transmitted to him by the payee if the payee had been a real person, is relevant, as showing that A\nknew that the payee was a fictitious person.\n(e)  A  is  accused of defaming  B  by  publishing  an  imputation  intended  to  harm  the reputation  of  B.\nThe  fact  of  previous  publications  by  A  respecting  B,  showing  ill-will  on  the  part  of  A  towards  B  is\nrelevant,  as  proving  A's  intention  to  harm  B's  reputation  by  the  particular  publication  in  question.  The\nfacts that there was no previous quarrel between A and B, and that A repeated the matter complained of\nas he heard it, are relevant, as showing that A did not intend to harm the reputation of B.\n(f) A is sued by B for fraudulently representing to B that C was solvent, whereby B, being induced to\ntrust C, who was insolvent, suffered loss. The fact that, at the time when A represented C to be solvent, C\nwas supposed to be solvent by his neighbours and by persons dealing with him, is relevant, as showing\nthat A made the representation in good faith.\n(g) A is sued by B for the price of work done by B, upon a house of which A is owner, by the order\nof C, a contractor. A's defence is that B's contract was with C. The fact that A paid C for the work in\nquestion is relevant, as proving that A did, in good faith, make over to C the management of the work in\nquestion, so that C was in a position to contract with B on C's own account, and not as agent for A.\n(h) A is accused of the dishonest misappropriation of property which he had found, and the question\nis whether, when he appropriated it, he believed in good faith that the real owner could not be found. The\nfact that public notice of the loss of the property had been given in the place where A was, is relevant, as\nshowing that A did not in good faith believe that the real owner of the property could not be found. The\nfact that A knew, or had reason to believe, that the notice was given fraudulently by C, who had heard of\nthe loss of the property and wished to set up a false claim to it, is relevant, as showing that the fact that A\nknew of the notice did not disprove A's good faith.\n(i) A is charged with shooting at B with intent to kill him. In order to show A's intent, the fact of A's\nhaving previously shot at B may be proved.\n(j) A is charged with sending threatening letters to B. Threatening letters previously sent by A to B\nmay be proved, as showing the intention of the letters.\n(k) The question is, whether A has been guilty of cruelty towards B, his wife. Expressions of their\nfeeling towards each other shortly before or after the alleged cruelty are relevant facts.\n(l) The question is, whether A's death was caused by poison. Statements made by A during his illness\nas to his symptoms are relevant facts.\n(m) The question is, what was the state of A's health at the time when an assurance on his life was\neffected. Statements made by A as to the state of his health at or near the time in question are relevant\nfacts.\n(n) A sues B for negligence in providing him with a car for hire not reasonably fit for use, whereby A\nwas injured. The fact that B's attention was drawn on other occasions to the defect of that particular car is\nrelevant. The fact that B was habitually negligent about the cars which he let to hire is irrelevant.\n(o)  A  is  tried  for  the  murder  of  B  by  intentionally  shooting  him  dead.  The  fact  that  A  on  other\noccasions shot at B is relevant as showing his intention to shoot B. The fact that A was in the habit of\nshooting at people with intent to murder them is irrelevant.\n(p)  A  is  tried  for  a  crime.  The  fact  that  he  said  something  indicating  an  intention  to  commit  that\nparticular crime is relevant. The fact that he said something indicating a general disposition to commit\ncrimes of that class is irrelevant.", "text_hi": "12. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "13", "heading_en": "Facts bearing on question whether act was accidental or intentional.—When there is a", "text_en": "question whether an act was accidental or intentional, or done with a particular knowledge or intention,\nthe fact that such act formed part of a series of similar occurrences, in each of which the person doing the\nact was concerned, is relevant.\nIllustrations.\n(a) A is accused of burning down his house in order to obtain money for which it is insured. The facts\nthat A lived in several houses successively each of which he insured, in each of which a fire occurred,\nand after each of which fires A received payment from a different insurance company, are relevant, as\ntending to show that the fires were not accidental.\n(b) A is employed to receive money from the debtors of B. It is A's duty to make entries in a book\nshowing  the  amounts  received  by  him.  He  makes  an  entry  showing  that  on  a  particular  occasion  he\nreceived  less  than  he  really  did  receive.  The  question  is,  whether  this  false  entry  was  accidental  or\nintentional. The facts that other entries made by A in the same book are false, and that the false entry is in\neach case in favour of A, are relevant.\n(c) A is accused of fraudulently delivering to B a counterfeit currency. The question is, whether the\ndelivery  of  the  currency  was  accidental.  The  facts  that,  soon  before  or  soon  after  the  delivery  to  B,  A\ndelivered  counterfeit  currency  to  C,  D  and  E  are  relevant,  as  showing  that  the  delivery  to  B  was  not\naccidental.", "text_hi": "13. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "14", "heading_en": "Existence of course of business when relevant.—When there is a question whether a particular", "text_en": "act was done, the existence of any course of business, according to which it naturally would have been\ndone, is a relevant fact.\nIllustrations.\n(a)  The  question  is,  whether  a  particular  letter  was  dispatched.  The  facts  that  it  was  the  ordinary\ncourse of business for all letters put in a certain place to be carried to the post, and that particular letter\nwas put in that place are relevant.\n(b) The question is, whether a particular letter reached A. The facts that it was posted in due course,\nand was not returned through the Return Letter Office, are relevant.\nAdmissions", "text_hi": "14. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "15", "heading_en": "Admission defined.—An admission is a statement, oral or documentary or contained in", "text_en": "electronic form, which suggests any inference as to any fact in issue or relevant fact, and which is made\nby any of the persons, and under the circumstances, hereinafter mentioned.", "text_hi": "15. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "16", "heading_en": "Admission by party to proceeding or his agent.—(1) Statements made by a party to the", "text_en": "proceeding,  or  by  an agent  to  any  such party,  whom  the  Court regards,  under  the  circumstances  of the\ncase, as expressly or impliedly authorised by him to make them, are admissions.\n(2) Statements made by—\n(i)  parties  to  suits  suing  or  sued  in  a  representative  character,  are  not  admissions,  unless  they\nwere made while the party making them held that character; or\n(ii) (a)  persons  who  have  any  proprietary  or  pecuniary  interest  in  the  subject  matter  of  the\nproceeding, and who make the statement in their character of persons so interested; or\n(b) persons from whom the parties to the suit have derived their interest in the subject matter of\nthe suit,\nare  admissions,  if  they  are  made  during  the  continuance  of  the  interest  of  the  persons  making  the\nstatements.", "text_hi": "16. (1) \n\n,\n\n,\n\n,\n\n,\n\n;   \n\n,\n\n;\n\n,\n\n, \n\n,\n\n,\n\ni\n\n(ii)\n\n)\n\n(\n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "17", "heading_en": "Admissions by persons whose position must be proved as against party to suit.—Statements", "text_en": "made by persons whose position or liability, it is necessary to prove as against any party to the suit, are\nadmissions, if such statements  would be relevant as against such persons in relation to such position or\nliability  in  a  suit  brought  by  or  against  them,  and  if  they  are  made  whilst  the  person  making  them\noccupies such position or is subject to such liability.\nIllustration.\nA undertakes to collect rents for B. B sues A for not collecting rent due from C to B. A denies that\nrent was due from C to B. A statement by C that he owed B rent is an admission, and is a relevant fact as\nagainst A, if A denies that C did owe rent to B.", "text_hi": "17.  \n\n,\n\n,\n\n,\n\n, \n\n,\n\n-\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "18", "heading_en": "Admissions by persons expressly referred to by party to suit.—Statements made by persons to", "text_en": "whom  a  party  to  the  suit  has  expressly  referred  for  information  in  reference  to  a  matter  in  dispute  are\nadmissions.\nThe question is, whether a horse sold by A to B is sound.\nA says to B— “Go and ask C, C knows all about it”. C's statement is an admission.\nIllustration.", "text_hi": "18. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "19", "heading_en": "Proof of admissions against persons making them, and by or on their behalf.—Admissions", "text_en": "are relevant and may be proved as against the person who makes them, or his representative in interest;\nbut  they  cannot  be  proved  by  or  on  behalf  of  the  person  who  makes  them  or  by  his  representative  in\ninterest, except in the following cases, namely:—\n(1)  an  admission  may  be  proved  by  or  on  behalf  of  the  person  making  it,  when  it is  of  such  a\nnature that, if the person making it were dead, it would be relevant as between third persons under\nsection 26;\n(2) an admission may be proved by or on behalf of the person making it, when it consists of a\nstatement of the existence of any state of mind or body, relevant or in issue, made at or about the time\nwhen  such  state  of  mind  or  body  existed,  and  is  accompanied  by  conduct  rendering  its  falsehood\nimprobable;\n(3)  an  admission  may  be  proved  by  or  on  behalf  of  the  person  making  it,  if  it  is  relevant\notherwise than as an admission.\nIllustrations.\n(a) The question between A and B is, whether a certain deed is or is not forged. A affirms that it is\ngenuine, B that it is forged. A may prove a statement by B that the deed is genuine, and  B may prove a\nstatement by A that deed is forged; but A cannot prove a statement by himself that the deed is genuine,\nnor can B prove a statement by himself that the deed is forged.\n(b) A, the captain of a ship, is tried for casting her away. Evidence is given to show that the ship was\ntaken  out  of  her  proper  course.  A  produces  a  book  kept  by  him  in  the  ordinary  course  of  his  business\nshowing observations alleged to have been taken by him from day to day, and indicating that the ship was\nnot  taken  out  of  her  proper  course.  A  may  prove  these  statements,  because  they  would  be  admissible\nbetween third parties, if he were dead, under clause (b) of section 26.\n(c) A is accused of a crime committed by him at Kolkata. He produces a letter written by himself and\ndated at Chennai on that day, and bearing the Chennai post-mark of that day. The statement in the date of\nthe letter is admissible, because, if A were dead, it would be admissible under clause (b) of section 26.\n(d)  A  is  accused  of  receiving  stolen  goods  knowing  them  to  be  stolen.  He  offers  to  prove  that  he\nrefused  to  sell  them  below  their  value.  A  may  prove  these  statements,  though  they  are  admissions,\nbecause they are explanatory of conduct influenced by facts in issue.\n(e) A is accused of fraudulently having in his possession counterfeit currency which he knew to be\ncounterfeit.  He  offers  to  prove  that  he  asked  a  skilful  person  to  examine  the  currency  as  he  doubted\nwhether  it  was  counterfeit  or  not,  and  that  person  did  examine  it  and  told  him  it  was  genuine.  A  may\nprove these facts.", "text_hi": "19. \n\n, \n\n, \n\n :    \n\n(1)\n\n,\n\n(2)\n\n(3)\n\n,\n\n,\n\n,\n\n,\n\n,\n\n-\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "20", "heading_en": "When oral admissions as to contents of documents are relevant.—Oral admissions as to the", "text_en": "contents of a document are not relevant, unless and until the party proposing to prove them shows that he\nis  entitled  to  give  secondary  evidence  of  the  contents  of  such  document  under  the  rules  hereinafter\ncontained, or unless the genuineness of a document produced is in question.", "text_hi": "20. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "21", "heading_en": "Admissions in civil cases when relevant.—In civil cases no admission is relevant, if it is made", "text_en": "either upon an express condition that evidence of it is not to be given, or under circumstances from which\nthe Court can infer that the parties agreed together that evidence of it should not be given.\nExplanation.—Nothing in this section shall be taken to exempt any advocate from giving evidence of\nany matter of which he may be compelled to give evidence under sub-sections (1) and (2) of section 132.", "text_hi": "21 \n\n, \n\n, \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "22", "heading_en": "Confession caused by inducement, threat, coercion or promise, when irrelevant in criminal", "text_en": "proceeding.—A  confession  made  by  an  accused  person  is  irrelevant  in  a  criminal  proceeding,  if  the\nmaking of the confession appears to the Court to have been caused by any inducement, threat, coercion or\npromise having reference to the charge against the accused person, proceeding from a person in authority\nand sufficient, in the opinion of the Court, to give the accused person grounds which would appear to him\nreasonable for supposing that by making it he would gain any advantage or avoid any evil of a temporal\nnature in reference to the proceedings against him:\nProvided that if the confession is made after the impression caused by any such inducement, threat,\ncoercion or promise has, in the opinion of the Court, been fully removed, it is relevant:\nProvided further that if such a confession is otherwise relevant, it does not become irrelevant merely\nbecause  it  was  made  under  a  promise  of  secrecy,  or  in  consequence  of  a  deception  practised  on  the\naccused person for the purpose of obtaining it, or when he was drunk, or because it was made in answer\nto questions which he need not have answered, whatever may have been the form of those questions, or\nbecause he was not warned that he was not bound to make such confession, and that evidence of it might\nbe given against him.", "text_hi": "22. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "23", "heading_en": "Confession to police officer.—(1) No confession made to a police officer shall be proved as", "text_en": "against a person accused of any offence.\n(2) No confession made by any person while he is in the custody of a police officer, unless it is made\nin the immediate presence of a Magistrate shall be proved against him:\nProvided that when any fact is deposed to as discovered in consequence of information received from\na person accused of any offence, in the custody of a police officer, so much of such information, whether\nit amounts to a confession or not, as relates distinctly to the fact discovered, may be proved.", "text_hi": "23. (1)", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "24", "heading_en": "Consideration of proved confession affecting person making it and others jointly under trial", "text_en": "for  same  offence.—When  more  persons  than  one  are  being  tried  jointly  for  the  same  offence,  and  a\nconfession made by one of such persons affecting himself and some other of such persons is proved, the\nCourt  may  take  into  consideration  such  confession  as  against  such  other  person  as  well  as  against  the\nperson who makes such confession.\nExplanation I.—“Offence”, as used in this section, includes the abetment of, or attempt to commit,\nthe offence.\nExplanation  II.—A  trial  of  more  persons  than  one  held  in  the  absence  of  the  accused  who  has\nabsconded or who fails to comply with a proclamation issued under section 84 of the Bharatiya Nagarik\nSuraksha Sanhita, 2023 shall be deemed to be a joint trial for the purpose of this section.\nIllustrations.\n(a) A and B are jointly tried for the murder of C. It is proved that A said—“B and I murdered C”. The\nCourt may consider the effect of this confession as against B.\n(b) A is on his trial for the murder of C. There is evidence to show that C was murdered by A and B,\nand that B said— “A and I murdered C”. This statement may not be taken into consideration by the Court\nagainst A, as B is not being jointly tried.", "text_hi": "24. \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "25", "heading_en": "Admissions not conclusive proof, but may estop.—Admissions are not conclusive proof of the", "text_en": "matters admitted but they may operate as estoppels under the provisions hereinafter contained.\nStatements by persons who cannot be called as witnesses", "text_hi": "25. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "26", "heading_en": "Cases in which statement of relevant fact by person who is dead or cannot be found, etc., is", "text_en": "relevant.—Statements, written or verbal, of relevant facts made by a person who is dead, or who cannot\nbe  found,  or  who  has  become  incapable  of  giving  evidence,  or  whose  attendance  cannot  be  procured\nwithout an amount of delay or expense which under the circumstances of the case appears to the Court\nunreasonable, are themselves relevant facts in the following cases, namely:—\n(a)  when  the  statement  is  made  by  a  person  as  to  the  cause  of  his  death,  or  as  to  any  of  the\ncircumstances  of  the  transaction  which  resulted  in  his  death,  in  cases  in  which  the  cause  of  that\nperson's death comes into question. Such statements are relevant whether the person who made them\nwas or was not, at the time when they were made, under expectation of death, and whatever may be\nthe nature of the proceeding in which the cause of his death comes into question;\n(b)  when  the  statement  was  made  by  such  person  in  the  ordinary  course  of  business,  and  in\nparticular when it consists of any entry or memorandum made by him in books kept in the ordinary\ncourse  of  business,  or  in  the  discharge  of  professional  duty;  or  of  an  acknowledgement  written  or\nsigned by him of the receipt of money, goods, securities or property of any kind; or of a document\nused in commerce written or signed by him; or of the date of a letter or other document usually dated,\nwritten or signed by him;\n(c) when the statement is against the pecuniary or proprietary interest of the person making it, or\nwhen, if true, it would expose him or would have exposed him to a criminal prosecution or to a suit\nfor damages;\n(d)  when  the  statement  gives the  opinion  of any  such  person,  as  to the  existence  of  any  public\nright  or  custom  or  matter  of  public  or  general  interest,  of  the  existence  of  which,  if  it  existed,  he\nwould have been likely to be aware, and when such statement was made before any controversy as to\nsuch right, custom or matter had arisen;\n(e) when the statement relates to the existence of any relationship by blood, marriage or adoption\nbetween  persons  as  to  whose  relationship  by  blood,  marriage  or  adoption  the  person  making  the\nstatement had special means of knowledge, and when the statement was made before the question in\ndispute was raised;\n(f) when the statement relates to the existence of any relationship by blood, marriage or adoption\nbetween  persons  deceased,  and  is  made  in  any  will  or  deed  relating  to  the  affairs  of  the  family  to\nwhich any such deceased person belonged, or in any family pedigree, or upon any tombstone, family\nportrait  or  other  thing  on  which  such  statements  are  usually  made,  and  when  such  statement  was\nmade before the question in dispute was raised;\n(g) when the statement is contained in any deed, will or other document which relates to any such\ntransaction as is specified in clause (a) of section 11;\n(h) when the statement was made by a number of persons, and expressed feelings or impressions\non their part relevant to the matter in question.\nIllustrations.\n(a) The question is, whether A was murdered by B; or A dies of injuries received in a transaction in\nthe  course  of  which  she  was  raped.  The  question  is  whether  she  was  raped  by  B;  or  the  question  is,\nwhether  A  was  killed  by  B  under  such  circumstances  that  a  suit  would  lie  against  B  by  A's  widow.\nStatements made by A as to the cause of his or her death, referring respectively to the murder, the rape\nand the actionable wrong under consideration, are relevant facts.\n(b) The question is as to the date of A's birth. An entry in the diary of a deceased surgeon regularly\nkept in the course of business, stating that, on a given day he attended A's mother and delivered her of a\nson, is a relevant fact.\n(c) The question is, whether A was in Nagpur on a given day. A statement in the diary of a deceased\nsolicitor, regularly kept in the course of business, that on a given day the solicitor attended A at a place\nmentioned, in Nagpur, for the purpose of conferring with him upon specified business, is a relevant fact.\n(d) The question is, whether a ship sailed from Mumbai harbour on a given day. A letter written by a\ndeceased member of a merchant's firm by which she was chartered to their correspondents in Chennai, to\nwhom  the  cargo  was  consigned,  stating  that  the  ship  sailed  on  a  given  day  from  Mumbai  port,  is  a\nrelevant fact.\n(e) The question is, whether rent was paid to A for certain land. A letter from A's deceased agent to\nA, saying that he had received the rent on A's account and held it at A's orders is a relevant fact.\n(f) The question is, whether A and B were legally married. The statement of a deceased clergyman\nthat he married them under such circumstances that the celebration would be a crime is relevant.\n(g) The question is, whether A, a person who cannot be found, wrote a letter on a certain day. The\nfact that a letter written by him is dated on that day is relevant.\n(h) The question is, what was the cause of the wreck of a ship. A protest made by the captain, whose\nattendance cannot be procured, is a relevant fact.\n(i) The question is, whether a given road is a public way. A statement by A, a deceased headman of\nthe village, that the road was public, is a relevant fact.\n(j) The question is, what was the price of grain on a certain day in a particular market. A statement of\nthe price, made by a deceased business person in the ordinary course of his business, is a relevant fact.\n(k) The question is, whether A, who is dead, was the father of B. A statement  by A that B was his\nson, is a relevant fact.\n(l) The question is, what was the date of the birth of A. A letter from A's deceased father to a friend,\nannouncing the birth of A on a given day, is a relevant fact.\n(m) The question is, whether, and when, A and B were married. An entry in a memorandum book by\nC, the deceased father of B, of his daughter's marriage with A on a given date, is a relevant fact.\n(n) A sues B for a libel expressed in a painted caricature exposed in a shop window. The question is\nas to the similarity of the caricature and its libellous character. The remarks of a crowd of spectators on\nthese points may be proved.", "text_hi": "26. \n\n,\n\n,\n\n,   \n\n,\n\n,\n\n,\n\n  , \n\n,\n\n,\n\n,\n\n,\n\n,\n\n; \n\n,\n\n;\n\n,\n\n,\n\n; \n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n;\n\n,\n\n;\n\n,\n\n,\n\n,\n\n,\n\n,\n\n; \n\n,\n\n,\n\n,\n\n-\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "27", "heading_en": "Relevancy of certain evidence for proving, in subsequent proceeding, truth of facts therein", "text_en": "stated.—Evidence given by a witness in a judicial proceeding, or before any person authorised by law to\ntake it, is relevant for the purpose of proving, in a subsequent judicial proceeding, or in a later stage of the\nsame  judicial  proceeding,  the  truth  of  the  facts  which  it  states,  when  the  witness  is  dead  or  cannot  be\nfound, or is incapable of giving evidence, or is kept out of the way by the adverse party, or if his presence\ncannot be obtained without an amount of delay or expense which, under the circumstances of the case,\nthe Court considers unreasonable:\nProvided that the proceeding was between the same parties or their representatives in interest; that the\nadverse party in the first proceeding had the right and opportunity to cross-examine and the questions in\nissue were substantially the same in the first as in the second proceeding.\nExplanation.—A criminal trial or inquiry shall be deemed to be a proceeding between the prosecutor\nand the accused within the meaning of this section.\nStatements made under special circumstances", "text_hi": "27. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n, \n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "28", "heading_en": "Entries in books of account when relevant.—Entries in the books of account, including those", "text_en": "maintained in an electronic form, regularly kept in the course of business are relevant whenever they refer\nto a matter into which the Court has to inquire, but such statements shall not alone be sufficient evidence\nto charge any person with liability.\nIllustration.\nA sues B for one thousand rupees, and shows entries in his account books showing B to be indebted\nto him to this amount. The entries are relevant, but are not sufficient, without other evidence, to prove the\ndebt.", "text_hi": "28. \n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "29", "heading_en": "Relevancy of entry in public record or an electronic record made in performance of duty.—", "text_en": "An entry in any public or other official book, register or record or an electronic record, stating a fact in\nissue or relevant fact, and made by a public servant in the discharge of his official duty, or by any other\nperson in performance of a duty specially enjoined by the law of the country in which such book, register\nor record or an electronic record, is kept, is itself a relevant fact.", "text_hi": "29. \n\n,\n\n: \n\n,\n\n-\n\n, \n\n,\n\n,\n\n-\n\n-\n\n,\n\n, \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "30", "heading_en": "Relevancy of statements in maps, charts and plans.—Statements of facts in issue or relevant", "text_en": "facts, made in published maps or charts generally offered for public sale, or in maps or plans made under\nthe authority of the Central Government or any State Government, as to matters usually represented or\nstated in such maps, charts or plans, are themselves relevant facts.", "text_hi": "30. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "31", "heading_en": "Relevancy of statement as to fact of public nature contained in certain Acts or", "text_en": "notifications.—When the Court has to form an opinion as to the existence of any fact of a public nature,\nany  statement  of  it,  made  in  a  recital  contained  in  any  Central  Act  or  State  Act  or  in  a  Central\nGovernment  or  State  Government  notification  appearing  in  the  respective  Official  Gazette  or  in  any\nprinted paper or in electronic or digital form purporting to be such Gazette, is a relevant fact.", "text_hi": "31. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "32", "heading_en": "Relevancy of statements as to any law contained in law books including electronic or digital", "text_en": "form.—When the Court has to form an opinion as to a law of any country, any statement of such law\ncontained in a book purporting to be printed or published including in electronic or digital form under the\nauthority of the Government of such country and to contain any such law, and any report of a ruling of\nthe Courts of such country contained in a book including in electronic or digital form purporting to be a\nreport of such rulings, is relevant.\nHow much of a statement is to be proved", "text_hi": "32  \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "33", "heading_en": "What evidence to be given when statement forms part of a conversation, document,", "text_en": "electronic record, book or series of letters or papers.—When any statement of which evidence is given\nforms part of a longer statement, or of a conversation or part of an isolated document, or is contained in a\ndocument which forms part of a book, or is contained in part of electronic record or of a connected series\nof  letters  or  papers,  evidence  shall  be  given  of  so  much  and  no  more  of  the  statement,  conversation,\ndocument, electronic record, book or series of letters or papers as the Court considers necessary in that\nparticular  case  to  the  full  understanding  of  the  nature  and  effect  of  the  statement,  and  of  the\ncircumstances under which it was made.\nJudgments of Courts when relevant", "text_hi": "33  \n\n,\n\n,\n\n,\n\n, \n\n,\n\n,\n\n-\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "34", "heading_en": "Previous judgments relevant to bar a second suit or trial.—The existence of any judgment,", "text_en": "order or decree which by law prevents any Court from taking cognizance of a suit or holding a trial, is a\nrelevant fact when the question is whether such Court ought to take cognizance of such suit or to hold\nsuch trial.", "text_hi": "34. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "35", "heading_en": "Relevancy of certain judgments in probate, etc., jurisdiction.—(1) A final judgment, order or", "text_en": "decree of a competent Court or Tribunal, in the exercise of probate, matrimonial, admiralty or insolvency\njurisdiction,  which confers  upon  or  takes  away  from  any  person  any  legal character,  or  which  declares\nany person to be entitled to any such character, or to be entitled to any specific thing, not as against any\nspecified person but absolutely, is relevant when the existence of any such legal character, or the title of\nany such person to any such thing, is relevant.\n(2) Such judgment, order or decree is conclusive proof that—\n(i) any legal character, which it confers accrued at the time when such judgment, order or decree\ncame into operation;\n(ii) any legal character, to which it declares any such person to be entitled, accrued to that person\nat the time when such judgment, order or decree declares it to have accrued to that person;\n(iii) any legal character which it takes away from any such person ceased at the time from which\nsuch judgment, order or decree declared that it had ceased or should cease; and\n(iv) anything to which it declares any person to be so entitled was the property of that person at\nthe  time  from  which  such  judgment,  order  or  decree  declares  that  it  had  been  or  should  be  his\nproperty.", "text_hi": "35.\n\n,\n\n-\n\n,\n\n-\n\n,\n\n,\n\n-\n\n,\n\n-\n\n,\n\n,\n\n(i) \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "36", "heading_en": "Relevancy and effect of judgments, orders or decrees, other than those mentioned in", "text_en": "section 35.—Judgments, orders or decrees other than those mentioned in section 35 are relevant if they\nrelate to matters of a public nature relevant to the enquiry; but such judgments, orders or decrees are not\nconclusive proof of that which they state.\nIllustration.\nA  sues  B  for  trespass  on  his  land.  B  alleges  the  existence  of  a  public  right  of  way  over  the  land,\nwhich  A  denies.  The  existence  of  a  decree  in  favour  of  the  defendant,  in  a  suit  by  A  against  C  for  a\ntrespass on the same land, in which C alleged the existence of the same right of way, is relevant, but it is\nnot conclusive proof that the right of way exists.", "text_hi": "36. \n\n,\n\n,\n\n34,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "37", "heading_en": "Judgments, etc., other than those mentioned in sections 34, 35 and 36 when relevant.—", "text_en": "Judgments  or  orders  or  decrees,  other  than  those  mentioned  in  sections  34,  35  and  36,  are  irrelevant,\nunless the existence of such judgment, order or decree is a fact in issue, or is relevant under some other\nprovision of this Adhiniyam.\nIllustrations.\n(a) A and B separately sue C for a libel which reflects upon each of them. C in each case says that the\nmatter alleged to be libellous is true, and the circumstances are such that it is probably true in each case,\nor  in  neither.  A  obtains  a  decree  against  C  for  damages  on  the  ground  that  C  failed  to  make  out  his\njustification. The fact is irrelevant as between B and C.\n(b)  A  prosecutes  B for  stealing  a  cow from  him.  B  is  convicted.  A  afterwards sues  C  for the cow,\nwhich B had sold to him before his conviction. As between A and C, the judgment against B is irrelevant.\n(c)  A  has  obtained  a  decree  for  the  possession  of  land  against  B.  C,  B's  son,  murders  A  in\nconsequence. The existence of the judgment is relevant, as showing motive for a crime.\n(d)  A  is  charged  with  theft  and  with  having  been  previously  convicted  of  theft.  The  previous\nconviction is relevant as a fact in issue.\n(e) A is tried for the murder of B. The fact that B prosecuted A for libel and that A was convicted and\nsentenced is relevant under section 6 as showing the motive for the fact in issue.", "text_hi": "37. \n\n34,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "38", "heading_en": "Fraud or collusion in obtaining judgment, or incompetency of Court, may be proved.—Any", "text_en": "party to a suit or other proceeding may show that any judgment, order or decree which is relevant under\nsection  34,  35  or  36,  and  which  has  been  proved  by  the  adverse  party,  was  delivered  by  a  Court  not\ncompetent to deliver it, or was obtained by fraud or collusion.\nOpinions of third persons when relevant", "text_hi": "38. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "39", "heading_en": "Opinions of experts.—(1) When the Court has to form an opinion upon a point of foreign law or", "text_en": "of science or art, or any other field, or as to identity of handwriting or finger impressions, the opinions\nupon that point of persons specially skilled in such foreign law, science or art, or any other field, or in\nquestions as to identity of handwriting or finger impressions are relevant facts and such persons are called\nexperts.\nIllustrations.\n(a) The question is, whether the death of A was caused by poison. The opinions of experts as to the\nsymptoms produced by the poison by which A is supposed to have died, are relevant.\n(b) The question is, whether A, at the time of doing a certain act, was, by reason of unsoundness of\nmind, incapable of knowing the nature of the act, or that he was doing what was either wrong or contrary\nto law. The opinions of experts upon the question whether the symptoms exhibited by A commonly show\nunsoundness  of  mind,  and  whether  such  unsoundness  of  mind  usually  renders  persons  incapable  of\nknowing the nature of the acts which they do, or of knowing that what they do is either wrong or contrary\nto law, are relevant.\n(c)  The  question  is,  whether  a  certain  document  was  written  by  A.  Another  document  is  produced\nwhich is proved or admitted to have been written by A. The opinions of experts on the question whether\nthe two documents were written by the same person or by different persons, are relevant.\n(2) When in a proceeding, the court has to form an opinion on any matter relating to any information\ntransmitted or stored in any computer resource or any other electronic or digital form, the opinion of the\nExaminer  of  Electronic  Evidence  referred  to  in section  79A of  the  Information  Technology  Act,  2000\n(21 of 2000), is a relevant fact.\nExplanation.—For the purposes of this sub-section, an Examiner of Electronic Evidence shall be an\nexpert.", "text_hi": "39. \n\n,\n\n,\n\n(2)", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "40", "heading_en": "Facts bearing upon opinions of experts.—Facts, not otherwise relevant, are relevant if they", "text_en": "support or are inconsistent with the opinions of experts, when such opinions are relevant.\nIllustrations.\n(a) The question is, whether A was poisoned by a certain poison. The fact that other persons, who\nwere  poisoned  by  that  poison,  exhibited  certain  symptoms  which  experts  affirm  or  deny  to  be  the\nsymptoms of that poison, is relevant.\n(b) The question is, whether an obstruction to a harbour is caused by a certain sea-wall. The fact that\nother harbours similarly situated in other respects, but where there were no such sea-walls, began to be\nobstructed at about the same time, is relevant.", "text_hi": "40. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "41", "heading_en": "Opinion as to handwriting and signature, when relevant.—(1) When the Court has to form an", "text_en": "opinion  as  to  the  person  by  whom  any  document  was  written  or  signed,  the  opinion  of  any  person\nacquainted with the handwriting of the person by whom it is supposed to be written or signed that it was\nor was not written or signed by that person, is a relevant fact.\nExplanation.—A person is said to be acquainted with the handwriting of another person when he has\nseen  that  person  write,  or  when  he  has  received  documents  purporting  to  be  written  by  that  person  in\nanswer to documents written by himself or under his authority and addressed to that person, or when, in\nthe ordinary course of business, documents purporting to be written by that person have been habitually\nsubmitted to him.\nIllustration.\nThe  question  is,  whether  a  given  letter  is  in  the  handwriting  of  A,  a  merchant  in  Itanagar.  B  is  a\nmerchant  in  Bengaluru,  who  has  written  letters  addressed  to  A  and  received  letters  purporting  to  be\nwritten by him. C, is B's clerk whose duty it was to examine and file B's correspondence. D is B's broker,\nto whom B habitually submitted the letters purporting to be written by A for the purpose of advising him\nthereon. The  opinions  of B,  C  and  D  on  the  question  whether  the  letter is in  the  handwriting  of  A  are\nrelevant, though neither B, C nor D ever saw A write.\n(2) When the Court has to form an opinion as to the electronic signature of any person, the opinion of\nthe Certifying Authority which has issued the Electronic Signature Certificate is a relevant fact.", "text_hi": "41.  (1) \n\n,\n\n,\n\n-\n\n,\n\n(2) \n\n, \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "42", "heading_en": "Opinion as to existence of general custom or right, when relevant.—When the Court has to", "text_en": "form an opinion as to the existence of any general custom or right, the opinions, as to the existence of\nsuch custom or right, of persons who would be likely to know of its existence if it existed, are relevant.\nExplanation.—The expression “general custom or right” includes customs or rights common to any\nconsiderable class of persons.\nIllustration.\nThe right of the villagers of a particular village to use the water of a particular well is a general right\nwithin the meaning of this section.", "text_hi": "42. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "43", "heading_en": "Opinion as to usages, tenets, etc., when relevant.—When the Court has to form an opinion as", "text_en": "to—\n(i) the usages and tenets of any body of men or family;\n(ii) the constitution and governance of any religious or charitable foundation; or\n(iii) the meaning of words or terms used in particular districts or by particular classes of people,\nthe opinions of persons having special means of knowledge thereon, are relevant facts.", "text_hi": "43. \n\n(i) \n\n(ii) \n\n(iii) \n\n;  \n\n ;  \n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "44", "heading_en": "Opinion on relationship, when relevant.—When the Court has to form an opinion as to the", "text_en": "relationship  of  one  person  to  another,  the  opinion,  expressed  by  conduct,  as  to  the  existence  of  such\nrelationship, of any person who, as a member of the family or otherwise, has special means of knowledge\non the subject, is a relevant fact:\nProvided  that  such  opinion  shall  not  be  sufficient  to  prove  a  marriage  in  proceedings  under  the\nDivorce  Act,  1869  (4  of  1869),  or  in  prosecution  under sections  82 and 84 of  the  Bharatiya  Nyaya\nSanhita, 2023.\nIllustrations.\n(a)  The  question  is,  whether  A  and  B  were  married.  The  fact  that  they  were  usually  received  and\ntreated by their friends as husband and wife, is relevant.\n(b) The  question is,  whether  A  was the  legitimate  son  of  B. The fact that  A  was  always treated  as\nsuch by members of the family, is relevant.", "text_hi": "44. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "45", "heading_en": "Grounds of opinion, when relevant.—Whenever the opinion of any living person is relevant,", "text_en": "the grounds on which such opinion is based are also relevant.\nIllustration.\nAn  expert  may  give  an  account  of  experiments  performed  by  him  for  the  purpose  of  forming  his\nopinion.\nCharacter when relevant", "text_hi": "45. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "46", "heading_en": "In civil cases character to prove conduct imputed, irrelevant.—In civil cases the fact that the", "text_en": "character of any person concerned is such as to render probable or improbable any conduct imputed to\nhim, is irrelevant, except in so far as such character appears from facts otherwise relevant.", "text_hi": "46.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "47", "heading_en": "In criminal cases previous good character relevant.—In criminal proceedings the fact that the", "text_en": "person accused is of a good character, is relevant.", "text_hi": "47.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "48", "heading_en": "Evidence of character or previous sexual experience not relevant in certain cases.—In a", "text_en": "for  an  offence  under section  64, section  65, section  66, section  67, section  68,\nprosecution\nsection  69, section  70, section  71, section  74, section  75, section  76, section  77 or section  78 of  the\nBharatiya Nyaya Sanhita, 2023 or for attempt to commit any such offence, where the question of consent\nis in issue, evidence of the character of the victim or of such person’s previous sexual experience with\nany person shall not be relevant on the issue of such consent or the quality of consent.", "text_hi": "48. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "49", "heading_en": "Previous bad character not relevant, except in reply.—In criminal proceedings, the fact that", "text_en": "the accused has a bad character, is irrelevant, unless evidence has been given that he has a good character,\nin which case it becomes relevant.\nExplanation  1.—This  section  does  not  apply  to  cases  in  which  the  bad  character  of  any  person  is\nitself a fact in issue.\nExplanation 2.—A previous conviction is relevant as evidence of bad character.", "text_hi": "49. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "50", "heading_en": "Character as affecting damages.—In civil cases, the fact that the character of any person is such", "text_en": "as to affect the amount of damages which he ought to receive, is relevant.\nExplanation.—In  this  section  and  sections  46,  47  and  49,  the  word  “character”  includes  both\nreputation and disposition; but, except as provided in section 49, evidence may be given only of general\nreputation and general disposition, and not of particular acts by which reputation or disposition has been\nshown.\nPART III\nON PROOF", "text_hi": "50. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "51", "heading_en": "Fact judicially noticeable need not be proved.—No fact of which the Court will take judicial", "text_en": "notice need be proved.", "text_hi": "51. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "52", "heading_en": "Facts of which Court shall take judicial notice.—(1) The Court shall take judicial notice of the", "text_en": "following facts, namely:—\n(a) all laws in force in the territory of India including laws having extra-territorial operation;\n(b) international treaty, agreement or convention with country or countries by India, or decisions\nmade by India at international associations or other bodies;\n(c) the course of proceeding of the Constituent Assembly of India, of Parliament of India and of\nthe State Legislatures;\n(d) the seals of all Courts and Tribunals;\n(e)  the  seals  of  Courts  of  Admiralty  and  Maritime  Jurisdiction,  Notaries  Public,  and  all  seals\nwhich  any  person  is  authorised  to  use  by  the  Constitution,  or  by  an  Act  of  Parliament  or  State\nLegislatures, or Regulations having the force of law in India;\n(f)  the  accession  to  office, names,  titles,  functions,  and  signatures  of the  persons  filling  for the\ntime being any public office in any State, if the fact of their appointment to such office is notified in\nany Official Gazette;\n(g)  the  existence,  title  and  national  flag  of  every  country  or  sovereign  recognised  by  the\nGovernment of India;\n(h) the divisions of time, the geographical divisions of the world, and public festivals, fasts and\nholidays notified in the Official Gazette;\n(i) the territory of India;\n(j)  the  commencement,  continuance  and  termination  of  hostilities  between  the  Government  of\nIndia and any other country or body of persons;\n(k)  the  names  of  the  members  and  officers  of  the  Court  and  of  their  deputies  and  subordinate\nofficers and assistants, and also of all officers acting in execution of its process, and of advocates and\nother persons authorised by law to appear or act before it;\n(l) the rule of the road on land or at sea.\n(2)  In  the  cases  referred  to  in  sub-section  (1)  and  also  on  all  matters  of  public  history,  literature,\nscience or art, the Court may resort for its aid to appropriate books or documents of reference and if the\nCourt is called upon by any person to take judicial notice of any fact, it may refuse to do so unless and\nuntil such person produces any such book or document as it may consider necessary to enable it to do so.", "text_hi": "52. (1) \n\n(\n\n)\n\n(\n\n) \n\n;  \n\n(\n\n) \n\n-\n\n( )\n\n( )\n\n(\n\n)\n\n,\n\n(\n\n)\n\n(\n\n)\n\n(\n\n(\n\n)\n\n) \n\n( ) \n\n, \n\n ;   \n\n, \n\n:\n\n, \n\n;   \n\n, \n\n,\n\n,\n\n,\n\n; \n\n,\n\n,\n\n;   \n\n; \n\n;   \n\n,\n\n;  \n\n;   \n\n,\n\n,\n\n;  \n\n;  \n\n,\n\n-\n\n \n \n \n \n \n \n \n   \n \n \n     \n \n \n \n  \n \n \n \n \n \n \n \n \n\n  ] \n\n( )", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "53", "heading_en": "Facts admitted need not be proved.—No fact needs to be proved in any proceeding which the", "text_en": "parties thereto or their agents agree to admit at the hearing, or which, before the hearing, they agree to\nadmit  by  any  writing  under their  hands, or  which  by any  rule  of pleading  in  force at  the time  they  are\ndeemed to have admitted by their pleadings:\nProvided that the Court may, in its discretion, require the facts admitted to be proved otherwise than\nby such admissions.", "text_hi": "53. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "54", "heading_en": "Proof of facts by oral evidence.—All facts, except the contents of documents may be proved by", "text_en": "oral evidence.", "text_hi": "54.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "55", "heading_en": "Oral evidence to be direct.—Oral evidence shall, in all cases whatever, be direct; if it refers", "text_en": "to,—\n(i) a fact which could be seen, it must be the evidence of a witness who says he saw it;\n(ii) a fact which could be heard, it must be the evidence of a witness who says he heard it;\n(iii) a fact which could be perceived by any other sense or in any other manner, it must be the\nevidence of a witness who says he perceived it by that sense or in that manner;\n(iv)  an  opinion  or  to the  grounds  on  which that  opinion  is  held, it  must  be  the evidence of the\nperson who holds that opinion on those grounds:\nProvided  that the  opinions  of  experts expressed  in  any  treatise commonly  offered  for  sale,  and  the\ngrounds on which such opinions are held, may be proved by the production of such treatises if the author\nis dead or cannot be found, or has become incapable of giving evidence, or cannot be called as a witness\nwithout an amount of delay or expense which the Court regards as unreasonable:\nProvided further that, if oral evidence refers to the existence or condition of any material thing other\nthan  a  document,  the  Court  may,  if  it  thinks  fit,  require  the  production  of  such  material  thing  for  its\ninspection.", "text_hi": "55. \n\n,\n\ni\n\nii  \n\niii", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "56", "heading_en": "Proof of contents of documents.—The contents of documents may be proved either by primary", "text_en": "or by secondary evidence.", "text_hi": "56.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "57", "heading_en": "Primary evidence.—Primary evidence means the document itself produced for the inspection of", "text_en": "the Court.\nExplanation 1.—Where a document is executed in several parts, each part is primary evidence of\nthe document.\nExplanation 2.—Where a document is executed in counterpart, each counterpart being executed\nby  one  or  some  of  the  parties  only,  each  counterpart  is  primary  evidence  as  against  the  parties\nexecuting it.\nExplanation 3.—Where a number of documents are all made by one uniform process, as in the\ncase of printing, lithography or photography, each is primary evidence of the contents of the rest; but,\nwhere they are all copies of a common original, they are not primary evidence of the contents of the\noriginal.\nExplanation  4.—Where  an  electronic  or  digital  record  is  created  or  stored,  and  such  storage\noccurs simultaneously or sequentially in multiple files, each such file is primary evidence.\nExplanation  5.—Where  an  electronic  or  digital  record  is  produced  from  proper  custody,  such\nelectronic and digital record is primary evidence unless it is disputed.\nExplanation  6.—Where  a  video  recording  is  simultaneously  stored  in  electronic  form  and\ntransmitted or broadcast or transferred to another, each of the stored recordings is primary evidence.\nExplanation  7.—Where  an  electronic  or  digital record  is  stored in  multiple  storage  spaces in a\ncomputer resource, each such automated storage, including temporary files, is primary evidence.\nIllustration.\nA person is shown to have been in possession of a number of placards, all printed at one time from\none original. Any one of the placards is primary evidence of the contents of any other, but no one of them\nis primary evidence of the contents of the original.", "text_hi": "57. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "58", "heading_en": "Secondary evidence.—Secondary evidence includes—", "text_en": "(i) certified copies given under the provisions hereinafter contained;\n(ii)  copies  made  from  the  original  by  mechanical  processes  which  in  themselves  ensure  the\naccuracy of the copy, and copies compared with such copies;\n(iii) copies made from or compared with the original;\n(iv) counterparts of documents as against the parties who did not execute them;\n(v) oral accounts of the contents of a document given by some person who has himself seen it;\n(vi) oral admissions;\n(vii) written admissions;\n(viii)  evidence  of  a  person  who  has  examined  a  document,  the  original  of  which  consists  of\nnumerous accounts or other documents which cannot conveniently be examined in Court, and who is\nskilled in the examination of such documents.\nIllustrations.\n(a) A photograph of an original is secondary evidence of its contents, though the two have not been\ncompared, if it is proved that the thing photographed was the original.\n(b) A copy compared with a copy of a letter made by a copying machine is secondary evidence of the\ncontents  of  the  letter,  if  it  is  shown  that  the  copy  made  by  the  copying  machine  was  made  from  the\noriginal.\n(c)  A  copy  transcribed  from  a  copy,  but  afterwards  compared  with  the  original,  is  secondary\nevidence; but the copy not so compared is not secondary evidence of the original, although the copy from\nwhich it was transcribed was compared with the original.\n(d) Neither an oral account of a copy compared with the original, nor an oral account of a photograph\nor machine-copy of the original, is secondary evidence of the original.", "text_hi": "58. \n\n(i)\n\n;  \n\n(ii)\n\n;\n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "59", "heading_en": "Proof of documents by primary evidence.— Documents shall be proved by primary", "text_en": "evidence except in the cases hereinafter mentioned.", "text_hi": "59.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "60", "heading_en": "Cases in which secondary evidence relating to documents may be given.—Secondary", "text_en": "evidence  may  be  given  of  the  existence,  condition,  or  contents  of  a  document  in  the  following  cases,\nnamely:—\n(a) when the original is shown or appears to be in the possession or power—\n(i) of the person against whom the document is sought to be proved; or\n(ii) of any person out of reach of, or not subject to, the process of the Court; or\n(iii) of any person legally bound to produce it,\nand when, after the notice mentioned in section 64 such person does not produce it;\n(b) when the existence, condition or contents of the original have been proved to be admitted in\nwriting by the person against whom it is proved or by his representative in interest;\n(c)  when  the  original  has  been  destroyed  or  lost,  or  when  the  party  offering  evidence  of  its\ncontents  cannot,  for  any  other  reason  not  arising  from  his  own  default  or  neglect,  produce  it  in\nreasonable time;\n(d) when the original is of such a nature as not to be easily movable;\n(e) when the original is a public document within the meaning of section 74;\n(f) when the original is a document of which a certified copy is permitted by this Adhiniyam, or\nby any other law in force in India to be given in evidence;\n(g)  when  the  originals  consist  of  numerous  accounts  or  other  documents  which  cannot\nconveniently  be  examined  in  Court,  and  the  fact  to  be  proved  is  the  general  result  of  the  whole\ncollection.\nExplanation.—For the purposes of—\n(i) clauses (a), (c) and (d), any secondary evidence of the contents of the document is admissible;\n(ii) clause (b), the written admission is admissible;\n(iii) clause (e) or (f), a certified copy of the document, but no other kind of secondary evidence, is\nadmissible;\n(iv) clause (g), evidence may be given as to the general result of the documents by any person\nwho has examined them, and who is skilled in the examination of such document.", "text_hi": "60. \n\ni\n\nii\n\niii", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "62", "heading_en": "Special provisions as to evidence relating to electronic record.—The contents of", "text_en": "electronic records may be proved in accordance with the provisions of section 63.", "text_hi": "62. \n\n 63\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "63", "heading_en": "Admissibility of electronic records.—(1) Notwithstanding anything contained in this", "text_en": "Adhiniyam, any information contained in an electronic record which is printed on paper, stored, recorded\nor copied in optical or magnetic media or semiconductor memory which is produced by a computer or\nany  communication  device  or  otherwise  stored,  recorded  or  copied  in  any  electronic  form  (hereinafter\nreferred to as the computer output) shall be deemed to be also a document, if the conditions mentioned in\nthis section are satisfied in relation to the information and computer in question and shall be admissible in\nany proceedings, without further proof or production of the original, as evidence or any contents of the\noriginal or of any fact stated therein of which direct evidence would be admissible.\n(2)  The  conditions  referred  to  in  sub-section  (1)  in  respect  of  a  computer  output  shall  be  the\nfollowing, namely:—\n(a)  the  computer  output  containing  the  information  was  produced  by  the  computer  or\ncommunication  device  during  the  period  over  which  the  computer  or  Communication  device  was\nused regularly to create, store or process information for the purposes of any activity regularly carried\non  over  that  period  by  the  person  having  lawful  control  over  the  use  of  the  computer  or\ncommunication device;\n(b)  during  the  said  period,  information  of  the  kind  contained  in  the  electronic  record  or  of  the\nkind  from  which  the  information  so  contained  is  derived  was  regularly  fed  into  the  computer  or\nCommunication device in the ordinary course of the said activities;\n(c) throughout the material part of the said period, the computer or communication device was\noperating properly or, if not, then in respect of any period in which it was not operating properly or\nwas out of operation during that part of the period, was not such as to affect the electronic record or\nthe accuracy of its contents; and\n(d)  the  information  contained  in  the  electronic  record  reproduces  or  is  derived  from  such\ninformation  fed  into  the  computer  or  Communication  device  in  the  ordinary  course  of  the  said\nactivities.\n(3)  Where  over  any  period,  the  function  of  creating,  storing  or  processing  information  for  the\npurposes of any activity regularly carried on over that period as mentioned in clause (a) of sub-section (2)\nwas regularly performed by means of one or more computers or communication device, whether—\n(a) in standalone mode; or\n(b) on a computer system; or\n(c) on a computer network; or\n(d)  on  a  computer  resource  enabling  information  creation  or  providing  information  processing\nand storage; or\n(e) through an intermediary,\nall the computers or communication devices used for that purpose during that period shall be treated for\nthe purposes of this section as constituting a single computer or communication device; and references in\nthis section to a computer or communication device shall be construed accordingly.\n(4) In any proceeding where it is desired to give a statement in evidence by virtue of this section, a\ncertificate doing any of the following things shall be submitted along with the electronic record at each\ninstance where it is being submitted for admission, namely:—\n(a) identifying the electronic record containing the statement and describing the manner in which\nit was produced;\n(b) giving such particulars of any device involved in the production of that electronic record as\nmay be appropriate for the purpose of showing that the electronic record was produced by a computer\nor a communication device referred to in clauses (a) to (e) of sub-section (3);\n(c) dealing with any of the matters to which the conditions mentioned in sub-section (2) relate,\nand  purporting  to  be  signed  by  a  person  in  charge  of  the  computer  or  communication  device  or  the\nmanagement of the relevant activities (whichever is appropriate) and an expert shall be evidence of any\nmatter stated in the certificate; and for the purposes of this sub-section it shall be sufficient for a matter to\nbe stated to the best of the knowledge and belief of the person stating it in the certificate specified in the\nSchedule.\n(5) For the purposes of this section,—\n(a)  information  shall  be  taken  to  be  supplied  to  a  computer  or  communication  device  if  it  is\nsupplied  thereto  in  any  appropriate  form  and  whether  it  is  so  supplied  directly  or  (with  or  without\nhuman intervention) by means of any appropriate equipment;\n(b)  a  computer  output  shall  be  taken  to  have  been  produced  by  a  computer  or  communication\ndevice whether it was produced by it directly or (with or without human intervention) by means of\nany  appropriate  equipment  or  by  other  electronic  means  as  referred  to  in  clauses  (a)  to  (e)  of\nsub-section (3).", "text_hi": "63. (1)\n\n, \n\n,\n\n,\n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "64", "heading_en": "Rules as to notice to produce.—Secondary evidence of the contents of the documents referred to", "text_en": "in clause (a) of section 60, shall not be given unless the party proposing to give such secondary evidence\nhas  previously  given  to the  party  in  whose  possession  or  power  the  document is,  or  to  his advocate  or\nrepresentative, such notice to produce it as is prescribed by law; and if no notice is prescribed by law,\nthen such notice as the Court considers reasonable under the circumstances of the case:\nProvided that such notice shall not be required in order to render secondary evidence admissible in\nany of the following cases, or in any other case in which the Court thinks fit to dispense with it:—\n(a) when the document to be proved is itself a notice;\n(b) when, from the nature of the case, the adverse party must know that he will be required to\nproduce it;\n(c) when it appears or is proved that the adverse party has obtained possession of the original by\nfraud or force;\n(d) when the adverse party or his agent has the original in Court;\n(e) when the adverse party or his agent has admitted the loss of the document;\n(f) when the person in possession of the document is out of reach of, or not subject to, the process\nof the Court.", "text_hi": "64.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "65", "heading_en": "Proof of signature and handwriting of person alleged to have signed or written document", "text_en": "produced.—If a document is alleged to be signed or to have been written wholly or in part by any person,\nthe  signature  or  the  handwriting  of  so  much  of  the  document  as  is  alleged  to  be  in  that  person's\nhandwriting must be proved to be in his handwriting.", "text_hi": "65. \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "66", "heading_en": "Proof as to electronic signature.—Except in the case of a secure electronic signature, if the", "text_en": "electronic signature of any subscriber is alleged to have been affixed to an electronic record, the fact that\nsuch electronic signature is the electronic signature of the subscriber must be proved.", "text_hi": "66.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "67", "heading_en": "Proof of execution of document required by law to be attested.—If a document is required by", "text_en": "law to be attested, it shall not be used as evidence until one attesting witness at least has been called for the\npurpose of proving its execution, if there be an attesting witness alive, and subject to the process of the\nCourt and capable of giving evidence:\nProvided that it  shall  not  be  necessary  to  call  an  attesting  witness in  proof  of  the  execution  of  any\ndocument,  not  being  a  will,  which  has  been  registered  in  accordance  with  the  provisions  of  the  Indian\nRegistration Act, 1908 (16 of 1908), unless its execution by the person by whom it purports to have been\nexecuted is specifically denied.", "text_hi": "67. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "68", "heading_en": "Proof where no attesting witness found.—If no such attesting witness can be found, it must be", "text_en": "proved that the attestation of one attesting witness at least is in his handwriting, and that the signature of\nthe person executing the document is in the handwriting of that person.", "text_hi": "68", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "69", "heading_en": "Admission of execution by party to attested document.—The admission of a party to an", "text_en": "attested  document  of  its  execution  by  himself  shall  be  sufficient  proof  of  its  execution  as  against  him,\nthough it be a document required by law to be attested.", "text_hi": "69.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "70", "heading_en": "Proof when attesting witness denies execution.—If the attesting witness denies or does not", "text_en": "recollect the execution of the document, its execution may be proved by other evidence.", "text_hi": "70.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "71", "heading_en": "Proof of document not required by law to be attested.—An attested document not required by", "text_en": "law to be attested may be proved as if it was unattested.", "text_hi": "71. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n, 1908 \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "72", "heading_en": "Comparison of signature, writing or seal with others admitted or proved.—(1) In order to", "text_en": "ascertain  whether  a  signature,  writing  or  seal  is  that  of  the  person  by  whom  it  purports  to  have  been\nwritten or made, any signature, writing, or seal admitted or proved to the satisfaction of the Court to have\nbeen written or made by that person may be compared with the one which is to be proved, although that\nsignature, writing or seal has not been produced or proved for any other purpose.\n(2) The Court may direct any person present in Court to write any words or figures for the purpose of\nenabling the Court to compare the words or figures so written with any words or figures alleged to have\nbeen written by such person.\n(3) This section applies also, with any necessary modifications, to finger impressions.", "text_hi": "72. (1) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n [", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "73", "heading_en": "Proof as to verification of digital signature.—In order to ascertain whether a digital signature is", "text_en": "that of the person by whom it purports to have been affixed, the Court may direct—\n(a)  that  person  or  the  Controller  or  the  Certifying  Authority  to  produce  the  Digital  Signature\nCertificate;\n(b) any other person to apply the public key listed in the Digital Signature Certificate and verify\nthe digital signature purported to have been affixed by that person.", "text_hi": "73. \n\n; \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "74", "heading_en": "Public and private documents.—(1) The following documents are public documents:—", "text_en": "Public documents\n(a) documents forming the acts, or records of the acts—\n(i) of the sovereign authority;\n(ii) of official bodies and tribunals; and\n(iii) of public officers, legislative, judicial and executive of India or of a foreign country;\n(b) public records kept in any State or Union territory of private documents.\n(2) All other documents except the documents referred to in sub-section (1) are private.", "text_hi": "74\n\n; \n\ni  \n\n,\n\n;  \n\nii\n\niii\n\n,\n\niv  \n\n; \n\n; \n\n; \n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "75", "heading_en": "Certified copies of public documents.—Every public officer having the custody of a public", "text_en": "document,  which  any  person  has  a  right  to  inspect,  shall  give  that  person  on  demand  a  copy  of  it  on\npayment of the legal fees therefor, together with a certificate written at the foot of such copy that it is a\ntrue copy of such document or part thereof, as the case may be, and such certificate shall be dated and\nsubscribed by such officer with his name and his official title, and shall be sealed, whenever such officer\nis authorised by law to make use of a seal; and such copies so certified shall be called certified copies.\nExplanation.—Any officer who, by the ordinary course of official duty, is authorised to deliver such\ncopies, shall be deemed to have the custody of such documents within the meaning of this section.", "text_hi": "75. \n\n,\n\n,\n\n,\n\n,   \n\n,\n\n;\n\n,\n\n,\n\n; \n\n; \n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "76", "heading_en": "Proof of documents by production of certified copies.—Such certified copies may be produced", "text_en": "in proof of the contents of the public documents or parts of the public documents of which they purport to\nbe copies.", "text_hi": "76.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "77", "heading_en": "Proof of other official documents.—The following public documents may be proved as", "text_en": "follows: —\n(a)  Acts,  orders  or  notifications  of  the  Central  Government  in  any  of  its  Ministries  and\nDepartments  or  of  any  State  Government  or  any  Department  of  any  State  Government  or  Union\nterritory Administration—\n(i)  by  the  records  of  the  Departments,  certified  by  the  head  of  those  Departments\nrespectively; or\n(ii) by any document purporting to be printed by order of any such Government;\n(b)  the  proceedings  of  Parliament  or  a  State  Legislature,  by  the  journals  of  those  bodies\nrespectively, or by published Acts or abstracts, or by copies purporting to be printed by order of the\nGovernment concerned;\n(c)  proclamations,  orders  or  Regulations  issued  by  the  President  of  India  or  the  Governor  of  a\nState  or  the  Administrator  or  Lieutenant  Governor  of  a  Union  territory,  by  copies  or  extracts\ncontained in the Official Gazette;\n(d)  the  Acts  of  the  Executive  or  the  proceedings  of  the  Legislature  of  a  foreign  country,  by\njournals  published  by  their  authority,  or  commonly  received  in  that  country  as  such,  or  by  a  copy\ncertified under the seal of the country or sovereign, or by a recognition thereof in any Central Act;\n(e)  the  proceedings  of  a  municipal  or  local  body  in  a  State,  by  a  copy  of  such  proceedings,\ncertified by the legal keeper thereof, or by a printed book purporting to be published by the authority\nof such body;\n(f) public documents of any other class in a foreign country, by the original or by a copy certified\nby  the  legal  keeper  thereof,  with  a  certificate  under  the  seal  of  a  Notary  Public,  or  of  an  Indian\nConsul or diplomatic agent, that the copy is duly certified by the officer having the legal custody of\nthe  original,  and  upon  proof  of  the  character  of  the  document  according  to  the  law  of  the  foreign\ncountry.\nPresumptions as to documents", "text_hi": "77. \n\n(\n\n) \n\n,\n\n,\n\n(\n\n) \n\ni\n\n(ii\n\n(\n\n)\n\n( )\n\n,\n\n,\n\n( ) \n\n(\n\n)", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "78", "heading_en": "Presumption as to genuineness of certified copies.—(1) The Court shall presume to be genuine", "text_en": "every document purporting to be a certificate, certified copy or other document, which is by law declared\nto be admissible as evidence of any particular fact and which purports to be duly certified by any officer\nof the Central Government or of a State Government:\nProvided that such document is substantially in the form and purports to be executed in the manner\ndirected by law in that behalf.\n(2) The Court shall also presume that any officer by whom any such document purports to be signed\nor certified, held, when he signed it, the official character which he claims in such paper.", "text_hi": "78.  (1) \n\n,\n\n,\n\n; \n\n,\n\n,\n\n ;\n\n,\n\n; \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,   \n\n, \n\n, \n\n;  \n\n,\n\n,\n\n-\n\n; \n\n,\n\n, \n\n, \n\n, \n\n,\n\n, \n\n;  \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "79", "heading_en": "Presumption as to documents produced as record of evidence, etc.—Whenever any document", "text_en": "is produced before any Court, purporting to be a record or memorandum of the evidence, or of any part of\nthe evidence, given by a witness in a judicial proceeding or before any officer authorised by law to take\nsuch evidence or to be a statement or confession by any prisoner or accused person, taken in accordance\nwith law, and purporting to be signed by any Judge or Magistrate, or by any such officer as aforesaid, the\nCourt shall presume that—\n(i) the document is genuine;\n(ii) any statements as to the circumstances under which it was taken, purporting to be made by\nthe person signing it, are true; and\n(iii) such evidence, statement or confession was duly taken.", "text_hi": "79. \n\n,\n\n,\n\n(i) \n\n(ii) \n\n,\n\n,\n\n;\n\n(iii) \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "80", "heading_en": "Presumption as to Gazettes, newspapers, and other documents.—The Court shall presume the", "text_en": "genuineness of every document purporting to be the Official Gazette, or to be a newspaper or journal, and\nof  every  document  purporting  to  be a  document  directed by  any  law  to  be  kept by  any  person, if  such\ndocument is kept substantially in the form required by law and is produced from proper custody.\nExplanation.—For  the  purposes  of  this  section  and  section  92,  document  is  said  to  be  in  proper\ncustody  if  it  is  in  the  place  in  which,  and  looked  after  by  the  person  with  whom  such  document  is\nrequired to be kept; but no custody is improper if it is proved to have had a legitimate origin, or if the\ncircumstances of the particular case are such as to render that origin probable.", "text_hi": "80. \n\n, \n\n,\n\n,\n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "81", "heading_en": "Presumption as to Gazettes in electronic or digital record.—The Court shall presume the", "text_en": "genuineness of every electronic or digital record purporting to be the Official Gazette, or purporting to be\nelectronic  or  digital  record  directed  by  any  law  to  be  kept  by  any  person,  if  such  electronic  or  digital\nrecord is kept substantially in the form required by law and is produced from proper custody.\nExplanation.—For  the  purposes  of  this  section  and  section  93  electronic  records  are  said  to  be  in\nproper  custody  if  they  are  in  the  place  in  which,  and  looked  after  by  the  person  with  whom  such\ndocument is required to be kept; but no custody is improper if it is proved to have had a legitimate origin,\nor the circumstances of the particular case are such as to render that origin probable.", "text_hi": "81. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n; \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "82", "heading_en": "Presumption as to maps or plans made by authority of Government.—The Court shall", "text_en": "presume  that  maps  or  plans  purporting  to  be  made  by  the  authority  of  the  Central  Government  or  any\nState Government were so made, and are accurate; but maps or plans made for the purposes of any cause\nmust be proved to be accurate.", "text_hi": "82. \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "83", "heading_en": "Presumption as to collections of laws and reports of decisions.—The Court shall presume the", "text_en": "genuineness of, every book purporting to be printed or published under the authority of the Government\nof any country, and to contain any of the laws of that country, and of every book purporting to contain\nreports of decisions of the Courts of such country.", "text_hi": "83. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n, \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n;  \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "84", "heading_en": "Presumption as to powers-of-attorney.—The Court shall presume that every document", "text_en": "purporting to be a power-of-attorney, and to have been executed before, and authenticated by, a Notary\nPublic, or any Court, Judge, Magistrate, Indian Consul or Vice-Consul, or representative of the Central\nGovernment, was so executed and authenticated.", "text_hi": "84. \n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "85", "heading_en": "Presumption as to electronic agreements.—The Court shall presume that every electronic", "text_en": "record purporting to be an agreement containing the electronic or digital signature  of the parties was so\nconcluded by affixing the electronic or digital signature of the parties.", "text_hi": "85. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "86", "heading_en": "Presumption as to electronic records and electronic signatures.—(1) In any proceeding", "text_en": "involving a secure electronic record, the Court shall presume unless  contrary is proved, that the secure\nelectronic record has not been altered since the specific point of time to which the secure status relates.\n(2)  In  any  proceeding,  involving  secure  electronic  signature,  the  Court  shall  presume  unless  the\ncontrary is proved that—\n(a)  the  secure  electronic  signature  is  affixed  by  subscriber  with  the  intention  of  signing  or\napproving the electronic record;\n(b) except in the case of a secure electronic record or a secure electronic signature, nothing in this\nsection shall create any presumption, relating to authenticity and integrity of the electronic record or\nany electronic signature.", "text_hi": "86.  (1)\n\n,\n\n(2) \n\n,    \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "87", "heading_en": "Presumption as to Electronic Signature Certificates.—The Court shall presume, unless", "text_en": "contrary is proved, that the information listed in an Electronic Signature Certificate is correct, except for\ninformation  specified  as  subscriber  information  which  has  not  been  verified,  if  the  certificate  was\naccepted by the subscriber.", "text_hi": "87.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "88", "heading_en": "Presumption as to certified copies of foreign judicial records.—(1) The Court may presume", "text_en": "that any document purporting to be a certified copy of any judicial record of any country beyond India is\ngenuine and accurate, if the document purports to be certified in any manner which is certified by any\nrepresentative of the Central Government in or for such country to be the manner commonly in use in that\ncountry for the certification of copies of judicial records.\n(2) An officer who, with respect to any territory or place outside India is a Political Agent therefor, as\ndefined in clause (43) of section 3 of the General Clauses Act, 1897 (10 of 1897), shall, for the purposes\nof  this  section,  be  deemed  to  be  a  representative  of  the  Central  Government  in  and  for  the  country\ncomprising that territory or place.", "text_hi": "88. (1) \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "89", "heading_en": "Presumption as to books, maps and charts.—The Court may presume that any book to which it", "text_en": "may refer for information on matters of public or general interest, and that any published map or chart,\nthe  statements  of  which  are  relevant  facts,  and  which  is  produced  for  its  inspection,  was  written  and\npublished by the person, and at the time and place, by whom or at which it purports to have been written\nor published.", "text_hi": "89. \n\n,\n\n [", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "90", "heading_en": "Presumption as to electronic messages.—The Court may presume that an electronic message,", "text_en": "forwarded  by  the  originator  through  an  electronic  mail  server  to  the  addressee  to  whom  the  message\npurports to be addressed corresponds with the message as fed into his computer for transmission; but the\nCourt shall not make any presumption as to the person by whom such message was sent.", "text_hi": "90.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "91", "heading_en": "Presumption as to due execution, etc., of documents not produced.—The Court shall presume", "text_en": "that  every  document,  called  for  and  not  produced  after  notice  to  produce,  was  attested,  stamped  and\nexecuted in the manner required by law.", "text_hi": "91. \n\n,\n\n,\n\n,\n\n,\n\n;\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "92", "heading_en": "Presumption as to documents thirty years old.—Where any document, purporting or proved to", "text_en": "be thirty years old, is produced from any custody which the Court in the particular case considers proper,\nthe Court may presume that the signature and every other part of such document, which purports to be in\nthe handwriting of any particular person, is in that person’s handwriting, and, in the case of a document\nexecuted  or  attested,  that  it  was  duly  executed  and  attested  by  the  persons  by  whom  it  purports  to  be\nexecuted and attested.\nExplanation.—The Explanation to section 80 shall also apply to this section.\nIllustrations.\n(a) A has been in possession of landed property for a long time. He produces from his custody deeds\nrelating to the land showing his titles to it. The custody shall be proper.\n(b) A produces deeds relating to landed property of which he is the mortgagee. The mortgagor is in\npossession. The custody shall be proper.\n(c) A, a connection of B, produces deeds relating to lands in B's possession,  which were deposited\nwith him by B for safe custody. The custody shall be proper.", "text_hi": "92. \n\n,\n\n,\n\n,\n\n-\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "93", "heading_en": "Presumption as to electronic records five years old.—Where any electronic record, purporting", "text_en": "or  proved  to  be  five  years  old,  is  produced  from  any  custody  which  the  Court  in  the  particular  case\nconsiders proper, the Court may presume that the electronic signature which purports to be the electronic\nsignature of any particular person was so affixed by him or any person authorised by him in this behalf.\nExplanation.—The Explanation to section 81 shall also apply to this section.", "text_hi": "93. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "94", "heading_en": "Evidence of terms of contracts, grants and other dispositions of property reduced to form of", "text_en": "document.—When  the terms  of  a  contract, or of  a  grant,  or  of  any  other  disposition  of  property,  have\nbeen reduced to the form of a document, and in all cases in which any matter is required by law to be\nreduced  to the  form  of  a  document,  no  evidence  shall  be  given  in  proof  of  the terms  of  such  contract,\ngrant  or  other  disposition  of  property,  or  of  such  matter,  except  the  document  itself,  or  secondary\nevidence  of  its  contents  in  cases  in  which  secondary  evidence  is  admissible  under  the  provisions\nhereinbefore contained.\nException  1.—When  a  public  officer  is required  by  law  to  be  appointed  in  writing,  and  when  it  is\nshown that any particular person has acted as such officer, the writing by which he is appointed need not\nbe proved.\nException 2.—Wills admitted to probate in India may be proved by the probate.\nExplanation 1.—This section applies equally to cases in which the contracts, grants or dispositions of\nproperty  referred  to  are  contained  in  one  document,  and  to  cases  in  which  they  are  contained  in  more\ndocuments than one.\nExplanation 2.—Where there are more originals than one, one original only need be proved.\nExplanation 3.—The statement, in any document whatever, of a fact other than the facts referred to in\nthis section, shall not preclude the admission of oral evidence as to the same fact.\nIllustrations.\n(a) If a contract be contained in several letters, all the letters in which it is contained must be proved.\n(b) If a contract is contained in a bill of exchange, the bill of exchange must be proved.\n(c) If a bill of exchange is drawn in a set of three, one only need be proved.\n(d)  A  contracts,  in  writing,  with  B,  for  the  delivery  of  indigo  upon  certain  terms.  The  contract\nmentions the fact that B had paid A the price of other indigo contracted for verbally on another occasion.\nOral evidence is offered that no payment was made for the other indigo. The evidence is admissible.\n(e) A gives B a receipt for money paid by B. Oral evidence is offered of the payment. The evidence is\nadmissible.", "text_hi": "94. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "95", "heading_en": "Exclusion of evidence of oral agreement.—When the terms of any such contract, grant or other", "text_en": "disposition of property, or any matter required by law to be reduced to the form of a document, have been\nproved  according  to  section  94,  no  evidence  of  any  oral  agreement  or  statement  shall  be  admitted,  as\nbetween  the  parties  to  any  such  instrument  or  their  representatives  in  interest,  for  the  purpose  of\ncontradicting, varying, adding to, or subtracting from, its terms:\nProvided that any fact may be proved which would invalidate any document, or which would entitle\nany  person  to  any  decree  or  order  relating  thereto;  such  as  fraud,  intimidation,  illegality,  want  of  due\nexecution, want of capacity in any contracting party, want or failure of consideration, or mistake in fact\nor law:\nProvided  further  that  the  existence  of  any  separate  oral  agreement  as  to  any  matter  on  which  a\ndocument is silent, and which is not inconsistent with its terms, may be proved. In considering whether or\nnot this proviso applies, the Court shall have regard to the degree of formality of the document:\nProvided also that the existence of any separate oral agreement, constituting a condition precedent to\nthe attaching of any obligation under any such contract, grant or disposition of property, may be proved:\nProvided also that the existence of any distinct subsequent oral agreement to rescind or modify any\nsuch contract, grant or disposition of property,  may  be proved, except in cases in which such contract,\ngrant or disposition of property is by law required to be in writing, or has been registered according to the\nlaw in force for the time being as to the registration of documents:\nProvided also that any usage or custom by which incidents not expressly mentioned in any contract\nare usually annexed to contracts of that description, may be proved:\nProvided also that the annexing of such incident would not be repugnant to, or inconsistent with, the\nexpress terms of the contract:\nProvided also that any fact may be proved which shows in what manner the language of a document\nis related to existing facts.\nIllustrations.\n(a) A policy of insurance is effected on goods “in ships from Kolkata to Visakhapatnam”. The goods\nare shipped in a particular ship which is lost. The fact that particular ship was orally excepted from the\npolicy, cannot be proved.\n(b)  A  agrees  absolutely  in writing  to  pay  B  one  thousand rupees  on the 1st March,  2023. The fact\nthat, at the same time, an oral agreement was made that the money should not be paid till the 31st March,\n2023, cannot be proved.\n(c) An estate called “the Rampur tea estate” is sold by a deed which contains a map of the property\nsold. The fact that land not included in the map had always been regarded as part of the estate and was\nmeant to pass by the deed cannot be proved.\n(d)  A  enters  into  a  written  contract  with  B  to  work  certain  mines,  the  property  of  B,  upon  certain\nterms. A was induced to do so by a misrepresentation of B's as to their value. This fact may be proved.\n(e)  A  institutes  a  suit  against  B  for  the  specific  performance  of  a  contract,  and  also  prays  that  the\ncontract may be reformed as to one of its provisions, as that provision was inserted in it by mistake. A\nmay prove that such a mistake was made as would by law entitle him to have the contract reformed.\n(f) A orders goods of B by a letter in which nothing is said as to the time of payment, and accepts the\ngoods on delivery. B sues A for the price. A may show that the goods were supplied on credit for a term\nstill unexpired.\n(g) A sells B a horse and verbally warrants him sound. A gives B a paper in these words— “Bought\nof A a horse for thirty thousand rupees”. B may prove the verbal warranty.\n(h) A hires lodgings of B, and gives B a card on which is written— “Rooms, ten thousand rupees a\nmonth”. A may prove a verbal agreement that these terms were to include partial board. A hires lodging\nof B for a year, and a regularly stamped agreement, drawn up by an advocate, is made between them. It is\nsilent on the subject of board. A may not prove that board was included in the term verbally.\n(i) A applies to B for a debt due to A by sending a receipt for the money. B keeps the receipt and does\nnot send the money. In a suit for the amount, A may prove this.\n(j) A and B make a contract in writing to take effect upon the happening of a certain contingency.\nThe  writing  is  left  with  B  who  sues  A  upon  it.  A  may  show  the  circumstances  under  which  it  was\ndelivered.", "text_hi": "95. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "96", "heading_en": "Exclusion of evidence to explain or amend ambiguous document.—When the language used", "text_en": "in a document is, on its face, ambiguous or defective, evidence may not be given of facts which would\nshow its meaning or supply its defects.\nIllustrations.\n(a) A agrees, in writing, to sell a horse to B for “one lakh rupees or one lakh fifty thousand rupees”.\nEvidence cannot be given to show which price was to be given.\n(b)  A  deed  contains  blanks.  Evidence  cannot  be  given  of  facts  which  would  show  how  they  were\nmeant to be filled.", "text_hi": "96. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "97", "heading_en": "Exclusion of evidence against application of document to existing facts.—When language", "text_en": "used in a document is plain in itself, and when it applies accurately to existing facts, evidence may not be\ngiven to show that it was not meant to apply to such facts.\nIllustration.\nA  sells  to  B,  by  deed,  “my  estate  at  Rampur  containing  one  hundred  bighas”.  A  has  an  estate  at\nRampur containing one hundred bighas. Evidence may not be given of the fact that the estate meant to be\nsold was one situated at a different place and of a different size.", "text_hi": "97. \n\n-\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "98", "heading_en": "Evidence as to document unmeaning in reference to existing facts.—When language used in a", "text_en": "document  is  plain  in  itself,  but  is  unmeaning  in  reference  to  existing  facts,  evidence  may  be  given  to\nshow that it was used in a peculiar sense.\nIllustration.\nA sells to B, by deed, “my house in Kolkata”. A had no house in Kolkata, but it appears that he had a\nhouse at Howrah, of which B had been in possession since the execution of the deed. These facts may be\nproved to show that the deed related to the house at Howrah.", "text_hi": "98. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "99", "heading_en": "Evidence as to application of language which can apply to one only of several persons.—", "text_en": "When the facts are such that the language used might have been meant to apply to any one, and could not\nhave been meant to apply to more than one, of several persons or things, evidence may be given of facts\nwhich show which of those persons or things it was intended to apply to.\nIllustrations.\n(a)  A  agrees  to  sell  to  B,  for  one  thousand  rupees,  “my  white  horse”.  A  has  two  white  horses.\nEvidence may be given of facts which show which of them was meant.\n(b) A agrees to accompany B to Ramgarh. Evidence may be given of facts showing whether Ramgarh\nin Rajasthan or Ramgarh in Uttarakhand was meant.", "text_hi": "99. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "100", "heading_en": "Evidence as to application of language to one of two sets of facts, to neither of which the", "text_en": "whole correctly applies.—When the language used applies partly to one set of existing facts, and partly\nto another set of existing facts, but the whole of it does not apply correctly to either, evidence may be\ngiven to show to which of the two it was meant to apply.\nIllustration.\nA  agrees  to  sell  to  B  “my  land  at  X  in  the  occupation  of  Y”.  A  has  land  at  X,  but  not  in  the\noccupation of Y, and he has land in the occupation of Y but it is not at X. Evidence may be given of facts\nshowing which he meant to sell.", "text_hi": "100. \n\n-\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "101", "heading_en": "Evidence as to meaning of illegible characters, etc.—Evidence may be given to show the", "text_en": "meaning  of  illegible  or  not  commonly  intelligible  characters,  of  foreign,  obsolete,  technical,  local  and\nregional expressions, of abbreviations and of words used in a peculiar sense.\nIllustration.\nA,  sculptor,  agrees  to  sell  to  B,  “all  my  mods”.  A  has  both  models  and  modelling  tools.  Evidence\nmay be given to show which he meant to sell.", "text_hi": "101. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "102", "heading_en": "Who may give evidence of agreement varying terms of document.—Persons who are not", "text_en": "parties to a document, or their representatives in interest, may give evidence of any facts tending to show\na contemporaneous agreement varying the terms of the document.\nIllustration.\nA and B make a contract in writing that B shall sell A certain cotton, to be paid for on delivery. At\nthe same time, they make an oral agreement that three months’ credit shall be given to A. This could not\nbe shown as between A and B, but it might be shown by C, if it affected his interests.", "text_hi": "102. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "103", "heading_en": "Saving of provisions of Indian Succession Act relating to wills.—Nothing in this Chapter", "text_en": "shall be taken to affect any of the provisions of the Indian Succession Act, 1925 (39 of 1925) as to the\nconstruction of wills.\nPART IV\nPRODUCTION AND EFFECT OF EVIDENCE", "text_hi": "103. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "104", "heading_en": "Burden of proof.—Whoever desires any Court to give judgment as to any legal right or liability", "text_en": "dependent on the existence of facts which he asserts must prove that those facts exist, and when a person\nis bound to prove the existence of any fact, it is said that the burden of proof lies on that person.\nIllustrations.\n(a)  A  desires  a  Court  to  give  judgment  that  B  shall  be  punished  for  a  crime  which  A  says  B  has\ncommitted. A must prove that B has committed the crime.\n(b) A desires a Court to give judgment that he is entitled to certain land in the possession of B, by\nreason  of  facts  which  he  asserts,  and  which  B  denies,  to  be  true.  A  must  prove  the  existence  of  those\nfacts.", "text_hi": "104. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "105", "heading_en": "On whom burden of proof lies.—The burden of proof in a suit or proceeding lies on that", "text_en": "person who would fail if no evidence at all were given on either side.\nIllustrations.\n(a) A sues B for land of which B is in possession, and which, as A asserts, was left to A by the will of\nC,  B's  father.  If  no  evidence  were  given  on  either  side,  B  would  be  entitled  to  retain  his  possession.\nTherefore, the burden of proof is on A.\n(b) A sues B for money due on a bond. The execution of the bond is admitted, but B says that it was\nobtained  by  fraud,  which A  denies.  If  no  evidence were  given  on either  side, A  would  succeed, as the\nbond is not disputed and the fraud is not proved. Therefore, the burden of proof is on B.", "text_hi": "105. \n\n 515 \n\n,\n\n-\n\n-\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "106", "heading_en": "Burden of proof as to particular fact.—The burden of proof as to any particular fact lies on", "text_en": "that  person  who  wishes  the  Court  to  believe  in  its  existence,  unless  it  is  provided  by  any  law  that  the\nproof of that fact shall lie on any particular person.\nIllustration.\nA prosecutes B for theft, and wishes the Court to believe that B admitted the theft to C. A must prove\nthe  admission.  B  wishes  the  Court  to  believe  that,  at  the  time  in  question,  he  was  elsewhere.  He  must\nprove it.", "text_hi": "106.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "107", "heading_en": "Burden of proving fact to be proved to make evidence admissible.—The burden of proving", "text_en": "any fact necessary to be proved in order to enable any person to give evidence of any other fact is on the\nperson who wishes to give such evidence.\nIllustrations.\n(a) A wishes to prove a dying declaration by B. A must prove B's death.\n(b) A wishes to prove, by secondary evidence, the contents of a lost document. A must prove that the\ndocument has been lost.", "text_hi": "107.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "108", "heading_en": "Burden of proving that case of accused comes within exceptions.—When a person is accused", "text_en": "of any offence, the burden of proving the existence of circumstances bringing the case within any of the\nGeneral  Exceptions  in  the  Bharatiya  Nyaya  Sanhita,  2023  or  within  any  special  exception  or  proviso\ncontained in any other part of the said Sanhita, or in any law defining the offence, is upon him, and the\nCourt shall presume the absence of such circumstances.\nIllustrations.\n(a) A, accused of murder, alleges that, by reason of unsoundness of mind, he did not know the nature\nof the act. The burden of proof is on A.\n(b)  A,  accused  of  murder,  alleges  that,  by  grave  and  sudden  provocation,  he  was  deprived  of  the\npower of self-control. The burden of proof is on A.\n(c) Section  117 of  the  Bharatiya  Nyaya  Sanhita,  2023  provides  that  whoever,  except  in  the  case\nprovided for by sub-section (2) of section 122, voluntarily causes grievous hurt, shall be subject to certain\npunishments.  A  is  charged  with  voluntarily  causing  grievous  hurt  under  section  117.  The  burden  of\nproving the circumstances bringing the case under sub-section (2) of section 122 lies on A.", "text_hi": "108. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "109", "heading_en": "Burden of proving fact especially within knowledge.—When any fact is especially within the", "text_en": "knowledge of any person, the burden of proving that fact is upon him.\nIllustrations.\n(a)  When  a  person  does  an  act  with  some  intention  other  than  that  which  the  character  and\ncircumstances of the act suggest, the burden of proving that intention is upon him.\n(b) A is charged with travelling on a railway without a ticket. The burden of proving that he had a\nticket is on him.", "text_hi": "109. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "110", "heading_en": "Burden of proving death of person known to have been alive within thirty years.—When", "text_en": "the question is whether a man is alive or dead, and it is shown that he was alive within thirty years, the\nburden of proving that he is dead is on the person who affirms it.", "text_hi": "110.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "111", "heading_en": "Burden of proving that person is alive who has not been heard of for seven years.—When", "text_en": "the question is whether a man is alive or dead, and it is proved that he has not been heard of for seven\nyears by those who would naturally have heard of him if he had been alive, the burden of proving that he\nis alive is shifted to the person who affirms it.", "text_hi": "111. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n  ,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "112", "heading_en": "Burden of proof as to relationship in the cases of partners, landlord and tenant, principal", "text_en": "and  agent.—When  the  question  is  whether  persons  are  partners,  landlord  and  tenant,  or  principal  and\nagent, and it has been shown that they have been acting as such, the burden of proving that they do not\nstand,  or  have  ceased  to  stand,  to  each  other  in  those  relationships  respectively,  is  on  the  person  who\naffirms it.", "text_hi": "112. \n\n,\n\n,\n\n,\n\n-\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "113", "heading_en": "Burden of proof as to ownership.—When the question is whether any person is owner of", "text_en": "anything of which he is shown to be in possession, the burden of proving that he is not the owner is on\nthe person who affirms that he is not the owner.", "text_hi": "113.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "114", "heading_en": "Proof of good faith in transactions where one party is in relation of active confidence.—", "text_en": "Where there is a question as to the good faith of a transaction between parties, one of whom stands to the\nother in a position of active confidence, the burden of proving the good faith of the transaction is on the\nparty who is in a position of active confidence.\nIllustrations.\n(a) The good faith of a sale by a client to an advocate is in question in a suit brought by the client.\nThe burden of proving the good faith of the transaction is on the advocate.\n(b) The good faith of a sale by a son just come of age to a father is in question in a suit brought by the\nson. The burden of proving the good faith of the transaction is on the father.", "text_hi": "114. \n\n,\n\n-\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "115", "heading_en": "Presumption as to certain offences.—(1) Where a person is accused of having committed any", "text_en": "offence specified in sub-section (2), in—\n(a)  any  area  declared  to  be  a  disturbed  area  under  any  enactment  for  the  time  being  in  force,\nmaking provision for the suppression of disorder and restoration and maintenance of public order; or\n(b)  any  area  in  which  there  has  been,  over  a  period  of  more  than  one  month,  extensive\ndisturbance of the public peace,\nand it is shown that such person had been at a place in such area at a time when firearms or explosives\nwere used at or from that place to attack or resist the members of any armed forces or the forces charged\nwith the maintenance of public order acting in the discharge of their duties, it shall be presumed, unless\nthe contrary is shown, that such person had committed such offence.\n(2) The offences referred to in sub-section (1) are the following, namely:—\n(a) an offence under section 147, section 148, section 149 or section 150 of the Bharatiya Nyaya\nSanhita, 2023;\n(b)  criminal  conspiracy  or  attempt  to  commit,  or  abetment  of,  an  offence  under section\n149 or section 150 of the Bharatiya Nyaya Sanhita, 2023.", "text_hi": "115. (1)\n\n,\n\n (2)\n\n,\n\n,\n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "116", "heading_en": "Birth during marriage, conclusive proof of legitimacy.—The fact that any person was born", "text_en": "during the continuance of a valid marriage between his mother and any man, or within two hundred and\neighty days after its dissolution, the mother remaining unmarried, shall be conclusive proof that he is the\nlegitimate child of that man, unless it can be shown that the parties to the marriage had no access to each\nother at any time when he could have been begotten.", "text_hi": "116.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "117", "heading_en": "Presumption as to abetment of suicide by a married woman.—When the question is whether", "text_en": "the commission of suicide by a woman had been abetted by her husband or any relative of her husband\nand  it  is  shown  that  she  had  committed  suicide  within  a  period  of  seven  years  from  the  date  of  her\nmarriage and that her husband or such relative of her husband had subjected her to cruelty, the Court may\npresume, having regard to all the other circumstances of the case, that such suicide had been abetted by\nher husband or by such relative of her husband.\nExplanation.—For  the  purposes  of  this  section,  “cruelty”  shall  have  the  same  meaning  as  in\nsection 86 of the Bharatiya Nyaya Sanhita, 2023.", "text_hi": "117", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "118", "heading_en": "Presumption as to dowry death.—When the question is whether a person has committed the", "text_en": "dowry death of a woman and it is shown that soon before her death, such woman had been subjected by\nsuch person to cruelty or harassment for, or in connection with, any demand for dowry, the Court shall\npresume that such person had caused the dowry death.\nExplanation.—For  the  purposes  of  this  section,  “dowry  death”  shall  have  the  same  meaning  as\nin section 80 of the Bharatiya Nyaya Sanhita, 2023.", "text_hi": "118. \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "119", "heading_en": "Court may presume existence of certain facts.—(1) The Court may presume the existence of", "text_en": "any  fact  which  it  thinks  likely  to  have  happened,  regard  being  had  to  the  common  course  of  natural\nevents, human conduct and public and private business, in their relation to the facts of the particular case.\nThe Court may presume that—\nIllustrations.\n(a)  a  man  who  is  in  possession  of  stolen  goods  soon,  after  the  theft  is  either  the  thief  or  has\nreceived the goods knowing them to be stolen, unless he can account for his possession;\n(b) an accomplice is unworthy of credit, unless he is corroborated in material particulars;\n(c) a bill of exchange, accepted or endorsed, was accepted or endorsed for good consideration;\n(d) a thing or state of things which has been shown to be in existence within a period shorter than\nthat within which such things or state of things usually cease to exist, is still in existence;\n(e) judicial and official acts have been regularly performed;\n(f) the common course of business has been followed in particular cases;\n(g)  evidence  which  could  be  and  is  not  produced  would,  if  produced,  be  unfavourable  to  the\nperson who withholds it;\n(h) if a man refuses to answer a question which he is not compelled to answer by law, the answer,\nif given, would be unfavourable to him;\n(i) when a document creating an obligation is in the hands of the obligor, the obligation has been\ndischarged.\n(2)  The  Court  shall  also  have  regard  to  such  facts  as  the  following,  in  considering  whether  such\nmaxims do or do not apply to the particular case before it:—\n(i) as to Illustration (a)—a shop-keeper has in his bill a marked rupee soon after it was stolen,\nand cannot account for its possession specifically, but is continually receiving rupees in the course of\nhis business;\n(ii) as to Illustration (b) —A, a person of the highest character, is tried for causing a man's death\nby an act of negligence in arranging certain machinery. B, a person of equally good character, who\nalso  took  part  in  the  arrangement,  describes  precisely  what  was  done,  and  admits  and  explains the\ncommon carelessness of A and himself;\n(iii)  as  to  Illustration  (b)  —a  crime  is  committed  by  several  persons.  A,  B  and  C,  three  of  the\ncriminals, are captured on the spot and kept apart from each other. Each gives an account of the crime\nimplicating  D,  and  the  accounts  corroborate  each  other  in  such  a  manner  as  to  render  previous\nconcert highly improbable;\n(iv)  as  to  Illustration  (c)—A,  the  drawer  of  a  bill  of  exchange,  was  a  man  of  business.  B,  the\nacceptor, was a young and ignorant person, completely under A's influence;\n(v) as to Illustration (d)—it is proved that a river ran in a certain course five years ago, but it is\nknown that there have been floods since that time which might change its course;\n(vi)  as  to  Illustration  (e)—a  judicial  act,  the  regularity  of  which  is  in  question,  was  performed\nunder exceptional circumstances;\n(vii) as to Illustration (f)—the question is, whether a letter was received. It is shown to have been\nposted, but the usual course of the post was interrupted by disturbances;\n(viii) as to Illustration (g)—a man refuses to produce a document which would bear on a contract\nof small importance on which he is sued, but which might also injure the feelings and reputation of\nhis family;\n(ix) as to Illustration (h)—a man refuses to answer a question which he is not compelled by law\nto  answer,  but  the  answer  to  it  might  cause  loss  to  him  in  matters  unconnected  with  the  matter  in\nrelation to which it is asked;\n(x) as to Illustration (i)—a bond is in possession of the obligor, but the circumstances of the case\nare such that he may have stolen it.", "text_hi": "119.  (1) \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "120", "heading_en": "Presumption as to absence of consent in certain prosecution for rape.—In a prosecution for", "text_en": "rape under sub-section (2) of section 64 of the Bharatiya Nyaya Sanhita, 2023, where sexual intercourse\nby the accused is proved and the question is whether it was without the consent of the woman alleged to\nhave  been  raped and such woman  states in  her  evidence  before the  Court that she  did  not consent,  the\nCourt shall presume that she did not consent.\nExplanation.—In  this  section,  “sexual  intercourse”  shall  mean  any  of  the  acts  mentioned  in\nsection 63 of the Bharatiya Nyaya Sanhita, 2023.", "text_hi": "120. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "121", "heading_en": "Estoppel.—When one person has, by his declaration, act or omission, intentionally caused or", "text_en": "permitted  another  person  to  believe  a  thing  to  be  true  and  to  act  upon  such  belief,  neither  he  nor  his\nrepresentative  shall  be  allowed,  in  any  suit  or  proceeding  between  himself  and  such  person  or  his\nrepresentative, to deny the truth of that thing.\nIllustration.\nA intentionally and falsely leads B to believe that certain land belongs to A, and thereby induces B to\nbuy and pay for it. The land afterwards becomes the property of A, and A seeks to set aside the sale on\nthe ground that, at the time of the sale, he had no title. He must not be allowed to prove his want of title.", "text_hi": "121. \n\n,\n\n,\n\n,\n\n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "122", "heading_en": "Estoppel of tenant and of licensee of person in possession.—No tenant of immovable", "text_en": "property, or person claiming through such tenant, shall, during the continuance of the tenancy or any time\nthereafter, be permitted to deny that the landlord of such tenant had, at the beginning of the tenancy, a\ntitle to such immovable property; and no person who came upon any immovable property by the licence\nof  the  person  in  possession  thereof  shall  be  permitted  to  deny  that  such  person  had  a  title  to  such\npossession at the time when such licence was given.", "text_hi": "122. \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "123", "heading_en": "Estoppel of acceptor of bill of exchange, bailee or licensee.—No acceptor of a bill of", "text_en": "exchange shall be permitted to deny that the drawer had authority to draw such bill or to endorse it; nor\nshall  any  bailee  or  licensee  be  permitted  to  deny  that  his  bailor  or  licensor  had,  at  the  time  when  the\nbailment or licence commenced, authority to make such bailment or grant such licence.\nExplanation 1.—The acceptor of a bill of exchange may deny that the bill was really drawn by the\nperson by whom it purports to have been drawn.\nExplanation 2.—If a bailee delivers the goods bailed to a person other than the bailor, he may prove\nthat such person had a right to them as against the bailor.", "text_hi": "123. \n\n-\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "124", "heading_en": "Who may testify.—All persons shall be competent to testify unless the Court considers that", "text_en": "they are prevented from understanding the questions put to them, or from giving rational answers to those\nquestions, by tender years, extreme old age, disease, whether of body or mind, or any other cause of the\nsame kind.\nExplanation.—A person of unsound mind is not incompetent to testify, unless he is prevented by his\nunsoundness of mind from understanding the questions put to him and giving rational answers to them.", "text_hi": "124. \n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "125", "heading_en": "Witness unable to communicate verbally.—A witness who is unable to speak may give his", "text_en": "evidence  in  any  other  manner in  which  he  can  make  it  intelligible,  as  by  writing  or  by  signs;  but such\nwriting must be written and the signs made in open Court and evidence so given shall be deemed to be\noral evidence:\nProvided that if the witness is unable to communicate verbally, the Court shall take the assistance of\nan interpreter or a special educator in recording the statement, and such statement shall be videographed.", "text_hi": "125. \n\n,\n\n,\n\n  ,\n\n,\n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "126", "heading_en": "Competency of husband and wife as witnesses in certain cases.—(1) In all civil proceedings", "text_en": "the parties to the suit, and the husband or wife of any party to the suit, shall be competent witnesses.\n(2)  In  criminal  proceedings  against  any  person,  the  husband  or  wife  of  such  person,  respectively,\nshall be a competent witness.", "text_hi": "126. (1) \n\n(2) \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "127", "heading_en": "Judges and Magistrates.—No Judge or Magistrate shall, except upon the special order of some", "text_en": "Court to which he is subordinate, be compelled to answer any question as to his own conduct in Court as\nsuch  Judge  or  Magistrate,  or  as  to  anything  which  came  to  his  knowledge  in  Court  as  such  Judge  or\nMagistrate; but he may be examined as to other matters which occurred in his presence whilst he was so\nacting.\nIllustrations.\n(a) A, on his trial before the Court of Session, says that a deposition was improperly taken by B, the\nMagistrate.  B  cannot  be  compelled  to  answer  questions  as  to  this,  except  upon  the  special  order  of  a\nsuperior Court.\n(b) A is accused before the Court of Session of having given false evidence before B, a Magistrate. B\ncannot be asked what A said, except upon the special order of the superior Court.\n(c) A is accused before the Court of Session of attempting to murder a police officer whilst on his\ntrial before B, a Sessions Judge. B may be examined as to what occurred.", "text_hi": "127. \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "128", "heading_en": "Communications during marriage.—No person who is or has been married, shall be", "text_en": "compelled to disclose any communication made to him during marriage by any person to whom he is or\nhas been married; nor shall he be permitted to disclose any such communication, unless the person who\nmade  it,  or  his  representative  in  interest,  consents,  except  in  suits  between  married  persons,  or\nproceedings in which one married person is prosecuted for any crime committed against the other.", "text_hi": "128. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "129", "heading_en": "Evidence as to affairs of State.—No one shall be permitted to give any evidence derived from", "text_en": "unpublished official records relating to any affairs of State,  except with the permission of the officer at\nthe head of the department concerned, who shall give or withhold such permission as he thinks fit.", "text_hi": "129. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "130", "heading_en": "Official communications.—No public officer shall be compelled to disclose communications", "text_en": "made  to  him  in  official  confidence,  when  he  considers  that  the  public  interests  would  suffer  by  the\ndisclosure.", "text_hi": "130. \n\n 131.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "132", "heading_en": "Professional communications.—(1) No advocate, shall at any time be permitted, unless with", "text_en": "his  client’s  express  consent,  to  disclose  any  communication  made  to  him  in  the  course  and  for  the\npurpose of his service as such advocate, by or on behalf of his client, or to state the contents or condition\nof  any  document  with  which  he  has  become  acquainted  in  the  course  and  for  the  purpose  of  his\nprofessional service, or to disclose any advice given by him to his client in the course and for the purpose\nof such service:\nProvided that nothing in this section shall protect from disclosure of—\n(a) any such communication made in furtherance of any illegal purpose;\n(b)  any  fact  observed  by  any  advocate,  in  the  course  of  his  service  as  such,  showing  that  any\ncrime or fraud has been committed since the commencement of his service.\n(2)  It  is  immaterial  whether  the  attention  of  such  advocate  referred  to  in  the  proviso  to\nsub-section (1), was or was not directed to such fact by or on behalf of his client.\nExplanation.—The  obligation  stated  in  this  section  continues  after  the  professional  service  has\nceased.\nIllustrations.\n(a) A, a client, says to B, an advocate— “I have committed forgery, and I wish you to defend me”.\nAs the defence of a man known to be guilty is not a criminal purpose, this communication is protected\nfrom disclosure.\n(b)  A,  a  client,  says  to  B,  an  advocate—  “I  wish  to  obtain  possession  of  property  by  the  use  of  a\nforged deed on which I request you to sue”. This communication, being made in furtherance of a criminal\npurpose, is not protected from disclosure.\n(c) A, being charged with embezzlement, retains B, an advocate, to defend him. In the course of the\nproceedings, B observes that an entry has been made in A’s account book, charging A with the sum said\nto  have  been  embezzled,  which  entry  was  not  in  the  book  at  the  commencement  of  his  professional\nservice.  This  being  a  fact  observed  by  B  in  the  course  of  his  service,  showing  that  a  fraud  has  been\ncommitted since the commencement of the proceedings, it is not protected from disclosure.\n(3)  The  provisions  of  this  section  shall  apply  to  interpreters,  and  the  clerks  or  employees  of\nadvocates.", "text_hi": "132. (1) \n\n,\n\n,\n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "133", "heading_en": "Privilege not waived by volunteering evidence.—If any party to a suit gives evidence therein", "text_en": "at his own instance or otherwise, he shall not be deemed to have consented thereby to such disclosure as\nis  mentioned  in  section  132;  and,  if  any  party  to  a  suit  or  proceeding  calls  any  such  advocate,  as  a\nwitness, he shall be deemed to have consented to such disclosure only if he questions such advocate, on\nmatters which, but for such question, he would not be at liberty to disclose.", "text_hi": "133. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "134", "heading_en": "Confidential communication with legal advisers.—No one shall be compelled to disclose to", "text_en": "the  Court  any  confidential  communication  which  has  taken  place  between  him  and  his  legal  adviser,\nunless  he  offers  himself  as  a  witness,  in  which  case  he  may  be  compelled  to  disclose  any  such\ncommunications  as  may  appear  to  the  Court  necessary  to  be  known  in  order  to  explain  any  evidence\nwhich he has given, but no others.", "text_hi": "134.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "135", "heading_en": "Production of title-deeds of witness not a party.—No witness who is not a party to a suit shall", "text_en": "be compelled to produce his title-deeds to any property, or any document in virtue of which he holds any\nproperty as pledgee or mortgagee or any document the production of which might tend to criminate him,\nunless he has agreed in writing to produce them with the person seeking the production of such deeds or\nsome person through whom he claims.", "text_hi": "135. \n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "136", "heading_en": "Production of documents or electronic records which another person, having possession,", "text_en": "could  refuse  to  produce.—No  one  shall  be  compelled  to  produce  documents  in  his  possession  or\nelectronic records under his control, which any other person would be entitled to refuse to produce if they\nwere in his possession or control, unless such last-mentioned person consents to their production.", "text_hi": "136. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "137", "heading_en": "Witness not excused from answering on ground that answer will criminate.—A witness", "text_en": "shall not be excused from answering any question as to any matter relevant to the matter in issue in any\nsuit  or  in  any  civil  or  criminal  proceeding,  upon  the  ground  that  the  answer  to  such  question  will\ncriminate,  or  may  tend  directly  or  indirectly  to  criminate,  such  witness,  or  that  it  will  expose,  or  tend\ndirectly or indirectly to expose, such witness to a penalty or forfeiture of any kind:\nProvided that no such answer, which a witness shall be compelled to give, shall subject him to any\narrest or prosecution, or be proved against him in any criminal proceeding, except a prosecution forgiving\nfalse evidence by such answer.", "text_hi": "137. \n\n,\n\n,\n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "138", "heading_en": "Accomplice.—An accomplice shall be a competent witness against an accused person; and a", "text_en": "conviction is not illegal if it proceeds upon the corroborated testimony of an accomplice.", "text_hi": "138. \n\n-\n\n,\n\n,\n\n-", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "139", "heading_en": "Number of witnesses.—No particular number of witnesses shall in any case be required for the", "text_en": "proof of any fact.", "text_hi": "139.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "140", "heading_en": "Order of production and examination of witnesses.—The order in which witnesses are", "text_en": "produced and examined shall be regulated by the law and practice for the time being relating to civil and\ncriminal procedure respectively, and, in the absence of any such law, by the discretion of the Court.", "text_hi": "140.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "141", "heading_en": "Judge to decide as to admissibility of evidence.—(1) When either party proposes to give", "text_en": "evidence  of  any  fact,  the  Judge  may  ask  the  party  proposing  to  give  the  evidence  in  what  manner  the\nalleged fact, if proved, would be relevant; and the Judge shall admit the evidence if he thinks that the fact,\nif proved, would be relevant, and not otherwise.\n(2) If the fact proposed to be proved is one of which evidence is admissible only upon proof of some\nother fact, such last mentioned fact must be proved before evidence is given  of the fact first mentioned,\nunless the party undertakes to give proof of such fact, and the Court is satisfied with such undertaking.\n(3)  If  the  relevancy  of  one  alleged  fact  depends  upon  another  alleged  fact  being  first  proved,  the\nJudge may, in his discretion, either permit evidence of the first fact to be given before the second fact is\nproved, or require evidence to be given of the second fact before evidence is given of the first fact.\nIllustrations.\n(a) It is proposed to prove a statement about a relevant fact by a person alleged to be dead, which\nstatement  is  relevant  under  section  26.  The  fact  that  the  person  is  dead  must  be  proved  by  the  person\nproposing to prove the statement, before evidence is given of the statement.\n(b) It is proposed to prove, by a copy, the contents of a document said to be lost. The fact that the\noriginal is lost must be proved by the person proposing to produce the copy, before the copy is produced.\n(c) A is accused of receiving stolen property knowing it to have been stolen. It is proposed to prove\nthat he denied the possession of the property. The relevancy of the denial depends on the identity of the\nproperty. The Court may, in its discretion, either require the property to be identified before the denial of\nthe  possession  is  proved,  or  permit  the  denial  of  the  possession  to  be  proved  before  the  property  is\nidentified.\n(d) It is proposed to prove a fact A which is said to have been the cause or effect of a fact in issue.\nThere are several intermediate facts B, C and D which must be shown to exist before the fact A can be\nregarded as the cause or effect of the fact in issue. The Court may either permit A to be proved before B,\nC or D is proved, or may require proof of B, C and D before permitting proof of A.", "text_hi": "141. (1) \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "142", "heading_en": "Examination of witnesses.—(1) The examination of a witness by the party who calls him shall", "text_en": "be called his examination-in-chief.\n(2) The examination of a witness by the adverse party shall be called his cross-examination.\n(3) The examination of a witness, subsequent to the cross-examination, by the party who called him,\nshall be called his re-examination.", "text_hi": "142.  (1) \n\n(2) \n\n(3) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "143", "heading_en": "Order of examinations.—(1) Witnesses shall be first examined-in-chief, then (if the adverse", "text_en": "party so desires) cross-examined, then (if the party calling him so desires) re-examined.\n(2)  The  examination-in-chief  and  cross-examination  must  relate  to  relevant  facts,  but  the\ncross-examination need not be confined to the facts to which the witness testified on his examination-in-\nchief.\n(3)  The  re-examination  shall  be  directed\nto\nthe  explanation  of  matters  referred\nto\nin\ncross-examination; and, if new matter is, by permission of the Court, introduced in re-examination, the\nadverse party may further cross-examine upon that matter.", "text_hi": "143.  (1) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n(3)\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "144", "heading_en": "Cross-examination of person called to produce a document.—A person summoned to", "text_en": "produce  a  document  does  not  become  a  witness  by  the  mere  fact  that  he  produces  it,  and  cannot  be\ncross-examined unless and until he is called as a witness.", "text_hi": "144.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "145", "heading_en": "Witnesses to character.—Witnesses to character may be cross-examined and re-examined.", "text_en": "", "text_hi": "145. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "146", "heading_en": "Leading questions.—(1) Any question suggesting the answer which the person putting it", "text_en": "wishes or expects to receive, is called a leading question.\n(2)  Leading  questions  must  not,  if  objected  to  by  the  adverse  party,  be  asked  in  an\nexamination-in-chief, or in a re-examination, except with the permission of the Court.\n(3) The Court shall permit leading questions as to matters which are  introductory or undisputed, or\nwhich have, in its opinion, been already sufficiently proved.\n(4) Leading questions may be asked in cross-examination.", "text_hi": "146. (1) \n\n,\n\n(2) \n\n(3) \n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "147", "heading_en": "Evidence as to matters in writing.—Any witness may be asked, while under examination,", "text_en": "whether any contract, grant or other disposition of property, as to which he is giving evidence, was not\ncontained  in  a  document,  and  if  he  says  that  it  was,  or  if  he  is  about  to  make  any  statement  as  to  the\ncontents of any document, which, in the opinion of the Court, ought to be produced, the adverse party\nmay object to such evidence being given until such document is produced, or until facts have been proved\nwhich entitle the party who called the witness to give secondary evidence of it.\nExplanation.—A  witness  may  give  oral  evidence  of  statements  made  by  other  persons  about  the\ncontents of documents if such statements are in themselves relevant facts.\nIllustration.\nThe  question  is,  whether  A  assaulted  B.  C  deposes  that  he  heard  A  say  to  D—  “B  wrote  a  letter\naccusing me of theft, and I will be revenged on him”. This statement is relevant, as showing A's motive\nfor the assault, and evidence may be given of it, though no other evidence is given about the letter.", "text_hi": "147. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n  ]", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "148", "heading_en": "Cross-examination as to previous statements in writing.—A witness may be cross-examined", "text_en": "as  to  previous  statements  made  by  him  in  writing  or  reduced  into  writing,  and  relevant  to  matters  in\nquestion, without such writing being shown to him, or being proved; but, if it is intended to contradict\nhim  by  the  writing,  his  attention  must,  before  the  writing  can  be  proved,  be  called  to  those  parts  of  it\nwhich are to be used for the purpose of contradicting him.", "text_hi": "148. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "149", "heading_en": "Questions lawful in cross-examination.—When a witness is cross-examined, he may, in", "text_en": "addition to the questions hereinbefore referred to, be asked any questions which tend—\n(a) to test his veracity; or\n(b) to discover who he is and what is his position in life; or\n(c) to shake his credit, by injuring his character, although the answer to such questions might tend\ndirectly or indirectly to criminate him, or might expose or tend directly or indirectly to expose him to\na penalty or forfeiture:\nProvided\nthat\nin  a  prosecution  for  an  offence  under section  64, section  65, section  66,\nsection  67, section  68, section  69, section  70 or section  71 of  the  Bharatiya  Nyaya  Sanhita,  2023  or  for\nattempt to commit any such offence, where the question of consent is an issue, it shall not be permissible\nto adduce evidence or to put questions in the cross-examination of the victim as to the general immoral\ncharacter, or previous sexual experience, of such victim with any person for proving such consent or the\nquality of consent.", "text_hi": "149. \n\n(\n\n(\n\n)\n\n)\n\n(\n\n)\n\n;\n\n,\n\n,\n\n 68,\n\n 69,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "150", "heading_en": "When witness to be compelled to answer.—If any such question relates to a matter relevant to", "text_en": "the suit or proceeding, the provisions of section 137 shall apply thereto.", "text_hi": "150", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "151", "heading_en": "Court to decide when question shall be asked and when witness compelled to", "text_en": "answer.—(1) If any such question relates to a matter not relevant to the suit or proceeding, except in so\nfar as it affects the credit of the witness by injuring his character, the Court shall decide whether or not\nthe  witness  shall  be  compelled  to  answer  it,  and  may,  if  it  thinks  fit,  warn  the  witness  that  he  is  not\nobliged to answer it.\n(2)  In  exercising  its  discretion,  the  Court  shall  have  regard  to  the  following  considerations,\nnamely:—\n(a) such questions are proper if they are of such a nature that the truth of the imputation conveyed\nby  them  would  seriously  affect  the  opinion  of  the  Court  as  to  the  credibility  of  the  witness  on  the\nmatter to which he testifies;\n(b) such questions are improper if the imputation which they convey relates to matters so remote\nin time, or of such a character, that the truth of the imputation would not affect, or would affect in a\nslight degree, the opinion of the Court as to the credibility of the witness on the matter to which he\ntestifies;\n(c)  such  questions  are  improper if there  is  a  great  disproportion between the  importance  of  the\nimputation made against the witness's character and the importance of his evidence;\n(d) the Court may, if it sees fit, draw, from the witness’s refusal to answer, the inference that the\nanswer if given would be unfavourable.", "text_hi": "151. (1)\n\n,\n\n,\n\n,\n\n,\n\n(2)\n\n, \n\n(\n\n)\n\n(\n\n)\n\n(\n\n)\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n;  \n\n,\n\n,\n\n; \n\n,\n\n;", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "152", "heading_en": "Question not to be asked without reasonable grounds.—No such question as is referred to in", "text_en": "section 151 ought to be asked, unless the person asking it has reasonable grounds for thinking that the\nimputation which it conveys is well-founded.\nIllustrations.\n(a)  An  advocate  is  instructed  by  another  advocate  that  an  important  witness  is  a  dacoit.  This  is  a\nreasonable ground for asking the witness whether he is a dacoit.\n(b)  An  advocate  is  informed  by  a  person  in  Court  that  an  important  witness  is  a  dacoit.  The\ninformant,  on  being  questioned  by  the  advocate,  gives  satisfactory  reasons  for  his  statement.  This  is  a\nreasonable ground for asking the witness whether he is a dacoit.\n(c) A witness, of whom nothing whatever is known, is asked at random whether he is a dacoit. There\nare here no reasonable grounds for the question.\n(d)  A  witness,  of  whom  nothing  whatever  is  known,  being  questioned  as  to  his  mode  of  life  and\nmeans of living, gives unsatisfactory answers. This may be a reasonable ground for asking him if he is a\ndacoit.", "text_hi": "152. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "153", "heading_en": "Procedure of Court in case of question being asked without reasonable", "text_en": "grounds.—If the Court is of opinion that any such question was asked without reasonable grounds, it\nmay,  if  it  was  asked  by  any  advocate,  report  the  circumstances  of  the  case  to  the  High  Court  or  other\nauthority to which such advocate is subject in the exercise of his profession.", "text_hi": "153.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "154", "heading_en": "Indecent and scandalous questions.—The Court may forbid any questions or inquiries", "text_en": "which it regards as indecent or scandalous, although such questions or inquiries may have some bearing\non the questions before the Court, unless they relate to facts in issue, or to matters necessary to be known\nin order to determine whether or not the facts in issue existed.", "text_hi": "154.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "155", "heading_en": "Questions intended to insult or annoy.—The Court shall forbid any question which", "text_en": "appears  to  it  to  be  intended  to  insult  or  annoy,  or  which,  though  proper  in  itself,  appears  to  the  Court\nneedlessly offensive in form.", "text_hi": "155.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "156", "heading_en": "Exclusion of evidence to contradict answers to questions testing veracity.—When a", "text_en": "witness has been asked and has answered any question which is relevant to the inquiry only in so far as it\ntends to shake his credit by injuring his character, no evidence shall be given to contradict him; but, if he\nanswers falsely, he may afterwards be charged with giving false evidence.\nException  1.—If  a  witness  is  asked  whether  he  has  been  previously  convicted  of  any  crime  and\ndenies it, evidence may be given of his previous conviction.\nException 2.—If a witness is asked any question tending to impeach his impartiality, and answers it\nby denying the facts suggested, he may be contradicted.\nIllustrations.\n(a) A claim against an underwriter is resisted on the ground of fraud. The claimant is asked whether,\nin a former transaction, he had not made a fraudulent claim. He denies it. Evidence is offered to show that\nhe did make such a claim. The evidence is inadmissible.\n(b) A witness is asked whether he was not dismissed from a situation for dishonesty. He denies it.\nEvidence is offered to show that he was dismissed for dishonesty. The evidence is not admissible.\n(c) A affirms that on a certain day he saw B at Goa. A is asked whether he himself was not on that\nday  at  Varanasi.  He  denies  it.  Evidence  is  offered  to  show  that  A  was  on  that  day  at  Varanasi.  The\nevidence is admissible, not as contradicting A on a fact which affects his credit, but as contradicting the\nalleged fact that B was seen on the day in question in Goa. In each of these cases, the witness might, if his\ndenial was false, be charged with giving false evidence.\n(d) A is asked whether his family has not had a blood feud with the family of B against whom he\ngives evidence. He denies it. He may be contradicted on the ground that the question tends to impeach his\nimpartiality.", "text_hi": "156.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "157", "heading_en": "Question by party to his own witness.—(1) The Court may, in its discretion, permit the", "text_en": "person who calls a witness to put any question to him which might be put in cross-examination by the\nadverse party.\n(2) Nothing in this section shall disentitle the person so permitted under sub-section (1), to rely on\nany part of the evidence of such witness.", "text_hi": "157. (1) \n\n,\n\n(2)", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "158", "heading_en": "Impeaching credit of witness.—The credit of a witness may be impeached in the following", "text_en": "ways by the adverse party, or, with the consent of the Court, by the party who calls him—\n(a) by the evidence of persons who testify that they, from their knowledge of the witness, believe\nhim to be unworthy of credit;\n(b) by proof that the witness has been bribed, or has accepted the offer of a bribe, or has received\nany other corrupt inducement to give his evidence;\n(c) by proof of former statements inconsistent with any part of his evidence which is liable to be\ncontradicted.\nExplanation.—A  witness  declaring  another  witness  to  be  unworthy  of  credit  may  not,  upon  his\nexamination-in-chief, give reasons for his belief, but he may be asked his reasons in cross-examination,\nand the answers which he gives cannot be contradicted, though, if they are false, he may afterwards be\ncharged with giving false evidence.\nIllustrations.\n(a) A sues B for the price of goods sold and delivered to B. C says that he delivered the goods to B.\nEvidence is offered to show that, on a previous occasion, he said that he had not delivered goods to B.\nThe evidence is admissible.\n(b)  A  is  accused  of  the  murder  of  B.  C  says  that  B,  when  dying,  declared  that  A  had  given  B  the\nwound of which he died. Evidence is offered to show that, on a previous occasion, C said that B, when\ndying, did not declare that A had given B the wound of which he died. The evidence is admissible.", "text_hi": "158. \n\n(\n\n) \n\n(\n\n)\n\n(\n\n) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n  (1)\n\n,\n\n,\n\n,\n\n ;  \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n ;  \n\n,\n\n, \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "159", "heading_en": "Questions tending to corroborate evidence of relevant fact, admissible.—When a", "text_en": "witness whom it is intended to corroborate gives evidence of any relevant fact, he may be questioned as\nto any other circumstances which he observed at or near to the time or place at which such relevant fact\noccurred, if the Court is of opinion that such circumstances, if proved, would corroborate the testimony of\nthe witness as to the relevant fact which he testifies.\nIllustration.\nA, an accomplice, gives an account of a robbery in which he took part. He describes various incidents\nunconnected with the robbery which occurred on his way to and from the place where it was committed.\nIndependent evidence of these facts may be given in order to corroborate his evidence as to the robbery\nitself.", "text_hi": "159. \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n-\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "160", "heading_en": "Former statements of witness may be proved to corroborate later testimony as to", "text_en": "same  fact.—In  order  to  corroborate  the  testimony  of  a  witness,  any  former  statement  made  by  such\nwitness relating to the same fact, at or about the time when the fact took place, or before any authority\nlegally competent to investigate the fact, may be proved.", "text_hi": "160.\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "161", "heading_en": "What matters may be proved in connection with proved statement relevant under", "text_en": "section 26 or 27.—Whenever any statement, relevant under section 26 or 27, is proved, all matters may\nbe proved either in order to contradict or to corroborate it, or in order to impeach or confirm the credit of\nthe  person  by  whom  it  was  made,  which  might  have  been  proved  if  that  person  had  been  called  as  a\nwitness and had denied upon cross-examination the truth of the matter suggested.", "text_hi": "161. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "162", "heading_en": "Refreshing memory.—(1) A witness may, while under examination, refresh his memory by", "text_en": "referring to any writing made by himself at the time of the transaction concerning which he is questioned,\nor so soon afterwards that the Court considers it likely that the transaction was at that time fresh in his\nmemory:\nProvided that the witness may also refer to any such writing made by any other person, and read by\nthe witness within the time aforesaid, if when he read it, he knew it to be correct.\n(2)  Whenever  a  witness  may  refresh  his  memory  by  reference  to  any  document,  he  may,  with  the\npermission of the Court, refer to a copy of such document:\nProvided  that  the  Court  be  satisfied  that  there  is  sufficient  reason  for  the  non-production  of  the\noriginal:\nProvided further that an expert may refresh his memory by reference to professional treatises.", "text_hi": "162. (1) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n  ,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "163", "heading_en": "Testimony to facts stated in document mentioned in section 162.—A witness may also", "text_en": "testify  to  facts  mentioned  in  any  such  document  as  is  mentioned  in  section  162,  although  he  has  no\nspecific  recollection  of  the  facts  themselves,  if  he  is  sure  that  the  facts  were  correctly  recorded  in  the\ndocument.\nIllustration.\nA book-keeper may testify to facts recorded by him in books regularly kept in the course of business,\nif  he  knows  that  the  books  were  correctly  kept,  although  he  has  forgotten  the  particular  transactions\nentered.", "text_hi": "163. \n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "164", "heading_en": "Right of adverse party as to writing used to refresh memory.—Any writing referred to", "text_en": "under the provisions of the two last preceding sections shall be produced and shown to the adverse party\nif he requires it; such party may, if he pleases, cross-examine the witness thereupon.", "text_hi": "164. \n\n;\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "165", "heading_en": "Production of documents.—(1) A witness summoned to produce a document shall, if it is in", "text_en": "his  possession  or  power,  bring  it  to  Court,  notwithstanding  any  objection  which  there  may  be  to  its\nproduction or to its admissibility:\nProvided that the validity of any such objection shall be decided on by the Court.\n(2)  The  Court,  if  it  sees  fit,  may  inspect  the  document,  unless  it  refers  to  matters  of  State,  or  take\nother evidence to enable it to determine on its admissibility.\n(3) If for such a purpose it is necessary to cause any document to be translated, the Court may, if it\nthinks fit, direct the translator to keep the contents secret, unless the document is to be given in evidence\nand,  if  the  interpreter  disobeys  such  direction,  he  shall  be  held  to  have  committed  an  offence\nunder section 198 of the Bharatiya Nyaya Sanhita, 2023:\nProvided that no Court shall require any communication between the Ministers and the President of\nIndia to be produced before it.", "text_hi": "165. (1) \n\n,\n\n,\n\n,\n\n,\n\n,\n\n,\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "166", "heading_en": "Giving, as evidence, of document called for and produced on notice.—When a party", "text_en": "calls  for  a  document  which  he  has  given  the  other  party  notice  to  produce,  and  such  document  is\nproduced and inspected by the party calling for its production, he is bound to give it as evidence if the\nparty producing it requires him to do so.", "text_hi": "166.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "167", "heading_en": "Using, as evidence, of document production of which was refused on", "text_en": "notice.— When a party refuses to produce a document which he has had notice to produce, he cannot\nafterwards use the document as evidence without the consent of the other party or the order of the Court.\nIllustration.\nA sues B on an agreement and gives B notice to produce it. At the trial, A calls for the document and\nB  refuses  to  produce  it.  A  gives  secondary  evidence  of  its  contents.  B  seeks  to  produce  the  document\nitself  to  contradict  the  secondary  evidence  given  by  A,  or  in  order  to  show  that  the  agreement  is  not\nstamped. He cannot do so.", "text_hi": "167.", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "168", "heading_en": "Judge’s power to put questions or order production.—The Judge may, in order to", "text_en": "discover or obtain proof of relevant facts, ask any question he considers necessary, in any form, at any\ntime, of any witness, or of the parties about any fact; and may order the production of any document or\nthing; and neither the parties nor their representatives shall be entitled to make any objection to any such\nquestion  or  order,  nor,  without  the  leave  of  the  Court,  to  cross-examine  any  witness  upon  any  answer\ngiven in reply to any such question:\nProvided that the judgment must be based upon facts declared by this Adhiniyam to be relevant, and\nduly proved:\nProvided further that this section shall not authorise any Judge to compel any witness to answer any\nquestion,  or  to  produce  any  document  which  such  witness  would  be  entitled  to  refuse  to  answer  or\nproduce under sections 127 to 136, both inclusive, if the question were asked or the document were called\nfor by the adverse party; nor shall the Judge ask any question which it would be improper for any other\nperson to ask under section 151 or 152; nor shall he dispense with primary evidence of any document,\nexcept in the cases hereinbefore excepted.", "text_hi": "168. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "169", "heading_en": "No new trial for improper admission or rejection of evidence.—The improper", "text_en": "admission or rejection of evidence shall not be ground of itself for a new trial or reversal of any decision\nin any case, if it shall appear to the Court before which such objection is raised that, independently of the\nevidence  objected  to  and  admitted,  there  was  sufficient  evidence  to  justify  the  decision,  or  that,  if  the\nrejected evidence had been received, it ought not to have varied the decision.", "text_hi": "169. \n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
{"act_id": "BSA-2023", "section_number": "170", "heading_en": "Repeal and savings.—(1) The Indian Evidence Act, 1872 (1 of 1872) is hereby repealed.", "text_en": "(2) Notwithstanding such repeal, if, immediately before the date on which this Adhiniyam comes into\nforce,  there  is  any  application,  trial,  inquiry,  investigation,  proceeding  or  appeal  pending,  then,  such\napplication, trial, inquiry, investigation, proceeding or appeal shall be dealt with under the provisions of\nthe Indian Evidence Act, 1872 (1 of 1872), as in force immediately before such commencement, as if this\nAdhiniyam had not come into force.\nTHE SCHEDULE\n[See section 63(4)(c)]\nCERTIFICATE\nPART A\n(To be filled by the Party)\nI,  _____________________  (Name),  Son/daughter/spouse  of  ___________________\nresiding/employed  at  __________________________  do  hereby  solemnly  affirm  and  sincerely\nstate and submit as follows:—\nI  have  produced  electronic  record/output  of  the  digital  record  taken  from  the  following\ndevice/digital record source (tick mark):—\nComputer / Storage Media □      DVR □       Mobile □       Flash Drive □\nCD/DVD □         Server □       Cloud □        Other □\nOther: ________________________________________\nMake & Model: _______________ Color: _______________\nSerial Number: _______________\nIMEI/UIN/UID/MAC/Cloud ID_____________________ (as applicable)\nand any other relevant information, if any, about the device/digital record____(specify).\nThe  digital  device  or  the  digital  record  source  was  under  the  lawful  control  for  regularly\ncreating, storing or processing information for the purposes of carrying out regular activities\nand during this period, the computer or the communication device was working properly and\nthe  relevant  information  was  regularly  fed  into  the  computer  during  the  ordinary  course  of\nbusiness. If the computer/digital device at any point of time was not working properly or out\nof operation, then it has not affected the electronic/digital record or its accuracy. The digital\ndevice or the source of the digital record is:—\nOwned □\nMaintained □\nManaged □\nOperated□\nby me (select as applicable).\nI state that the HASH value/s of the electronic/digital record/s is _________________,\nobtained through the following algorithm:—\n□ SHA1:\n□ SHA256:\n□ MD5:\n□ Other__________________ (Legally acceptable standard)\n(Hash report to be enclosed with the certificate)\nDate (DD/MM/YYYY): _____\nTime (IST): ________hours (In 24 hours format)\nPlace: ____________\n(Name and signature)\nPART B\n(To be filled by the Expert)\nI, ____________________ (Name), Son/daughter/spouse of ____________________\nresiding/employed at _________________________ do hereby solemnly affirm and\nsincerely state and submit as follows:—\nThe produced electronic record/output of the digital record are obtained from the following\ndevice/digital record source (tick mark):—\nMobile □\nComputer / Storage Media □     DVR □\nCD/DVD □  Server □\nOther □\nCloud □\nOther: ________________________________________\nFlash Drive □\nMake & Model: _______________ Color: _______________\nSerial Number: _______________\nIMEI/UIN/UID/MAC/Cloud ID_____________________ (as applicable)\nand any other relevant information, if any, about the device/digital record_______(specify).\nI state that the HASH value/s of the electronic/digital record/s is _____________________,\nobtained through the following algorithm:—\n□ SHA1:\n□ SHA256:\n□ MD5:\n□ Other__________________ (Legally acceptable standard)\n(Hash report to be enclosed with the certificate)\nDate (DD/MM/YYYY): _____\nTime (IST): ________hours (In 24 hours format)\nPlace: ____________\n(Name, designation and signature)", "text_hi": "170. (1) \n\n(2) \n\n,  872\n\n,", "source_hi": "data\\processed\\pdf\\bsa_2023_hi.txt"}
